/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const GUM_API_SIZE_NONE: i32 = -1;
pub const GUM_DARWIN_PORT_NULL: u32 = 0;
pub const GUM_DARWIN_EXPORT_KIND_MASK: u32 = 3;
pub const GUM_ELF_SECTION_MASK_OS: u32 = 267386880;
pub const GUM_ELF_SECTION_MASK_PROCESSOR: u32 = 4026531840;
pub const GUM_ARM_B_MAX_DISTANCE: u32 = 33554428;
pub const GUM_THUMB_B_MAX_DISTANCE: u32 = 16777214;
pub const GUM_ARM64_ADRP_MAX_DISTANCE: u32 = 4294963200;
pub const GUM_ARM64_B_MAX_DISTANCE: u32 = 134217724;
pub const GUM_MIPS_J_MAX_DISTANCE: u32 = 268435456;
pub const FRIDA_OBJECT_PATH_HELPER: &[u8; 17] = b"/re/frida/Helper\0";
pub const FRIDA_GDB_CLIENT_NOTIFICATION_TYPE_EXIT_STATUS: u8 = 87u8;
pub const FRIDA_GDB_CLIENT_NOTIFICATION_TYPE_EXIT_SIGNAL: u8 = 88u8;
pub const FRIDA_GDB_CLIENT_NOTIFICATION_TYPE_STOP: u8 = 83u8;
pub const FRIDA_GDB_CLIENT_NOTIFICATION_TYPE_STOP_WITH_PROPERTIES: u8 = 84u8;
pub const FRIDA_GDB_CLIENT_NOTIFICATION_TYPE_OUTPUT: u8 = 79u8;
pub const FRIDA_FRUITY_PAIRING_BROWSER_SERVICE_NAME: &[u8; 26] = b"_remotepairing._tcp.local\0";
pub const FRIDA_FRUITY_PAIRING_SERVICE_DNS_SD_NAME: &[u8; 26] = b"_remotepairing._tcp.local\0";
pub const FRIDA_FRUITY_RESOLVED_SERVICE_NAME: &[u8; 25] = b"org.freedesktop.resolve1\0";
pub const FRIDA_FRUITY_RESOLVED_SERVICE_PATH: &[u8; 26] = b"/org/freedesktop/resolve1\0";
pub type gint8 = ::std::os::raw::c_schar;
pub type guint8 = ::std::os::raw::c_uchar;
pub type gint16 = ::std::os::raw::c_short;
pub type guint16 = ::std::os::raw::c_ushort;
pub type gint32 = ::std::os::raw::c_int;
pub type guint32 = ::std::os::raw::c_uint;
pub type gint64 = ::std::os::raw::c_long;
pub type guint64 = ::std::os::raw::c_ulong;
pub type gssize = ::std::os::raw::c_long;
pub type gsize = ::std::os::raw::c_ulong;
pub type gchar = ::std::os::raw::c_char;
pub type glong = ::std::os::raw::c_long;
pub type gint = ::std::os::raw::c_int;
pub type gboolean = gint;
pub type gulong = ::std::os::raw::c_ulong;
pub type guint = ::std::os::raw::c_uint;
pub type gfloat = f32;
pub type gdouble = f64;
pub type gpointer = *mut ::std::os::raw::c_void;
pub type gconstpointer = *const ::std::os::raw::c_void;
pub type GEqualFunc =
    ::std::option::Option<unsafe extern "C" fn(a: gconstpointer, b: gconstpointer) -> gboolean>;
pub type GDestroyNotify = ::std::option::Option<unsafe extern "C" fn(data: gpointer)>;
pub type GFunc = ::std::option::Option<unsafe extern "C" fn(data: gpointer, user_data: gpointer)>;
pub type GHashFunc = ::std::option::Option<unsafe extern "C" fn(key: gconstpointer) -> guint>;
pub type GHFunc = ::std::option::Option<
    unsafe extern "C" fn(key: gpointer, value: gpointer, user_data: gpointer),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GBytes {
    _unused: [u8; 0],
}
pub type GBytes = _GBytes;
pub type GArray = _GArray;
pub type GByteArray = _GByteArray;
pub type GPtrArray = _GPtrArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GArray {
    pub data: *mut gchar,
    pub len: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GArray"][::std::mem::size_of::<_GArray>() - 16usize];
    ["Alignment of _GArray"][::std::mem::align_of::<_GArray>() - 8usize];
    ["Offset of field: _GArray::data"][::std::mem::offset_of!(_GArray, data) - 0usize];
    ["Offset of field: _GArray::len"][::std::mem::offset_of!(_GArray, len) - 8usize];
};
impl Default for _GArray {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GByteArray {
    pub data: *mut guint8,
    pub len: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GByteArray"][::std::mem::size_of::<_GByteArray>() - 16usize];
    ["Alignment of _GByteArray"][::std::mem::align_of::<_GByteArray>() - 8usize];
    ["Offset of field: _GByteArray::data"][::std::mem::offset_of!(_GByteArray, data) - 0usize];
    ["Offset of field: _GByteArray::len"][::std::mem::offset_of!(_GByteArray, len) - 8usize];
};
impl Default for _GByteArray {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GPtrArray {
    pub pdata: *mut gpointer,
    pub len: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GPtrArray"][::std::mem::size_of::<_GPtrArray>() - 16usize];
    ["Alignment of _GPtrArray"][::std::mem::align_of::<_GPtrArray>() - 8usize];
    ["Offset of field: _GPtrArray::pdata"][::std::mem::offset_of!(_GPtrArray, pdata) - 0usize];
    ["Offset of field: _GPtrArray::len"][::std::mem::offset_of!(_GPtrArray, len) - 8usize];
};
impl Default for _GPtrArray {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type va_list = __builtin_va_list;
pub type GQuark = guint32;
#[doc = " GError:\n @domain: error domain, e.g. %G_FILE_ERROR\n @code: error code, e.g. %G_FILE_ERROR_NOENT\n @message: human-readable informative error message\n\n The `GError` structure contains information about\n an error that has occurred."]
pub type GError = _GError;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GError {
    pub domain: GQuark,
    pub code: gint,
    pub message: *mut gchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GError"][::std::mem::size_of::<_GError>() - 16usize];
    ["Alignment of _GError"][::std::mem::align_of::<_GError>() - 8usize];
    ["Offset of field: _GError::domain"][::std::mem::offset_of!(_GError, domain) - 0usize];
    ["Offset of field: _GError::code"][::std::mem::offset_of!(_GError, code) - 4usize];
    ["Offset of field: _GError::message"][::std::mem::offset_of!(_GError, message) - 8usize];
};
impl Default for _GError {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GDateTime {
    _unused: [u8; 0],
}
#[doc = " GDateTime:\n\n An opaque structure that represents a date and time, including a time zone.\n\n Since: 2.26"]
pub type GDateTime = _GDateTime;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GData {
    _unused: [u8; 0],
}
pub type GData = _GData;
pub type GList = _GList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GList {
    pub data: gpointer,
    pub next: *mut GList,
    pub prev: *mut GList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GList"][::std::mem::size_of::<_GList>() - 24usize];
    ["Alignment of _GList"][::std::mem::align_of::<_GList>() - 8usize];
    ["Offset of field: _GList::data"][::std::mem::offset_of!(_GList, data) - 0usize];
    ["Offset of field: _GList::next"][::std::mem::offset_of!(_GList, next) - 8usize];
    ["Offset of field: _GList::prev"][::std::mem::offset_of!(_GList, prev) - 16usize];
};
impl Default for _GList {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GHashTable {
    _unused: [u8; 0],
}
pub type GHashTable = _GHashTable;
pub type GHRFunc = ::std::option::Option<
    unsafe extern "C" fn(key: gpointer, value: gpointer, user_data: gpointer) -> gboolean,
>;
pub type GSList = _GSList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSList {
    pub data: gpointer,
    pub next: *mut GSList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSList"][::std::mem::size_of::<_GSList>() - 16usize];
    ["Alignment of _GSList"][::std::mem::align_of::<_GSList>() - 8usize];
    ["Offset of field: _GSList::data"][::std::mem::offset_of!(_GSList, data) - 0usize];
    ["Offset of field: _GSList::next"][::std::mem::offset_of!(_GSList, next) - 8usize];
};
impl Default for _GSList {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const GIOCondition_G_IO_IN: GIOCondition = 1;
pub const GIOCondition_G_IO_OUT: GIOCondition = 4;
pub const GIOCondition_G_IO_PRI: GIOCondition = 2;
pub const GIOCondition_G_IO_ERR: GIOCondition = 8;
pub const GIOCondition_G_IO_HUP: GIOCondition = 16;
pub const GIOCondition_G_IO_NVAL: GIOCondition = 32;
pub type GIOCondition = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GMainContext {
    _unused: [u8; 0],
}
#[doc = " GMainContext:\n\n The `GMainContext` struct is an opaque data\n type representing a set of sources to be handled in a main loop."]
pub type GMainContext = _GMainContext;
#[doc = " GSource:\n\n The `GSource` struct is an opaque data type\n representing an event source."]
pub type GSource = _GSource;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSourcePrivate {
    _unused: [u8; 0],
}
pub type GSourcePrivate = _GSourcePrivate;
#[doc = " GSourceCallbackFuncs:\n @ref: Called when a reference is added to the callback object\n @unref: Called when a reference to the callback object is dropped\n @get: Called to extract the callback function and data from the\n     callback object.\n\n The `GSourceCallbackFuncs` struct contains\n functions for managing callback objects."]
pub type GSourceCallbackFuncs = _GSourceCallbackFuncs;
#[doc = " GSourceFuncs:\n @prepare: Called before all the file descriptors are polled. If the\n     source can determine that it is ready here (without waiting for the\n     results of the poll() call) it should return %TRUE. It can also return\n     a @timeout_ value which should be the maximum timeout (in milliseconds)\n     which should be passed to the poll() call. The actual timeout used will\n     be -1 if all sources returned -1, or it will be the minimum of all\n     the @timeout_ values returned which were >= 0.  Since 2.36 this may\n     be %NULL, in which case the effect is as if the function always returns\n     %FALSE with a timeout of -1.  If @prepare returns a\n     timeout and the source also has a ready time set, then the\n     lower of the two will be used.\n @check: Called after all the file descriptors are polled. The source\n     should return %TRUE if it is ready to be dispatched. Note that some\n     time may have passed since the previous prepare function was called,\n     so the source should be checked again here.  Since 2.36 this may\n     be %NULL, in which case the effect is as if the function always returns\n     %FALSE.\n @dispatch: Called to dispatch the event source, after it has returned\n     %TRUE in either its @prepare or its @check function, or if a ready time\n     has been reached. The @dispatch function receives a callback function and\n     user data. The callback function may be %NULL if the source was never\n     connected to a callback using g_source_set_callback(). The @dispatch\n     function should call the callback function with @user_data and whatever\n     additional parameters are needed for this type of event source. The\n     return value of the @dispatch function should be %G_SOURCE_REMOVE if the\n     source should be removed or %G_SOURCE_CONTINUE to keep it.\n @finalize: Called when the source is finalized. At this point, the source\n     will have been destroyed, had its callback cleared, and have been removed\n     from its #GMainContext, but it will still have its final reference count,\n     so methods can be called on it from within this function.\n\n The `GSourceFuncs` struct contains a table of\n functions used to handle event sources in a generic manner.\n\n For idle sources, the prepare and check functions always return %TRUE\n to indicate that the source is always ready to be processed. The prepare\n function also returns a timeout value of 0 to ensure that the poll() call\n doesn't block (since that would be time wasted which could have been spent\n running the idle function).\n\n For timeout sources, the prepare and check functions both return %TRUE\n if the timeout interval has expired. The prepare function also returns\n a timeout value to ensure that the poll() call doesn't block too long\n and miss the next timeout.\n\n For file descriptor sources, the prepare function typically returns %FALSE,\n since it must wait until poll() has been called before it knows whether\n any events need to be processed. It sets the returned timeout to -1 to\n indicate that it doesn't mind how long the poll() call blocks. In the\n check function, it tests the results of the poll() call to see if the\n required condition has been met, and returns %TRUE if so."]
pub type GSourceFuncs = _GSourceFuncs;
#[doc = " GSourceFunc:\n @user_data: data passed to the function, set when the source was\n     created with one of the above functions\n\n Specifies the type of function passed to g_timeout_add(),\n g_timeout_add_full(), g_idle_add(), and g_idle_add_full().\n\n When calling g_source_set_callback(), you may need to cast a function of a\n different type to this type. Use G_SOURCE_FUNC() to avoid warnings about\n incompatible function types.\n\n Returns: %FALSE if the source should be removed. %G_SOURCE_CONTINUE and\n %G_SOURCE_REMOVE are more memorable names for the return value."]
pub type GSourceFunc = ::std::option::Option<unsafe extern "C" fn(user_data: gpointer) -> gboolean>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSource {
    pub callback_data: gpointer,
    pub callback_funcs: *mut GSourceCallbackFuncs,
    pub source_funcs: *const GSourceFuncs,
    pub ref_count: guint,
    pub context: *mut GMainContext,
    pub priority: gint,
    pub flags: guint,
    pub source_id: guint,
    pub poll_fds: *mut GSList,
    pub prev: *mut GSource,
    pub next: *mut GSource,
    pub name: *mut ::std::os::raw::c_char,
    pub priv_: *mut GSourcePrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSource"][::std::mem::size_of::<_GSource>() - 96usize];
    ["Alignment of _GSource"][::std::mem::align_of::<_GSource>() - 8usize];
    ["Offset of field: _GSource::callback_data"]
        [::std::mem::offset_of!(_GSource, callback_data) - 0usize];
    ["Offset of field: _GSource::callback_funcs"]
        [::std::mem::offset_of!(_GSource, callback_funcs) - 8usize];
    ["Offset of field: _GSource::source_funcs"]
        [::std::mem::offset_of!(_GSource, source_funcs) - 16usize];
    ["Offset of field: _GSource::ref_count"][::std::mem::offset_of!(_GSource, ref_count) - 24usize];
    ["Offset of field: _GSource::context"][::std::mem::offset_of!(_GSource, context) - 32usize];
    ["Offset of field: _GSource::priority"][::std::mem::offset_of!(_GSource, priority) - 40usize];
    ["Offset of field: _GSource::flags"][::std::mem::offset_of!(_GSource, flags) - 44usize];
    ["Offset of field: _GSource::source_id"][::std::mem::offset_of!(_GSource, source_id) - 48usize];
    ["Offset of field: _GSource::poll_fds"][::std::mem::offset_of!(_GSource, poll_fds) - 56usize];
    ["Offset of field: _GSource::prev"][::std::mem::offset_of!(_GSource, prev) - 64usize];
    ["Offset of field: _GSource::next"][::std::mem::offset_of!(_GSource, next) - 72usize];
    ["Offset of field: _GSource::name"][::std::mem::offset_of!(_GSource, name) - 80usize];
    ["Offset of field: _GSource::priv_"][::std::mem::offset_of!(_GSource, priv_) - 88usize];
};
impl Default for _GSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _GSourceCallbackFuncs {
    pub ref_: ::std::option::Option<unsafe extern "C" fn(cb_data: gpointer)>,
    pub unref: ::std::option::Option<unsafe extern "C" fn(cb_data: gpointer)>,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            cb_data: gpointer,
            source: *mut GSource,
            func: *mut GSourceFunc,
            data: *mut gpointer,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSourceCallbackFuncs"][::std::mem::size_of::<_GSourceCallbackFuncs>() - 24usize];
    ["Alignment of _GSourceCallbackFuncs"]
        [::std::mem::align_of::<_GSourceCallbackFuncs>() - 8usize];
    ["Offset of field: _GSourceCallbackFuncs::ref_"]
        [::std::mem::offset_of!(_GSourceCallbackFuncs, ref_) - 0usize];
    ["Offset of field: _GSourceCallbackFuncs::unref"]
        [::std::mem::offset_of!(_GSourceCallbackFuncs, unref) - 8usize];
    ["Offset of field: _GSourceCallbackFuncs::get"]
        [::std::mem::offset_of!(_GSourceCallbackFuncs, get) - 16usize];
};
#[doc = " GSourceDummyMarshal:\n\n This is just a placeholder for #GClosureMarshal,\n which cannot be used here for dependency reasons."]
pub type GSourceDummyMarshal = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _GSourceFuncs {
    pub prepare: ::std::option::Option<
        unsafe extern "C" fn(source: *mut GSource, timeout_: *mut gint) -> gboolean,
    >,
    pub check: ::std::option::Option<unsafe extern "C" fn(source: *mut GSource) -> gboolean>,
    pub dispatch: ::std::option::Option<
        unsafe extern "C" fn(
            source: *mut GSource,
            callback: GSourceFunc,
            user_data: gpointer,
        ) -> gboolean,
    >,
    pub finalize: ::std::option::Option<unsafe extern "C" fn(source: *mut GSource)>,
    pub closure_callback: GSourceFunc,
    pub closure_marshal: GSourceDummyMarshal,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSourceFuncs"][::std::mem::size_of::<_GSourceFuncs>() - 48usize];
    ["Alignment of _GSourceFuncs"][::std::mem::align_of::<_GSourceFuncs>() - 8usize];
    ["Offset of field: _GSourceFuncs::prepare"]
        [::std::mem::offset_of!(_GSourceFuncs, prepare) - 0usize];
    ["Offset of field: _GSourceFuncs::check"]
        [::std::mem::offset_of!(_GSourceFuncs, check) - 8usize];
    ["Offset of field: _GSourceFuncs::dispatch"]
        [::std::mem::offset_of!(_GSourceFuncs, dispatch) - 16usize];
    ["Offset of field: _GSourceFuncs::finalize"]
        [::std::mem::offset_of!(_GSourceFuncs, finalize) - 24usize];
    ["Offset of field: _GSourceFuncs::closure_callback"]
        [::std::mem::offset_of!(_GSourceFuncs, closure_callback) - 32usize];
    ["Offset of field: _GSourceFuncs::closure_marshal"]
        [::std::mem::offset_of!(_GSourceFuncs, closure_marshal) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GVariant {
    _unused: [u8; 0],
}
pub type GVariant = _GVariant;
#[doc = " GQueue:\n @head: a pointer to the first element of the queue\n @tail: a pointer to the last element of the queue\n @length: the number of elements in the queue\n\n Contains the public fields of a\n [Queue][glib-Double-ended-Queues]."]
pub type GQueue = _GQueue;
#[doc = " GQueue:\n @head: a pointer to the first element of the queue\n @tail: a pointer to the last element of the queue\n @length: the number of elements in the queue\n\n Contains the public fields of a\n [Queue][glib-Double-ended-Queues]."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GQueue {
    pub head: *mut GList,
    pub tail: *mut GList,
    pub length: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GQueue"][::std::mem::size_of::<_GQueue>() - 24usize];
    ["Alignment of _GQueue"][::std::mem::align_of::<_GQueue>() - 8usize];
    ["Offset of field: _GQueue::head"][::std::mem::offset_of!(_GQueue, head) - 0usize];
    ["Offset of field: _GQueue::tail"][::std::mem::offset_of!(_GQueue, tail) - 8usize];
    ["Offset of field: _GQueue::length"][::std::mem::offset_of!(_GQueue, length) - 16usize];
};
impl Default for _GQueue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 200usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 8usize];
    ["Offset of field: __jmp_buf_tag::__jmpbuf"]
        [::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    ["Offset of field: __jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 64usize];
    ["Offset of field: __jmp_buf_tag::__saved_mask"]
        [::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 72usize];
};
pub type GType = gsize;
#[doc = " GValue:\n\n An opaque structure used to hold different types of values.\n\n The data within the structure has protected scope: it is accessible only\n to functions within a #GTypeValueTable structure, or implementations of\n the g_value_*() API. That is, code portions which implement new fundamental\n types.\n\n #GValue users cannot make any assumptions about how data is stored\n within the 2 element @data union, and the @g_type member should\n only be accessed through the G_VALUE_TYPE() macro."]
pub type GValue = _GValue;
#[doc = " GTypeClass:\n\n An opaque structure used as the base of all classes."]
pub type GTypeClass = _GTypeClass;
#[doc = " GTypeInterface:\n\n An opaque structure used as the base of all interface types."]
pub type GTypeInterface = _GTypeInterface;
#[doc = " GTypeInstance:\n\n An opaque structure used as the base of all type instances."]
pub type GTypeInstance = _GTypeInstance;
#[doc = " GTypeClass:\n\n An opaque structure used as the base of all classes."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _GTypeClass {
    pub g_type: GType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GTypeClass"][::std::mem::size_of::<_GTypeClass>() - 8usize];
    ["Alignment of _GTypeClass"][::std::mem::align_of::<_GTypeClass>() - 8usize];
    ["Offset of field: _GTypeClass::g_type"][::std::mem::offset_of!(_GTypeClass, g_type) - 0usize];
};
#[doc = " GTypeInstance:\n\n An opaque structure used as the base of all type instances."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GTypeInstance {
    pub g_class: *mut GTypeClass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GTypeInstance"][::std::mem::size_of::<_GTypeInstance>() - 8usize];
    ["Alignment of _GTypeInstance"][::std::mem::align_of::<_GTypeInstance>() - 8usize];
    ["Offset of field: _GTypeInstance::g_class"]
        [::std::mem::offset_of!(_GTypeInstance, g_class) - 0usize];
};
impl Default for _GTypeInstance {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GTypeInterface:\n\n An opaque structure used as the base of all interface types."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _GTypeInterface {
    pub g_type: GType,
    pub g_instance_type: GType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GTypeInterface"][::std::mem::size_of::<_GTypeInterface>() - 16usize];
    ["Alignment of _GTypeInterface"][::std::mem::align_of::<_GTypeInterface>() - 8usize];
    ["Offset of field: _GTypeInterface::g_type"]
        [::std::mem::offset_of!(_GTypeInterface, g_type) - 0usize];
    ["Offset of field: _GTypeInterface::g_instance_type"]
        [::std::mem::offset_of!(_GTypeInterface, g_instance_type) - 8usize];
};
#[doc = " GValue:\n\n An opaque structure used to hold different types of values.\n\n The data within the structure has protected scope: it is accessible only\n to functions within a #GTypeValueTable structure, or implementations of\n the g_value_*() API. That is, code portions which implement new fundamental\n types.\n\n #GValue users cannot make any assumptions about how data is stored\n within the 2 element @data union, and the @g_type member should\n only be accessed through the G_VALUE_TYPE() macro."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _GValue {
    pub g_type: GType,
    pub data: [_GValue__bindgen_ty_1; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _GValue__bindgen_ty_1 {
    pub v_int: gint,
    pub v_uint: guint,
    pub v_long: glong,
    pub v_ulong: gulong,
    pub v_int64: gint64,
    pub v_uint64: guint64,
    pub v_float: gfloat,
    pub v_double: gdouble,
    pub v_pointer: gpointer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GValue__bindgen_ty_1"][::std::mem::size_of::<_GValue__bindgen_ty_1>() - 8usize];
    ["Alignment of _GValue__bindgen_ty_1"]
        [::std::mem::align_of::<_GValue__bindgen_ty_1>() - 8usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_int"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_int) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_uint"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_uint) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_long"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_long) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_ulong"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_ulong) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_int64"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_int64) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_uint64"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_uint64) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_float"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_float) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_double"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_double) - 0usize];
    ["Offset of field: _GValue__bindgen_ty_1::v_pointer"]
        [::std::mem::offset_of!(_GValue__bindgen_ty_1, v_pointer) - 0usize];
};
impl Default for _GValue__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GValue"][::std::mem::size_of::<_GValue>() - 24usize];
    ["Alignment of _GValue"][::std::mem::align_of::<_GValue>() - 8usize];
    ["Offset of field: _GValue::g_type"][::std::mem::offset_of!(_GValue, g_type) - 0usize];
    ["Offset of field: _GValue::data"][::std::mem::offset_of!(_GValue, data) - 8usize];
};
impl Default for _GValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const GParamFlags_G_PARAM_READABLE: GParamFlags = 1;
pub const GParamFlags_G_PARAM_WRITABLE: GParamFlags = 2;
pub const GParamFlags_G_PARAM_READWRITE: GParamFlags = 3;
pub const GParamFlags_G_PARAM_CONSTRUCT: GParamFlags = 4;
pub const GParamFlags_G_PARAM_CONSTRUCT_ONLY: GParamFlags = 8;
pub const GParamFlags_G_PARAM_LAX_VALIDATION: GParamFlags = 16;
pub const GParamFlags_G_PARAM_STATIC_NAME: GParamFlags = 32;
pub const GParamFlags_G_PARAM_PRIVATE: GParamFlags = 32;
pub const GParamFlags_G_PARAM_STATIC_NICK: GParamFlags = 64;
pub const GParamFlags_G_PARAM_STATIC_BLURB: GParamFlags = 128;
pub const GParamFlags_G_PARAM_EXPLICIT_NOTIFY: GParamFlags = 1073741824;
pub const GParamFlags_G_PARAM_DEPRECATED: GParamFlags = -2147483648;
#[doc = " GParamFlags:\n @G_PARAM_READABLE: the parameter is readable\n @G_PARAM_WRITABLE: the parameter is writable\n @G_PARAM_READWRITE: alias for %G_PARAM_READABLE | %G_PARAM_WRITABLE\n @G_PARAM_CONSTRUCT: the parameter will be set upon object construction\n @G_PARAM_CONSTRUCT_ONLY: the parameter can only be set upon object construction\n @G_PARAM_LAX_VALIDATION: upon parameter conversion (see g_param_value_convert())\n  strict validation is not required\n @G_PARAM_STATIC_NAME: the string used as name when constructing the\n  parameter is guaranteed to remain valid and\n  unmodified for the lifetime of the parameter.\n  Since 2.8\n @G_PARAM_STATIC_NICK: the string used as nick when constructing the\n  parameter is guaranteed to remain valid and\n  unmmodified for the lifetime of the parameter.\n  Since 2.8\n @G_PARAM_STATIC_BLURB: the string used as blurb when constructing the\n  parameter is guaranteed to remain valid and\n  unmodified for the lifetime of the parameter.\n  Since 2.8\n @G_PARAM_EXPLICIT_NOTIFY: calls to g_object_set_property() for this\n   property will not automatically result in a \"notify\" signal being\n   emitted: the implementation must call g_object_notify() themselves\n   in case the property actually changes.  Since: 2.42.\n @G_PARAM_PRIVATE: internal\n @G_PARAM_DEPRECATED: the parameter is deprecated and will be removed\n  in a future version. A warning will be generated if it is used\n  while running with G_ENABLE_DIAGNOSTIC=1.\n  Since 2.26\n\n Through the #GParamFlags flag values, certain aspects of parameters\n can be configured.\n\n See also: %G_PARAM_STATIC_STRINGS"]
pub type GParamFlags = ::std::os::raw::c_int;
#[doc = " GParamSpec: (ref-func g_param_spec_ref_sink) (unref-func g_param_spec_unref) (set-value-func g_value_set_param) (get-value-func g_value_get_param)\n @g_type_instance: private #GTypeInstance portion\n @name: name of this parameter: always an interned string\n @flags: #GParamFlags flags for this parameter\n @value_type: the #GValue type for this parameter\n @owner_type: #GType type that uses (introduces) this parameter\n\n All other fields of the GParamSpec struct are private and\n should not be used directly."]
pub type GParamSpec = _GParamSpec;
#[doc = " GParamSpec: (ref-func g_param_spec_ref_sink) (unref-func g_param_spec_unref) (set-value-func g_value_set_param) (get-value-func g_value_get_param)\n @g_type_instance: private #GTypeInstance portion\n @name: name of this parameter: always an interned string\n @flags: #GParamFlags flags for this parameter\n @value_type: the #GValue type for this parameter\n @owner_type: #GType type that uses (introduces) this parameter\n\n All other fields of the GParamSpec struct are private and\n should not be used directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GParamSpec {
    pub g_type_instance: GTypeInstance,
    pub name: *const gchar,
    pub flags: GParamFlags,
    pub value_type: GType,
    pub owner_type: GType,
    pub _nick: *mut gchar,
    pub _blurb: *mut gchar,
    pub qdata: *mut GData,
    pub ref_count: guint,
    pub param_id: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GParamSpec"][::std::mem::size_of::<_GParamSpec>() - 72usize];
    ["Alignment of _GParamSpec"][::std::mem::align_of::<_GParamSpec>() - 8usize];
    ["Offset of field: _GParamSpec::g_type_instance"]
        [::std::mem::offset_of!(_GParamSpec, g_type_instance) - 0usize];
    ["Offset of field: _GParamSpec::name"][::std::mem::offset_of!(_GParamSpec, name) - 8usize];
    ["Offset of field: _GParamSpec::flags"][::std::mem::offset_of!(_GParamSpec, flags) - 16usize];
    ["Offset of field: _GParamSpec::value_type"]
        [::std::mem::offset_of!(_GParamSpec, value_type) - 24usize];
    ["Offset of field: _GParamSpec::owner_type"]
        [::std::mem::offset_of!(_GParamSpec, owner_type) - 32usize];
    ["Offset of field: _GParamSpec::_nick"][::std::mem::offset_of!(_GParamSpec, _nick) - 40usize];
    ["Offset of field: _GParamSpec::_blurb"][::std::mem::offset_of!(_GParamSpec, _blurb) - 48usize];
    ["Offset of field: _GParamSpec::qdata"][::std::mem::offset_of!(_GParamSpec, qdata) - 56usize];
    ["Offset of field: _GParamSpec::ref_count"]
        [::std::mem::offset_of!(_GParamSpec, ref_count) - 64usize];
    ["Offset of field: _GParamSpec::param_id"]
        [::std::mem::offset_of!(_GParamSpec, param_id) - 68usize];
};
impl Default for _GParamSpec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GBoxedCopyFunc:\n @boxed: (not nullable): The boxed structure to be copied.\n\n This function is provided by the user and should produce a copy\n of the passed in boxed structure.\n\n Returns: (not nullable): The newly created copy of the boxed structure."]
pub type GBoxedCopyFunc = ::std::option::Option<unsafe extern "C" fn(boxed: gpointer) -> gpointer>;
#[doc = " GObject:\n\n The base object type.\n\n All the fields in the `GObject` structure are private to the implementation\n and should never be accessed directly.\n\n Since GLib 2.72, all #GObjects are guaranteed to be aligned to at least the\n alignment of the largest basic GLib type (typically this is #guint64 or\n #gdouble). If you need larger alignment for an element in a #GObject, you\n should allocate it on the heap (aligned), or arrange for your #GObject to be\n appropriately padded. This guarantee applies to the #GObject (or derived)\n struct, the #GObjectClass (or derived) struct, and any private data allocated\n by G_ADD_PRIVATE()."]
pub type GObject = _GObject;
#[doc = " GObjectClass:\n @g_type_class: the parent class\n @constructor: the @constructor function is called by g_object_new () to\n  complete the object initialization after all the construction properties are\n  set. The first thing a @constructor implementation must do is chain up to the\n  @constructor of the parent class. Overriding @constructor should be rarely\n  needed, e.g. to handle construct properties, or to implement singletons.\n @set_property: the generic setter for all properties of this type. Should be\n  overridden for every type with properties. If implementations of\n  @set_property don't emit property change notification explicitly, this will\n  be done implicitly by the type system. However, if the notify signal is\n  emitted explicitly, the type system will not emit it a second time.\n @get_property: the generic getter for all properties of this type. Should be\n  overridden for every type with properties.\n @dispose: the @dispose function is supposed to drop all references to other\n  objects, but keep the instance otherwise intact, so that client method\n  invocations still work. It may be run multiple times (due to reference\n  loops). Before returning, @dispose should chain up to the @dispose method\n  of the parent class.\n @finalize: instance finalization function, should finish the finalization of\n  the instance begun in @dispose and chain up to the @finalize method of the\n  parent class.\n @dispatch_properties_changed: emits property change notification for a bunch\n  of properties. Overriding @dispatch_properties_changed should be rarely\n  needed.\n @notify: the class closure for the notify signal\n @constructed: the @constructed function is called by g_object_new() as the\n  final step of the object creation process.  At the point of the call, all\n  construction properties have been set on the object.  The purpose of this\n  call is to allow for object initialisation steps that can only be performed\n  after construction properties have been set.  @constructed implementors\n  should chain up to the @constructed call of their parent class to allow it\n  to complete its initialisation.\n\n The class structure for the GObject type.\n\n |[<!-- language=\"C\" -->\n // Example of implementing a singleton using a constructor.\n static MySingleton *the_singleton = NULL;\n\n static GObject*\n my_singleton_constructor (GType                  type,\n                           guint                  n_construct_params,\n                           GObjectConstructParam *construct_params)\n {\n   GObject *object;\n\n   if (!the_singleton)\n     {\n       object = G_OBJECT_CLASS (parent_class)->constructor (type,\n                                                            n_construct_params,\n                                                            construct_params);\n       the_singleton = MY_SINGLETON (object);\n     }\n   else\n     object = g_object_ref (G_OBJECT (the_singleton));\n\n   return object;\n }\n ]|"]
pub type GObjectClass = _GObjectClass;
#[doc = " GObjectConstructParam:\n @pspec: the #GParamSpec of the construct parameter\n @value: the value to set the parameter to\n\n The GObjectConstructParam struct is an auxiliary structure used to hand\n #GParamSpec/#GValue pairs to the @constructor of a #GObjectClass."]
pub type GObjectConstructParam = _GObjectConstructParam;
#[doc = " GObject:\n\n The base object type.\n\n All the fields in the `GObject` structure are private to the implementation\n and should never be accessed directly.\n\n Since GLib 2.72, all #GObjects are guaranteed to be aligned to at least the\n alignment of the largest basic GLib type (typically this is #guint64 or\n #gdouble). If you need larger alignment for an element in a #GObject, you\n should allocate it on the heap (aligned), or arrange for your #GObject to be\n appropriately padded. This guarantee applies to the #GObject (or derived)\n struct, the #GObjectClass (or derived) struct, and any private data allocated\n by G_ADD_PRIVATE()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GObject {
    pub g_type_instance: GTypeInstance,
    pub ref_count: guint,
    pub qdata: *mut GData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GObject"][::std::mem::size_of::<_GObject>() - 24usize];
    ["Alignment of _GObject"][::std::mem::align_of::<_GObject>() - 8usize];
    ["Offset of field: _GObject::g_type_instance"]
        [::std::mem::offset_of!(_GObject, g_type_instance) - 0usize];
    ["Offset of field: _GObject::ref_count"][::std::mem::offset_of!(_GObject, ref_count) - 8usize];
    ["Offset of field: _GObject::qdata"][::std::mem::offset_of!(_GObject, qdata) - 16usize];
};
impl Default for _GObject {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GObjectClass:\n @g_type_class: the parent class\n @constructor: the @constructor function is called by g_object_new () to\n  complete the object initialization after all the construction properties are\n  set. The first thing a @constructor implementation must do is chain up to the\n  @constructor of the parent class. Overriding @constructor should be rarely\n  needed, e.g. to handle construct properties, or to implement singletons.\n @set_property: the generic setter for all properties of this type. Should be\n  overridden for every type with properties. If implementations of\n  @set_property don't emit property change notification explicitly, this will\n  be done implicitly by the type system. However, if the notify signal is\n  emitted explicitly, the type system will not emit it a second time.\n @get_property: the generic getter for all properties of this type. Should be\n  overridden for every type with properties.\n @dispose: the @dispose function is supposed to drop all references to other\n  objects, but keep the instance otherwise intact, so that client method\n  invocations still work. It may be run multiple times (due to reference\n  loops). Before returning, @dispose should chain up to the @dispose method\n  of the parent class.\n @finalize: instance finalization function, should finish the finalization of\n  the instance begun in @dispose and chain up to the @finalize method of the\n  parent class.\n @dispatch_properties_changed: emits property change notification for a bunch\n  of properties. Overriding @dispatch_properties_changed should be rarely\n  needed.\n @notify: the class closure for the notify signal\n @constructed: the @constructed function is called by g_object_new() as the\n  final step of the object creation process.  At the point of the call, all\n  construction properties have been set on the object.  The purpose of this\n  call is to allow for object initialisation steps that can only be performed\n  after construction properties have been set.  @constructed implementors\n  should chain up to the @constructed call of their parent class to allow it\n  to complete its initialisation.\n\n The class structure for the GObject type.\n\n |[<!-- language=\"C\" -->\n // Example of implementing a singleton using a constructor.\n static MySingleton *the_singleton = NULL;\n\n static GObject*\n my_singleton_constructor (GType                  type,\n                           guint                  n_construct_params,\n                           GObjectConstructParam *construct_params)\n {\n   GObject *object;\n\n   if (!the_singleton)\n     {\n       object = G_OBJECT_CLASS (parent_class)->constructor (type,\n                                                            n_construct_params,\n                                                            construct_params);\n       the_singleton = MY_SINGLETON (object);\n     }\n   else\n     object = g_object_ref (G_OBJECT (the_singleton));\n\n   return object;\n }\n ]|"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GObjectClass {
    pub g_type_class: GTypeClass,
    pub construct_properties: *mut GSList,
    pub constructor: ::std::option::Option<
        unsafe extern "C" fn(
            type_: GType,
            n_construct_properties: guint,
            construct_properties: *mut GObjectConstructParam,
        ) -> *mut GObject,
    >,
    pub set_property: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut GObject,
            property_id: guint,
            value: *const GValue,
            pspec: *mut GParamSpec,
        ),
    >,
    pub get_property: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut GObject,
            property_id: guint,
            value: *mut GValue,
            pspec: *mut GParamSpec,
        ),
    >,
    pub dispose: ::std::option::Option<unsafe extern "C" fn(object: *mut GObject)>,
    pub finalize: ::std::option::Option<unsafe extern "C" fn(object: *mut GObject)>,
    pub dispatch_properties_changed: ::std::option::Option<
        unsafe extern "C" fn(object: *mut GObject, n_pspecs: guint, pspecs: *mut *mut GParamSpec),
    >,
    pub notify:
        ::std::option::Option<unsafe extern "C" fn(object: *mut GObject, pspec: *mut GParamSpec)>,
    pub constructed: ::std::option::Option<unsafe extern "C" fn(object: *mut GObject)>,
    pub flags: gsize,
    pub n_construct_properties: gsize,
    pub pspecs: gpointer,
    pub n_pspecs: gsize,
    pub pdummy: [gpointer; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GObjectClass"][::std::mem::size_of::<_GObjectClass>() - 136usize];
    ["Alignment of _GObjectClass"][::std::mem::align_of::<_GObjectClass>() - 8usize];
    ["Offset of field: _GObjectClass::g_type_class"]
        [::std::mem::offset_of!(_GObjectClass, g_type_class) - 0usize];
    ["Offset of field: _GObjectClass::construct_properties"]
        [::std::mem::offset_of!(_GObjectClass, construct_properties) - 8usize];
    ["Offset of field: _GObjectClass::constructor"]
        [::std::mem::offset_of!(_GObjectClass, constructor) - 16usize];
    ["Offset of field: _GObjectClass::set_property"]
        [::std::mem::offset_of!(_GObjectClass, set_property) - 24usize];
    ["Offset of field: _GObjectClass::get_property"]
        [::std::mem::offset_of!(_GObjectClass, get_property) - 32usize];
    ["Offset of field: _GObjectClass::dispose"]
        [::std::mem::offset_of!(_GObjectClass, dispose) - 40usize];
    ["Offset of field: _GObjectClass::finalize"]
        [::std::mem::offset_of!(_GObjectClass, finalize) - 48usize];
    ["Offset of field: _GObjectClass::dispatch_properties_changed"]
        [::std::mem::offset_of!(_GObjectClass, dispatch_properties_changed) - 56usize];
    ["Offset of field: _GObjectClass::notify"]
        [::std::mem::offset_of!(_GObjectClass, notify) - 64usize];
    ["Offset of field: _GObjectClass::constructed"]
        [::std::mem::offset_of!(_GObjectClass, constructed) - 72usize];
    ["Offset of field: _GObjectClass::flags"]
        [::std::mem::offset_of!(_GObjectClass, flags) - 80usize];
    ["Offset of field: _GObjectClass::n_construct_properties"]
        [::std::mem::offset_of!(_GObjectClass, n_construct_properties) - 88usize];
    ["Offset of field: _GObjectClass::pspecs"]
        [::std::mem::offset_of!(_GObjectClass, pspecs) - 96usize];
    ["Offset of field: _GObjectClass::n_pspecs"]
        [::std::mem::offset_of!(_GObjectClass, n_pspecs) - 104usize];
    ["Offset of field: _GObjectClass::pdummy"]
        [::std::mem::offset_of!(_GObjectClass, pdummy) - 112usize];
};
impl Default for _GObjectClass {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GObjectConstructParam:\n @pspec: the #GParamSpec of the construct parameter\n @value: the value to set the parameter to\n\n The GObjectConstructParam struct is an auxiliary structure used to hand\n #GParamSpec/#GValue pairs to the @constructor of a #GObjectClass."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GObjectConstructParam {
    pub pspec: *mut GParamSpec,
    pub value: *mut GValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GObjectConstructParam"][::std::mem::size_of::<_GObjectConstructParam>() - 16usize];
    ["Alignment of _GObjectConstructParam"]
        [::std::mem::align_of::<_GObjectConstructParam>() - 8usize];
    ["Offset of field: _GObjectConstructParam::pspec"]
        [::std::mem::offset_of!(_GObjectConstructParam, pspec) - 0usize];
    ["Offset of field: _GObjectConstructParam::value"]
        [::std::mem::offset_of!(_GObjectConstructParam, value) - 8usize];
};
impl Default for _GObjectConstructParam {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GAsyncResult {
    _unused: [u8; 0],
}
pub type GAsyncResult = _GAsyncResult;
pub type GCancellable = _GCancellable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GDatagramBased {
    _unused: [u8; 0],
}
pub type GDatagramBased = _GDatagramBased;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GFile {
    _unused: [u8; 0],
}
#[doc = " GFile:\n\n A handle to an object implementing the #GFileIface interface.\n Generally stores a location within the file system. Handles do not\n necessarily represent files or directories that currently exist."]
pub type GFile = _GFile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GFileDescriptorBased {
    _unused: [u8; 0],
}
pub type GFileDescriptorBased = _GFileDescriptorBased;
pub type GInetAddress = _GInetAddress;
pub type GInetSocketAddress = _GInetSocketAddress;
pub type GInputStream = _GInputStream;
pub type GOutputStream = _GOutputStream;
#[doc = " GIOStream:\n\n Base class for read-write streams."]
pub type GIOStream = _GIOStream;
#[doc = " GSocket:\n\n A lowlevel network socket object.\n\n Since: 2.22"]
pub type GSocket = _GSocket;
#[doc = " GSocketControlMessage:\n\n Base class for socket-type specific control messages that can be sent and\n received over #GSocket."]
pub type GSocketControlMessage = _GSocketControlMessage;
#[doc = " GSocketConnection:\n\n A socket connection GIOStream object for connection-oriented sockets.\n\n Since: 2.22"]
pub type GSocketConnection = _GSocketConnection;
pub type GSocketAddress = _GSocketAddress;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketConnectable {
    _unused: [u8; 0],
}
pub type GSocketConnectable = _GSocketConnectable;
pub type GTlsCertificate = _GTlsCertificate;
#[doc = " GAsyncReadyCallback:\n @source_object: (nullable): the object the asynchronous operation was started with.\n @res: a #GAsyncResult.\n @user_data: user data passed to the callback.\n\n Type definition for a function that will be called back when an asynchronous\n operation within GIO has been completed. #GAsyncReadyCallback\n callbacks from #GTask are guaranteed to be invoked in a later\n iteration of the\n [thread-default main context][g-main-context-push-thread-default]\n where the #GTask was created. All other users of\n #GAsyncReadyCallback must likewise call it asynchronously in a\n later iteration of the main context.\n\n The asynchronous operation is guaranteed to have held a reference to\n @source_object from the time when the `*_async()` function was called, until\n after this callback returns."]
pub type GAsyncReadyCallback = ::std::option::Option<
    unsafe extern "C" fn(source_object: *mut GObject, res: *mut GAsyncResult, user_data: gpointer),
>;
#[doc = " GInputVector:\n @buffer: Pointer to a buffer where data will be written.\n @size: the available size in @buffer.\n\n Structure used for scatter/gather data input.\n You generally pass in an array of #GInputVectors\n and the operation will store the read data starting in the\n first buffer, switching to the next as needed.\n\n Since: 2.22"]
pub type GInputVector = _GInputVector;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInputVector {
    pub buffer: gpointer,
    pub size: gsize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GInputVector"][::std::mem::size_of::<_GInputVector>() - 16usize];
    ["Alignment of _GInputVector"][::std::mem::align_of::<_GInputVector>() - 8usize];
    ["Offset of field: _GInputVector::buffer"]
        [::std::mem::offset_of!(_GInputVector, buffer) - 0usize];
    ["Offset of field: _GInputVector::size"][::std::mem::offset_of!(_GInputVector, size) - 8usize];
};
impl Default for _GInputVector {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GInputMessage:\n @address: (optional) (out) (transfer full): return location\n   for a #GSocketAddress, or %NULL\n @vectors: (array length=num_vectors) (out): pointer to an\n   array of input vectors\n @num_vectors: the number of input vectors pointed to by @vectors\n @bytes_received: (out): will be set to the number of bytes that have been\n   received\n @flags: (out): collection of #GSocketMsgFlags for the received message,\n   outputted by the call\n @control_messages: (array length=num_control_messages) (optional)\n   (out) (transfer full): return location for a\n   caller-allocated array of #GSocketControlMessages, or %NULL\n @num_control_messages: (out) (optional): return location for the number of\n   elements in @control_messages\n\n Structure used for scatter/gather data input when receiving multiple\n messages or packets in one go. You generally pass in an array of empty\n #GInputVectors and the operation will use all the buffers as if they\n were one buffer, and will set @bytes_received to the total number of bytes\n received across all #GInputVectors.\n\n This structure closely mirrors `struct mmsghdr` and `struct msghdr` from\n the POSIX sockets API (see `man 2 recvmmsg`).\n\n If @address is non-%NULL then it is set to the source address the message\n was received from, and the caller must free it afterwards.\n\n If @control_messages is non-%NULL then it is set to an array of control\n messages received with the message (if any), and the caller must free it\n afterwards. @num_control_messages is set to the number of elements in\n this array, which may be zero.\n\n Flags relevant to this message will be returned in @flags. For example,\n `MSG_EOR` or `MSG_TRUNC`.\n\n Since: 2.48"]
pub type GInputMessage = _GInputMessage;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInputMessage {
    pub address: *mut *mut GSocketAddress,
    pub vectors: *mut GInputVector,
    pub num_vectors: guint,
    pub bytes_received: gsize,
    pub flags: gint,
    pub control_messages: *mut *mut *mut GSocketControlMessage,
    pub num_control_messages: *mut guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GInputMessage"][::std::mem::size_of::<_GInputMessage>() - 56usize];
    ["Alignment of _GInputMessage"][::std::mem::align_of::<_GInputMessage>() - 8usize];
    ["Offset of field: _GInputMessage::address"]
        [::std::mem::offset_of!(_GInputMessage, address) - 0usize];
    ["Offset of field: _GInputMessage::vectors"]
        [::std::mem::offset_of!(_GInputMessage, vectors) - 8usize];
    ["Offset of field: _GInputMessage::num_vectors"]
        [::std::mem::offset_of!(_GInputMessage, num_vectors) - 16usize];
    ["Offset of field: _GInputMessage::bytes_received"]
        [::std::mem::offset_of!(_GInputMessage, bytes_received) - 24usize];
    ["Offset of field: _GInputMessage::flags"]
        [::std::mem::offset_of!(_GInputMessage, flags) - 32usize];
    ["Offset of field: _GInputMessage::control_messages"]
        [::std::mem::offset_of!(_GInputMessage, control_messages) - 40usize];
    ["Offset of field: _GInputMessage::num_control_messages"]
        [::std::mem::offset_of!(_GInputMessage, num_control_messages) - 48usize];
};
impl Default for _GInputMessage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GOutputVector:\n @buffer: Pointer to a buffer of data to read.\n @size: the size of @buffer.\n\n Structure used for scatter/gather data output.\n You generally pass in an array of #GOutputVectors\n and the operation will use all the buffers as if they were\n one buffer.\n\n Since: 2.22"]
pub type GOutputVector = _GOutputVector;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GOutputVector {
    pub buffer: gconstpointer,
    pub size: gsize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GOutputVector"][::std::mem::size_of::<_GOutputVector>() - 16usize];
    ["Alignment of _GOutputVector"][::std::mem::align_of::<_GOutputVector>() - 8usize];
    ["Offset of field: _GOutputVector::buffer"]
        [::std::mem::offset_of!(_GOutputVector, buffer) - 0usize];
    ["Offset of field: _GOutputVector::size"]
        [::std::mem::offset_of!(_GOutputVector, size) - 8usize];
};
impl Default for _GOutputVector {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " GOutputMessage:\n @address: (nullable): a #GSocketAddress, or %NULL\n @vectors: pointer to an array of output vectors\n @num_vectors: the number of output vectors pointed to by @vectors.\n @bytes_sent: initialize to 0. Will be set to the number of bytes\n     that have been sent\n @control_messages: (array length=num_control_messages) (nullable): a pointer\n   to an array of #GSocketControlMessages, or %NULL.\n @num_control_messages: number of elements in @control_messages.\n\n Structure used for scatter/gather data output when sending multiple\n messages or packets in one go. You generally pass in an array of\n #GOutputVectors and the operation will use all the buffers as if they\n were one buffer.\n\n If @address is %NULL then the message is sent to the default receiver\n (as previously set by g_socket_connect()).\n\n Since: 2.44"]
pub type GOutputMessage = _GOutputMessage;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GOutputMessage {
    pub address: *mut GSocketAddress,
    pub vectors: *mut GOutputVector,
    pub num_vectors: guint,
    pub bytes_sent: guint,
    pub control_messages: *mut *mut GSocketControlMessage,
    pub num_control_messages: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GOutputMessage"][::std::mem::size_of::<_GOutputMessage>() - 40usize];
    ["Alignment of _GOutputMessage"][::std::mem::align_of::<_GOutputMessage>() - 8usize];
    ["Offset of field: _GOutputMessage::address"]
        [::std::mem::offset_of!(_GOutputMessage, address) - 0usize];
    ["Offset of field: _GOutputMessage::vectors"]
        [::std::mem::offset_of!(_GOutputMessage, vectors) - 8usize];
    ["Offset of field: _GOutputMessage::num_vectors"]
        [::std::mem::offset_of!(_GOutputMessage, num_vectors) - 16usize];
    ["Offset of field: _GOutputMessage::bytes_sent"]
        [::std::mem::offset_of!(_GOutputMessage, bytes_sent) - 20usize];
    ["Offset of field: _GOutputMessage::control_messages"]
        [::std::mem::offset_of!(_GOutputMessage, control_messages) - 24usize];
    ["Offset of field: _GOutputMessage::num_control_messages"]
        [::std::mem::offset_of!(_GOutputMessage, num_control_messages) - 32usize];
};
impl Default for _GOutputMessage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GDBusConnection {
    _unused: [u8; 0],
}
pub type GDBusConnection = _GDBusConnection;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInputStreamPrivate {
    _unused: [u8; 0],
}
pub type GInputStreamPrivate = _GInputStreamPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInputStream {
    pub parent_instance: GObject,
    pub priv_: *mut GInputStreamPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GInputStream"][::std::mem::size_of::<_GInputStream>() - 32usize];
    ["Alignment of _GInputStream"][::std::mem::align_of::<_GInputStream>() - 8usize];
    ["Offset of field: _GInputStream::parent_instance"]
        [::std::mem::offset_of!(_GInputStream, parent_instance) - 0usize];
    ["Offset of field: _GInputStream::priv_"]
        [::std::mem::offset_of!(_GInputStream, priv_) - 24usize];
};
impl Default for _GInputStream {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GOutputStreamPrivate {
    _unused: [u8; 0],
}
pub type GOutputStreamPrivate = _GOutputStreamPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GOutputStream {
    pub parent_instance: GObject,
    pub priv_: *mut GOutputStreamPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GOutputStream"][::std::mem::size_of::<_GOutputStream>() - 32usize];
    ["Alignment of _GOutputStream"][::std::mem::align_of::<_GOutputStream>() - 8usize];
    ["Offset of field: _GOutputStream::parent_instance"]
        [::std::mem::offset_of!(_GOutputStream, parent_instance) - 0usize];
    ["Offset of field: _GOutputStream::priv_"]
        [::std::mem::offset_of!(_GOutputStream, priv_) - 24usize];
};
impl Default for _GOutputStream {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GCancellablePrivate {
    _unused: [u8; 0],
}
pub type GCancellablePrivate = _GCancellablePrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GCancellable {
    pub parent_instance: GObject,
    pub priv_: *mut GCancellablePrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GCancellable"][::std::mem::size_of::<_GCancellable>() - 32usize];
    ["Alignment of _GCancellable"][::std::mem::align_of::<_GCancellable>() - 8usize];
    ["Offset of field: _GCancellable::parent_instance"]
        [::std::mem::offset_of!(_GCancellable, parent_instance) - 0usize];
    ["Offset of field: _GCancellable::priv_"]
        [::std::mem::offset_of!(_GCancellable, priv_) - 24usize];
};
impl Default for _GCancellable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GIOStreamPrivate {
    _unused: [u8; 0],
}
pub type GIOStreamPrivate = _GIOStreamPrivate;
pub type GIOStreamClass = _GIOStreamClass;
#[doc = " GIOStream:\n\n Base class for read-write streams."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GIOStream {
    pub parent_instance: GObject,
    pub priv_: *mut GIOStreamPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GIOStream"][::std::mem::size_of::<_GIOStream>() - 32usize];
    ["Alignment of _GIOStream"][::std::mem::align_of::<_GIOStream>() - 8usize];
    ["Offset of field: _GIOStream::parent_instance"]
        [::std::mem::offset_of!(_GIOStream, parent_instance) - 0usize];
    ["Offset of field: _GIOStream::priv_"][::std::mem::offset_of!(_GIOStream, priv_) - 24usize];
};
impl Default for _GIOStream {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GIOStreamClass {
    pub parent_class: GObjectClass,
    pub get_input_stream:
        ::std::option::Option<unsafe extern "C" fn(stream: *mut GIOStream) -> *mut GInputStream>,
    pub get_output_stream:
        ::std::option::Option<unsafe extern "C" fn(stream: *mut GIOStream) -> *mut GOutputStream>,
    pub close_fn: ::std::option::Option<
        unsafe extern "C" fn(
            stream: *mut GIOStream,
            cancellable: *mut GCancellable,
            error: *mut *mut GError,
        ) -> gboolean,
    >,
    pub close_async: ::std::option::Option<
        unsafe extern "C" fn(
            stream: *mut GIOStream,
            io_priority: ::std::os::raw::c_int,
            cancellable: *mut GCancellable,
            callback: GAsyncReadyCallback,
            user_data: gpointer,
        ),
    >,
    pub close_finish: ::std::option::Option<
        unsafe extern "C" fn(
            stream: *mut GIOStream,
            result: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> gboolean,
    >,
    pub _g_reserved1: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved2: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved3: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved4: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved5: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved6: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved7: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved8: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved9: ::std::option::Option<unsafe extern "C" fn()>,
    pub _g_reserved10: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GIOStreamClass"][::std::mem::size_of::<_GIOStreamClass>() - 256usize];
    ["Alignment of _GIOStreamClass"][::std::mem::align_of::<_GIOStreamClass>() - 8usize];
    ["Offset of field: _GIOStreamClass::parent_class"]
        [::std::mem::offset_of!(_GIOStreamClass, parent_class) - 0usize];
    ["Offset of field: _GIOStreamClass::get_input_stream"]
        [::std::mem::offset_of!(_GIOStreamClass, get_input_stream) - 136usize];
    ["Offset of field: _GIOStreamClass::get_output_stream"]
        [::std::mem::offset_of!(_GIOStreamClass, get_output_stream) - 144usize];
    ["Offset of field: _GIOStreamClass::close_fn"]
        [::std::mem::offset_of!(_GIOStreamClass, close_fn) - 152usize];
    ["Offset of field: _GIOStreamClass::close_async"]
        [::std::mem::offset_of!(_GIOStreamClass, close_async) - 160usize];
    ["Offset of field: _GIOStreamClass::close_finish"]
        [::std::mem::offset_of!(_GIOStreamClass, close_finish) - 168usize];
    ["Offset of field: _GIOStreamClass::_g_reserved1"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved1) - 176usize];
    ["Offset of field: _GIOStreamClass::_g_reserved2"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved2) - 184usize];
    ["Offset of field: _GIOStreamClass::_g_reserved3"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved3) - 192usize];
    ["Offset of field: _GIOStreamClass::_g_reserved4"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved4) - 200usize];
    ["Offset of field: _GIOStreamClass::_g_reserved5"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved5) - 208usize];
    ["Offset of field: _GIOStreamClass::_g_reserved6"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved6) - 216usize];
    ["Offset of field: _GIOStreamClass::_g_reserved7"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved7) - 224usize];
    ["Offset of field: _GIOStreamClass::_g_reserved8"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved8) - 232usize];
    ["Offset of field: _GIOStreamClass::_g_reserved9"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved9) - 240usize];
    ["Offset of field: _GIOStreamClass::_g_reserved10"]
        [::std::mem::offset_of!(_GIOStreamClass, _g_reserved10) - 248usize];
};
impl Default for _GIOStreamClass {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInetAddressPrivate {
    _unused: [u8; 0],
}
pub type GInetAddressPrivate = _GInetAddressPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInetAddress {
    pub parent_instance: GObject,
    pub priv_: *mut GInetAddressPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GInetAddress"][::std::mem::size_of::<_GInetAddress>() - 32usize];
    ["Alignment of _GInetAddress"][::std::mem::align_of::<_GInetAddress>() - 8usize];
    ["Offset of field: _GInetAddress::parent_instance"]
        [::std::mem::offset_of!(_GInetAddress, parent_instance) - 0usize];
    ["Offset of field: _GInetAddress::priv_"]
        [::std::mem::offset_of!(_GInetAddress, priv_) - 24usize];
};
impl Default for _GInetAddress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketAddress {
    pub parent_instance: GObject,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSocketAddress"][::std::mem::size_of::<_GSocketAddress>() - 24usize];
    ["Alignment of _GSocketAddress"][::std::mem::align_of::<_GSocketAddress>() - 8usize];
    ["Offset of field: _GSocketAddress::parent_instance"]
        [::std::mem::offset_of!(_GSocketAddress, parent_instance) - 0usize];
};
impl Default for _GSocketAddress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInetSocketAddressPrivate {
    _unused: [u8; 0],
}
pub type GInetSocketAddressPrivate = _GInetSocketAddressPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GInetSocketAddress {
    pub parent_instance: GSocketAddress,
    pub priv_: *mut GInetSocketAddressPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GInetSocketAddress"][::std::mem::size_of::<_GInetSocketAddress>() - 32usize];
    ["Alignment of _GInetSocketAddress"][::std::mem::align_of::<_GInetSocketAddress>() - 8usize];
    ["Offset of field: _GInetSocketAddress::parent_instance"]
        [::std::mem::offset_of!(_GInetSocketAddress, parent_instance) - 0usize];
    ["Offset of field: _GInetSocketAddress::priv_"]
        [::std::mem::offset_of!(_GInetSocketAddress, priv_) - 24usize];
};
impl Default for _GInetSocketAddress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketPrivate {
    _unused: [u8; 0],
}
pub type GSocketPrivate = _GSocketPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocket {
    pub parent_instance: GObject,
    pub priv_: *mut GSocketPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSocket"][::std::mem::size_of::<_GSocket>() - 32usize];
    ["Alignment of _GSocket"][::std::mem::align_of::<_GSocket>() - 8usize];
    ["Offset of field: _GSocket::parent_instance"]
        [::std::mem::offset_of!(_GSocket, parent_instance) - 0usize];
    ["Offset of field: _GSocket::priv_"][::std::mem::offset_of!(_GSocket, priv_) - 24usize];
};
impl Default for _GSocket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketConnectionPrivate {
    _unused: [u8; 0],
}
pub type GSocketConnectionPrivate = _GSocketConnectionPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketConnection {
    pub parent_instance: GIOStream,
    pub priv_: *mut GSocketConnectionPrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSocketConnection"][::std::mem::size_of::<_GSocketConnection>() - 40usize];
    ["Alignment of _GSocketConnection"][::std::mem::align_of::<_GSocketConnection>() - 8usize];
    ["Offset of field: _GSocketConnection::parent_instance"]
        [::std::mem::offset_of!(_GSocketConnection, parent_instance) - 0usize];
    ["Offset of field: _GSocketConnection::priv_"]
        [::std::mem::offset_of!(_GSocketConnection, priv_) - 32usize];
};
impl Default for _GSocketConnection {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketControlMessagePrivate {
    _unused: [u8; 0],
}
pub type GSocketControlMessagePrivate = _GSocketControlMessagePrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GSocketControlMessage {
    pub parent_instance: GObject,
    pub priv_: *mut GSocketControlMessagePrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GSocketControlMessage"][::std::mem::size_of::<_GSocketControlMessage>() - 32usize];
    ["Alignment of _GSocketControlMessage"]
        [::std::mem::align_of::<_GSocketControlMessage>() - 8usize];
    ["Offset of field: _GSocketControlMessage::parent_instance"]
        [::std::mem::offset_of!(_GSocketControlMessage, parent_instance) - 0usize];
    ["Offset of field: _GSocketControlMessage::priv_"]
        [::std::mem::offset_of!(_GSocketControlMessage, priv_) - 24usize];
};
impl Default for _GSocketControlMessage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GTlsCertificatePrivate {
    _unused: [u8; 0],
}
pub type GTlsCertificatePrivate = _GTlsCertificatePrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GTlsCertificate {
    pub parent_instance: GObject,
    pub priv_: *mut GTlsCertificatePrivate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GTlsCertificate"][::std::mem::size_of::<_GTlsCertificate>() - 32usize];
    ["Alignment of _GTlsCertificate"][::std::mem::align_of::<_GTlsCertificate>() - 8usize];
    ["Offset of field: _GTlsCertificate::parent_instance"]
        [::std::mem::offset_of!(_GTlsCertificate, parent_instance) - 0usize];
    ["Offset of field: _GTlsCertificate::priv_"]
        [::std::mem::offset_of!(_GTlsCertificate, priv_) - 24usize];
};
impl Default for _GTlsCertificate {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _JsonNode {
    _unused: [u8; 0],
}
pub type JsonNode = _JsonNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _JsonArray {
    _unused: [u8; 0],
}
pub type JsonArray = _JsonArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NiceAgent {
    _unused: [u8; 0],
}
#[doc = " NiceAgent:\n\n The #NiceAgent is the main GObject of the libnice library and represents\n the ICE agent."]
pub type NiceAgent = _NiceAgent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
impl Default for iovec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostSession {
    _unused: [u8; 0],
}
pub type FridaHostSession = _FridaHostSession;
pub type FridaHostSessionIface = _FridaHostSessionIface;
pub type FridaHostApplicationInfo = _FridaHostApplicationInfo;
pub type FridaHostProcessInfo = _FridaHostProcessInfo;
pub type FridaHostSpawnInfo = _FridaHostSpawnInfo;
pub type FridaHostChildInfo = _FridaHostChildInfo;
pub const FridaChildOrigin_FRIDA_CHILD_ORIGIN_FORK: FridaChildOrigin = 0;
pub const FridaChildOrigin_FRIDA_CHILD_ORIGIN_EXEC: FridaChildOrigin = 1;
pub const FridaChildOrigin_FRIDA_CHILD_ORIGIN_SPAWN: FridaChildOrigin = 2;
pub type FridaChildOrigin = ::std::os::raw::c_uint;
pub type FridaHostSpawnOptions = _FridaHostSpawnOptions;
pub const FridaStdio_FRIDA_STDIO_INHERIT: FridaStdio = 0;
pub const FridaStdio_FRIDA_STDIO_PIPE: FridaStdio = 1;
pub type FridaStdio = ::std::os::raw::c_uint;
pub type FridaAgentSessionId = _FridaAgentSessionId;
pub type FridaInjectorPayloadId = _FridaInjectorPayloadId;
pub type FridaChannelId = _FridaChannelId;
pub type FridaServiceSessionId = _FridaServiceSessionId;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentSessionProvider {
    _unused: [u8; 0],
}
pub type FridaAgentSessionProvider = _FridaAgentSessionProvider;
pub type FridaAgentSessionProviderIface = _FridaAgentSessionProviderIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentSession {
    _unused: [u8; 0],
}
pub type FridaAgentSession = _FridaAgentSession;
pub type FridaAgentSessionIface = _FridaAgentSessionIface;
pub type FridaAgentScriptId = _FridaAgentScriptId;
pub type FridaAgentMessage = _FridaAgentMessage;
pub const FridaAgentMessageKind_FRIDA_AGENT_MESSAGE_KIND_SCRIPT: FridaAgentMessageKind = 1;
pub const FridaAgentMessageKind_FRIDA_AGENT_MESSAGE_KIND_DEBUGGER: FridaAgentMessageKind = 2;
pub type FridaAgentMessageKind = ::std::os::raw::c_uint;
pub type FridaPortalMembershipId = _FridaPortalMembershipId;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentController {
    _unused: [u8; 0],
}
pub type FridaAgentController = _FridaAgentController;
pub type FridaAgentControllerIface = _FridaAgentControllerIface;
pub type FridaHostChildId = _FridaHostChildId;
pub const FridaSpawnStartState_FRIDA_SPAWN_START_STATE_RUNNING: FridaSpawnStartState = 0;
pub const FridaSpawnStartState_FRIDA_SPAWN_START_STATE_SUSPENDED: FridaSpawnStartState = 1;
pub type FridaSpawnStartState = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentMessageSink {
    _unused: [u8; 0],
}
pub type FridaAgentMessageSink = _FridaAgentMessageSink;
pub type FridaAgentMessageSinkIface = _FridaAgentMessageSinkIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentMessageTransmitter {
    _unused: [u8; 0],
}
pub type FridaAgentMessageTransmitter = _FridaAgentMessageTransmitter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentMessageTransmitterClass {
    _unused: [u8; 0],
}
pub type FridaAgentMessageTransmitterClass = _FridaAgentMessageTransmitterClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaGadgetSession {
    _unused: [u8; 0],
}
pub type FridaGadgetSession = _FridaGadgetSession;
pub type FridaGadgetSessionIface = _FridaGadgetSessionIface;
pub const FridaGadgetBreakpointAction_FRIDA_GADGET_BREAKPOINT_ACTION_INVOKE_RETURN:
    FridaGadgetBreakpointAction = 0;
pub const FridaGadgetBreakpointAction_FRIDA_GADGET_BREAKPOINT_ACTION_RESUME:
    FridaGadgetBreakpointAction = 1;
pub const FridaGadgetBreakpointAction_FRIDA_GADGET_BREAKPOINT_ACTION_DETACH:
    FridaGadgetBreakpointAction = 2;
pub const FridaGadgetBreakpointAction_FRIDA_GADGET_BREAKPOINT_ACTION_PAGE_PLAN:
    FridaGadgetBreakpointAction = 3;
pub type FridaGadgetBreakpointAction = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannel {
    _unused: [u8; 0],
}
pub type FridaChannel = _FridaChannel;
pub type FridaChannelIface = _FridaChannelIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaServiceSession {
    _unused: [u8; 0],
}
pub type FridaServiceSession = _FridaServiceSession;
pub type FridaServiceSessionIface = _FridaServiceSessionIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaTransportBroker {
    _unused: [u8; 0],
}
pub type FridaTransportBroker = _FridaTransportBroker;
pub type FridaTransportBrokerIface = _FridaTransportBrokerIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPortalSession {
    _unused: [u8; 0],
}
pub type FridaPortalSession = _FridaPortalSession;
pub type FridaPortalSessionIface = _FridaPortalSessionIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBusSession {
    _unused: [u8; 0],
}
pub type FridaBusSession = _FridaBusSession;
pub type FridaBusSessionIface = _FridaBusSessionIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAuthenticationService {
    _unused: [u8; 0],
}
pub type FridaAuthenticationService = _FridaAuthenticationService;
pub type FridaAuthenticationServiceIface = _FridaAuthenticationServiceIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaStaticAuthenticationService {
    _unused: [u8; 0],
}
pub type FridaStaticAuthenticationService = _FridaStaticAuthenticationService;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaStaticAuthenticationServiceClass {
    _unused: [u8; 0],
}
pub type FridaStaticAuthenticationServiceClass = _FridaStaticAuthenticationServiceClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaNullAuthenticationService {
    _unused: [u8; 0],
}
pub type FridaNullAuthenticationService = _FridaNullAuthenticationService;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaNullAuthenticationServiceClass {
    _unused: [u8; 0],
}
pub type FridaNullAuthenticationServiceClass = _FridaNullAuthenticationServiceClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedHostSession {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedHostSession = _FridaUnauthorizedHostSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedHostSessionClass {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedHostSessionClass = _FridaUnauthorizedHostSessionClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedPortalSession {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedPortalSession = _FridaUnauthorizedPortalSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedPortalSessionClass {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedPortalSessionClass = _FridaUnauthorizedPortalSessionClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedBusSession {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedBusSession = _FridaUnauthorizedBusSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaUnauthorizedBusSessionClass {
    _unused: [u8; 0],
}
pub type FridaUnauthorizedBusSessionClass = _FridaUnauthorizedBusSessionClass;
pub const FridaRealm_FRIDA_REALM_NATIVE: FridaRealm = 0;
pub const FridaRealm_FRIDA_REALM_EMULATED: FridaRealm = 1;
pub type FridaRealm = ::std::os::raw::c_uint;
pub const FridaUnloadPolicy_FRIDA_UNLOAD_POLICY_IMMEDIATE: FridaUnloadPolicy = 0;
pub const FridaUnloadPolicy_FRIDA_UNLOAD_POLICY_RESIDENT: FridaUnloadPolicy = 1;
pub const FridaUnloadPolicy_FRIDA_UNLOAD_POLICY_DEFERRED: FridaUnloadPolicy = 2;
pub type FridaUnloadPolicy = ::std::os::raw::c_uint;
pub type FridaMappedLibraryBlob = _FridaMappedLibraryBlob;
pub type FridaLinuxInjectorState = _FridaLinuxInjectorState;
pub type FridaPosixInjectorState = _FridaPosixInjectorState;
pub const FridaSessionDetachReason_FRIDA_SESSION_DETACH_REASON_APPLICATION_REQUESTED:
    FridaSessionDetachReason = 1;
pub const FridaSessionDetachReason_FRIDA_SESSION_DETACH_REASON_PROCESS_REPLACED:
    FridaSessionDetachReason = 2;
pub const FridaSessionDetachReason_FRIDA_SESSION_DETACH_REASON_PROCESS_TERMINATED:
    FridaSessionDetachReason = 3;
pub const FridaSessionDetachReason_FRIDA_SESSION_DETACH_REASON_CONNECTION_TERMINATED:
    FridaSessionDetachReason = 4;
pub const FridaSessionDetachReason_FRIDA_SESSION_DETACH_REASON_DEVICE_LOST:
    FridaSessionDetachReason = 5;
pub type FridaSessionDetachReason = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFrontmostQueryOptions {
    _unused: [u8; 0],
}
pub type FridaFrontmostQueryOptions = _FridaFrontmostQueryOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFrontmostQueryOptionsClass {
    _unused: [u8; 0],
}
pub type FridaFrontmostQueryOptionsClass = _FridaFrontmostQueryOptionsClass;
pub const FridaScope_FRIDA_SCOPE_MINIMAL: FridaScope = 0;
pub const FridaScope_FRIDA_SCOPE_METADATA: FridaScope = 1;
pub const FridaScope_FRIDA_SCOPE_FULL: FridaScope = 2;
pub type FridaScope = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaApplicationQueryOptions {
    _unused: [u8; 0],
}
pub type FridaApplicationQueryOptions = _FridaApplicationQueryOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaApplicationQueryOptionsClass {
    _unused: [u8; 0],
}
pub type FridaApplicationQueryOptionsClass = _FridaApplicationQueryOptionsClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaProcessQueryOptions {
    _unused: [u8; 0],
}
pub type FridaProcessQueryOptions = _FridaProcessQueryOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaProcessQueryOptionsClass {
    _unused: [u8; 0],
}
pub type FridaProcessQueryOptionsClass = _FridaProcessQueryOptionsClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSessionOptions {
    _unused: [u8; 0],
}
pub type FridaSessionOptions = _FridaSessionOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSessionOptionsClass {
    _unused: [u8; 0],
}
pub type FridaSessionOptionsClass = _FridaSessionOptionsClass;
pub type FridaCrashInfo = _FridaCrashInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaScriptOptions {
    _unused: [u8; 0],
}
pub type FridaScriptOptions = _FridaScriptOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaScriptOptionsClass {
    _unused: [u8; 0],
}
pub type FridaScriptOptionsClass = _FridaScriptOptionsClass;
pub const FridaSnapshotTransport_FRIDA_SNAPSHOT_TRANSPORT_INLINE: FridaSnapshotTransport = 0;
pub const FridaSnapshotTransport_FRIDA_SNAPSHOT_TRANSPORT_SHARED_MEMORY: FridaSnapshotTransport = 1;
pub type FridaSnapshotTransport = ::std::os::raw::c_uint;
pub const FridaScriptRuntime_FRIDA_SCRIPT_RUNTIME_DEFAULT: FridaScriptRuntime = 0;
pub const FridaScriptRuntime_FRIDA_SCRIPT_RUNTIME_QJS: FridaScriptRuntime = 1;
pub const FridaScriptRuntime_FRIDA_SCRIPT_RUNTIME_V8: FridaScriptRuntime = 2;
pub type FridaScriptRuntime = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSnapshotOptions {
    _unused: [u8; 0],
}
pub type FridaSnapshotOptions = _FridaSnapshotOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSnapshotOptionsClass {
    _unused: [u8; 0],
}
pub type FridaSnapshotOptionsClass = _FridaSnapshotOptionsClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPortalOptions {
    _unused: [u8; 0],
}
pub type FridaPortalOptions = _FridaPortalOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPortalOptionsClass {
    _unused: [u8; 0],
}
pub type FridaPortalOptionsClass = _FridaPortalOptionsClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerOptions {
    _unused: [u8; 0],
}
pub type FridaPeerOptions = _FridaPeerOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerOptionsClass {
    _unused: [u8; 0],
}
pub type FridaPeerOptionsClass = _FridaPeerOptionsClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaRelay {
    _unused: [u8; 0],
}
pub type FridaRelay = _FridaRelay;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaRelayClass {
    _unused: [u8; 0],
}
pub type FridaRelayClass = _FridaRelayClass;
pub const FridaRelayKind_FRIDA_RELAY_KIND_TURN_UDP: FridaRelayKind = 0;
pub const FridaRelayKind_FRIDA_RELAY_KIND_TURN_TCP: FridaRelayKind = 1;
pub const FridaRelayKind_FRIDA_RELAY_KIND_TURN_TLS: FridaRelayKind = 2;
pub type FridaRelayKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelRegistry {
    _unused: [u8; 0],
}
pub type FridaChannelRegistry = _FridaChannelRegistry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelRegistryClass {
    _unused: [u8; 0],
}
pub type FridaChannelRegistryClass = _FridaChannelRegistryClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelEndpoint {
    _unused: [u8; 0],
}
pub type FridaChannelEndpoint = _FridaChannelEndpoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelEndpointClass {
    _unused: [u8; 0],
}
pub type FridaChannelEndpointClass = _FridaChannelEndpointClass;
pub type FridaVirtualStream = _FridaVirtualStream;
pub type FridaVirtualStreamClass = _FridaVirtualStreamClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelStream {
    _unused: [u8; 0],
}
pub type FridaChannelStream = _FridaChannelStream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelStreamClass {
    _unused: [u8; 0],
}
pub type FridaChannelStreamClass = _FridaChannelStreamClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaServiceSessionRegistry {
    _unused: [u8; 0],
}
pub type FridaServiceSessionRegistry = _FridaServiceSessionRegistry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaServiceSessionRegistryClass {
    _unused: [u8; 0],
}
pub type FridaServiceSessionRegistryClass = _FridaServiceSessionRegistryClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualStreamPrivate {
    _unused: [u8; 0],
}
pub type FridaVirtualStreamPrivate = _FridaVirtualStreamPrivate;
pub const FridaVirtualStreamState_FRIDA_VIRTUAL_STREAM_STATE_CREATED: FridaVirtualStreamState = 0;
pub const FridaVirtualStreamState_FRIDA_VIRTUAL_STREAM_STATE_OPENING: FridaVirtualStreamState = 1;
pub const FridaVirtualStreamState_FRIDA_VIRTUAL_STREAM_STATE_OPEN: FridaVirtualStreamState = 2;
pub const FridaVirtualStreamState_FRIDA_VIRTUAL_STREAM_STATE_CLOSED: FridaVirtualStreamState = 3;
pub type FridaVirtualStreamState = ::std::os::raw::c_uint;
pub type FridaVirtualStreamWorkFunc =
    ::std::option::Option<unsafe extern "C" fn(user_data: gpointer)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualInputStream {
    _unused: [u8; 0],
}
pub type FridaVirtualInputStream = _FridaVirtualInputStream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualInputStreamClass {
    _unused: [u8; 0],
}
pub type FridaVirtualInputStreamClass = _FridaVirtualInputStreamClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualOutputStream {
    _unused: [u8; 0],
}
pub type FridaVirtualOutputStream = _FridaVirtualOutputStream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualOutputStreamClass {
    _unused: [u8; 0],
}
pub type FridaVirtualOutputStreamClass = _FridaVirtualOutputStreamClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaRpcClient {
    _unused: [u8; 0],
}
pub type FridaRpcClient = _FridaRpcClient;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaRpcClientClass {
    _unused: [u8; 0],
}
pub type FridaRpcClientClass = _FridaRpcClientClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaRpcPeer {
    _unused: [u8; 0],
}
pub type FridaRpcPeer = _FridaRpcPeer;
pub type FridaRpcPeerIface = _FridaRpcPeerIface;
pub type FridaPeerSessionDescription = _FridaPeerSessionDescription;
pub type FridaPeerSessionDescriptionClass = _FridaPeerSessionDescriptionClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerSessionDescriptionPrivate {
    _unused: [u8; 0],
}
pub type FridaPeerSessionDescriptionPrivate = _FridaPeerSessionDescriptionPrivate;
pub const FridaPeerSetup_FRIDA_PEER_SETUP_ACTIVE: FridaPeerSetup = 0;
pub const FridaPeerSetup_FRIDA_PEER_SETUP_PASSIVE: FridaPeerSetup = 1;
pub const FridaPeerSetup_FRIDA_PEER_SETUP_ACTPASS: FridaPeerSetup = 2;
pub const FridaPeerSetup_FRIDA_PEER_SETUP_HOLDCONN: FridaPeerSetup = 3;
pub type FridaPeerSetup = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerSocket {
    _unused: [u8; 0],
}
pub type FridaPeerSocket = _FridaPeerSocket;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerSocketClass {
    _unused: [u8; 0],
}
pub type FridaPeerSocketClass = _FridaPeerSocketClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSctpConnection {
    _unused: [u8; 0],
}
pub type FridaSctpConnection = _FridaSctpConnection;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaSctpConnectionClass {
    _unused: [u8; 0],
}
pub type FridaSctpConnectionClass = _FridaSctpConnectionClass;
pub const FridaSctpShutdownType_FRIDA_SCTP_SHUTDOWN_TYPE_READ: FridaSctpShutdownType = 1;
pub const FridaSctpShutdownType_FRIDA_SCTP_SHUTDOWN_TYPE_WRITE: FridaSctpShutdownType = 2;
pub const FridaSctpShutdownType_FRIDA_SCTP_SHUTDOWN_TYPE_READ_WRITE: FridaSctpShutdownType = 3;
pub type FridaSctpShutdownType = ::std::os::raw::c_uint;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_NONE: FridaPayloadProtocolId = 0;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_DCEP: FridaPayloadProtocolId = 50;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_STRING: FridaPayloadProtocolId =
    51;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_BINARY_PARTIAL:
    FridaPayloadProtocolId = 52;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_BINARY: FridaPayloadProtocolId =
    53;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_STRING_PARTIAL:
    FridaPayloadProtocolId = 54;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_STRING_EMPTY:
    FridaPayloadProtocolId = 55;
pub const FridaPayloadProtocolId_FRIDA_PAYLOAD_PROTOCOL_ID_WEBRTC_BINARY_EMPTY:
    FridaPayloadProtocolId = 56;
pub type FridaPayloadProtocolId = ::std::os::raw::c_uint;
pub const FridaSctpMessageFlags_FRIDA_SCTP_MESSAGE_FLAGS_END_OF_RECORD: FridaSctpMessageFlags = 1;
pub const FridaSctpMessageFlags_FRIDA_SCTP_MESSAGE_FLAGS_NOTIFICATION: FridaSctpMessageFlags = 2;
pub type FridaSctpMessageFlags = ::std::os::raw::c_uint;
pub const FridaDcepMessageType_FRIDA_DCEP_MESSAGE_TYPE_DATA_CHANNEL_OPEN: FridaDcepMessageType = 3;
pub const FridaDcepMessageType_FRIDA_DCEP_MESSAGE_TYPE_DATA_CHANNEL_ACK: FridaDcepMessageType = 2;
pub type FridaDcepMessageType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaDummyInputStream {
    _unused: [u8; 0],
}
pub type FridaDummyInputStream = _FridaDummyInputStream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaDummyInputStreamClass {
    _unused: [u8; 0],
}
pub type FridaDummyInputStreamClass = _FridaDummyInputStreamClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPromise {
    _unused: [u8; 0],
}
pub type FridaPromise = _FridaPromise;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPromiseClass {
    _unused: [u8; 0],
}
pub type FridaPromiseClass = _FridaPromiseClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFuture {
    _unused: [u8; 0],
}
pub type FridaFuture = _FridaFuture;
pub type FridaFutureIface = _FridaFutureIface;
pub type FridaFutureCompletionHandler =
    ::std::option::Option<unsafe extern "C" fn(future: *mut FridaFuture, user_data: gpointer)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaEndpointParameters {
    _unused: [u8; 0],
}
pub type FridaEndpointParameters = _FridaEndpointParameters;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaEndpointParametersClass {
    _unused: [u8; 0],
}
pub type FridaEndpointParametersClass = _FridaEndpointParametersClass;
pub const FridaWebServiceTransport_FRIDA_WEB_SERVICE_TRANSPORT_PLAIN: FridaWebServiceTransport = 0;
pub const FridaWebServiceTransport_FRIDA_WEB_SERVICE_TRANSPORT_TLS: FridaWebServiceTransport = 1;
pub type FridaWebServiceTransport = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaWebService {
    _unused: [u8; 0],
}
pub type FridaWebService = _FridaWebService;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaWebServiceClass {
    _unused: [u8; 0],
}
pub type FridaWebServiceClass = _FridaWebServiceClass;
pub const FridaWebServiceFlavor_FRIDA_WEB_SERVICE_FLAVOR_CONTROL: FridaWebServiceFlavor = 0;
pub const FridaWebServiceFlavor_FRIDA_WEB_SERVICE_FLAVOR_CLUSTER: FridaWebServiceFlavor = 1;
pub type FridaWebServiceFlavor = ::std::os::raw::c_uint;
pub const FridaPortConflictBehavior_FRIDA_PORT_CONFLICT_BEHAVIOR_FAIL: FridaPortConflictBehavior =
    0;
pub const FridaPortConflictBehavior_FRIDA_PORT_CONFLICT_BEHAVIOR_PICK_NEXT:
    FridaPortConflictBehavior = 1;
pub type FridaPortConflictBehavior = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaDynamicInterfaceObserver {
    _unused: [u8; 0],
}
pub type FridaDynamicInterfaceObserver = _FridaDynamicInterfaceObserver;
pub type FridaDynamicInterfaceObserverIface = _FridaDynamicInterfaceObserverIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaDynamicInterface {
    _unused: [u8; 0],
}
pub type FridaDynamicInterface = _FridaDynamicInterface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaDynamicInterfaceClass {
    _unused: [u8; 0],
}
pub type FridaDynamicInterfaceClass = _FridaDynamicInterfaceClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaWebConnection {
    _unused: [u8; 0],
}
pub type FridaWebConnection = _FridaWebConnection;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaWebConnectionClass {
    _unused: [u8; 0],
}
pub type FridaWebConnectionClass = _FridaWebConnectionClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBufferBuilder {
    _unused: [u8; 0],
}
pub type FridaBufferBuilder = _FridaBufferBuilder;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBufferBuilderClass {
    _unused: [u8; 0],
}
pub type FridaBufferBuilderClass = _FridaBufferBuilderClass;
pub const FridaStringTerminator_FRIDA_STRING_TERMINATOR_NONE: FridaStringTerminator = 0;
pub const FridaStringTerminator_FRIDA_STRING_TERMINATOR_NUL: FridaStringTerminator = 1;
pub type FridaStringTerminator = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBuffer {
    _unused: [u8; 0],
}
pub type FridaBuffer = _FridaBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBufferClass {
    _unused: [u8; 0],
}
pub type FridaBufferClass = _FridaBufferClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBufferReader {
    _unused: [u8; 0],
}
pub type FridaBufferReader = _FridaBufferReader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaBufferReaderClass {
    _unused: [u8; 0],
}
pub type FridaBufferReaderClass = _FridaBufferReaderClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaObjectBuilder {
    _unused: [u8; 0],
}
pub type FridaObjectBuilder = _FridaObjectBuilder;
pub type FridaObjectBuilderIface = _FridaObjectBuilderIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaObjectReader {
    _unused: [u8; 0],
}
pub type FridaObjectReader = _FridaObjectReader;
pub type FridaObjectReaderIface = _FridaObjectReaderIface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVariantReader {
    _unused: [u8; 0],
}
pub type FridaVariantReader = _FridaVariantReader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVariantReaderClass {
    _unused: [u8; 0],
}
pub type FridaVariantReaderClass = _FridaVariantReaderClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaJsonObjectBuilder {
    _unused: [u8; 0],
}
pub type FridaJsonObjectBuilder = _FridaJsonObjectBuilder;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaJsonObjectBuilderClass {
    _unused: [u8; 0],
}
pub type FridaJsonObjectBuilderClass = _FridaJsonObjectBuilderClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaJsonObjectReader {
    _unused: [u8; 0],
}
pub type FridaJsonObjectReader = _FridaJsonObjectReader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaJsonObjectReaderClass {
    _unused: [u8; 0],
}
pub type FridaJsonObjectReaderClass = _FridaJsonObjectReaderClass;
pub type FridaFileDescriptor = _FridaFileDescriptor;
pub type FridaFileDescriptorClass = _FridaFileDescriptorClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFileDescriptorPrivate {
    _unused: [u8; 0],
}
pub type FridaFileDescriptorPrivate = _FridaFileDescriptorPrivate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPidFileDescriptor {
    _unused: [u8; 0],
}
pub type FridaPidFileDescriptor = _FridaPidFileDescriptor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPidFileDescriptorClass {
    _unused: [u8; 0],
}
pub type FridaPidFileDescriptorClass = _FridaPidFileDescriptorClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostApplicationInfo {
    pub identifier: *mut gchar,
    pub name: *mut gchar,
    pub pid: guint,
    pub parameters: *mut GHashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostApplicationInfo"]
        [::std::mem::size_of::<_FridaHostApplicationInfo>() - 32usize];
    ["Alignment of _FridaHostApplicationInfo"]
        [::std::mem::align_of::<_FridaHostApplicationInfo>() - 8usize];
    ["Offset of field: _FridaHostApplicationInfo::identifier"]
        [::std::mem::offset_of!(_FridaHostApplicationInfo, identifier) - 0usize];
    ["Offset of field: _FridaHostApplicationInfo::name"]
        [::std::mem::offset_of!(_FridaHostApplicationInfo, name) - 8usize];
    ["Offset of field: _FridaHostApplicationInfo::pid"]
        [::std::mem::offset_of!(_FridaHostApplicationInfo, pid) - 16usize];
    ["Offset of field: _FridaHostApplicationInfo::parameters"]
        [::std::mem::offset_of!(_FridaHostApplicationInfo, parameters) - 24usize];
};
impl Default for _FridaHostApplicationInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostProcessInfo {
    pub pid: guint,
    pub name: *mut gchar,
    pub parameters: *mut GHashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostProcessInfo"][::std::mem::size_of::<_FridaHostProcessInfo>() - 24usize];
    ["Alignment of _FridaHostProcessInfo"]
        [::std::mem::align_of::<_FridaHostProcessInfo>() - 8usize];
    ["Offset of field: _FridaHostProcessInfo::pid"]
        [::std::mem::offset_of!(_FridaHostProcessInfo, pid) - 0usize];
    ["Offset of field: _FridaHostProcessInfo::name"]
        [::std::mem::offset_of!(_FridaHostProcessInfo, name) - 8usize];
    ["Offset of field: _FridaHostProcessInfo::parameters"]
        [::std::mem::offset_of!(_FridaHostProcessInfo, parameters) - 16usize];
};
impl Default for _FridaHostProcessInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostSpawnInfo {
    pub pid: guint,
    pub identifier: *mut gchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostSpawnInfo"][::std::mem::size_of::<_FridaHostSpawnInfo>() - 16usize];
    ["Alignment of _FridaHostSpawnInfo"][::std::mem::align_of::<_FridaHostSpawnInfo>() - 8usize];
    ["Offset of field: _FridaHostSpawnInfo::pid"]
        [::std::mem::offset_of!(_FridaHostSpawnInfo, pid) - 0usize];
    ["Offset of field: _FridaHostSpawnInfo::identifier"]
        [::std::mem::offset_of!(_FridaHostSpawnInfo, identifier) - 8usize];
};
impl Default for _FridaHostSpawnInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostChildInfo {
    pub pid: guint,
    pub parent_pid: guint,
    pub origin: FridaChildOrigin,
    pub identifier: *mut gchar,
    pub path: *mut gchar,
    pub has_argv: gboolean,
    pub argv: *mut *mut gchar,
    pub argv_length1: gint,
    pub has_envp: gboolean,
    pub envp: *mut *mut gchar,
    pub envp_length1: gint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostChildInfo"][::std::mem::size_of::<_FridaHostChildInfo>() - 72usize];
    ["Alignment of _FridaHostChildInfo"][::std::mem::align_of::<_FridaHostChildInfo>() - 8usize];
    ["Offset of field: _FridaHostChildInfo::pid"]
        [::std::mem::offset_of!(_FridaHostChildInfo, pid) - 0usize];
    ["Offset of field: _FridaHostChildInfo::parent_pid"]
        [::std::mem::offset_of!(_FridaHostChildInfo, parent_pid) - 4usize];
    ["Offset of field: _FridaHostChildInfo::origin"]
        [::std::mem::offset_of!(_FridaHostChildInfo, origin) - 8usize];
    ["Offset of field: _FridaHostChildInfo::identifier"]
        [::std::mem::offset_of!(_FridaHostChildInfo, identifier) - 16usize];
    ["Offset of field: _FridaHostChildInfo::path"]
        [::std::mem::offset_of!(_FridaHostChildInfo, path) - 24usize];
    ["Offset of field: _FridaHostChildInfo::has_argv"]
        [::std::mem::offset_of!(_FridaHostChildInfo, has_argv) - 32usize];
    ["Offset of field: _FridaHostChildInfo::argv"]
        [::std::mem::offset_of!(_FridaHostChildInfo, argv) - 40usize];
    ["Offset of field: _FridaHostChildInfo::argv_length1"]
        [::std::mem::offset_of!(_FridaHostChildInfo, argv_length1) - 48usize];
    ["Offset of field: _FridaHostChildInfo::has_envp"]
        [::std::mem::offset_of!(_FridaHostChildInfo, has_envp) - 52usize];
    ["Offset of field: _FridaHostChildInfo::envp"]
        [::std::mem::offset_of!(_FridaHostChildInfo, envp) - 56usize];
    ["Offset of field: _FridaHostChildInfo::envp_length1"]
        [::std::mem::offset_of!(_FridaHostChildInfo, envp_length1) - 64usize];
};
impl Default for _FridaHostChildInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaHostSpawnOptions {
    pub has_argv: gboolean,
    pub argv: *mut *mut gchar,
    pub argv_length1: gint,
    pub has_envp: gboolean,
    pub envp: *mut *mut gchar,
    pub envp_length1: gint,
    pub has_env: gboolean,
    pub env: *mut *mut gchar,
    pub env_length1: gint,
    pub cwd: *mut gchar,
    pub stdio: FridaStdio,
    pub aux: *mut GHashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostSpawnOptions"][::std::mem::size_of::<_FridaHostSpawnOptions>() - 80usize];
    ["Alignment of _FridaHostSpawnOptions"]
        [::std::mem::align_of::<_FridaHostSpawnOptions>() - 8usize];
    ["Offset of field: _FridaHostSpawnOptions::has_argv"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, has_argv) - 0usize];
    ["Offset of field: _FridaHostSpawnOptions::argv"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, argv) - 8usize];
    ["Offset of field: _FridaHostSpawnOptions::argv_length1"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, argv_length1) - 16usize];
    ["Offset of field: _FridaHostSpawnOptions::has_envp"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, has_envp) - 20usize];
    ["Offset of field: _FridaHostSpawnOptions::envp"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, envp) - 24usize];
    ["Offset of field: _FridaHostSpawnOptions::envp_length1"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, envp_length1) - 32usize];
    ["Offset of field: _FridaHostSpawnOptions::has_env"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, has_env) - 36usize];
    ["Offset of field: _FridaHostSpawnOptions::env"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, env) - 40usize];
    ["Offset of field: _FridaHostSpawnOptions::env_length1"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, env_length1) - 48usize];
    ["Offset of field: _FridaHostSpawnOptions::cwd"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, cwd) - 56usize];
    ["Offset of field: _FridaHostSpawnOptions::stdio"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, stdio) - 64usize];
    ["Offset of field: _FridaHostSpawnOptions::aux"]
        [::std::mem::offset_of!(_FridaHostSpawnOptions, aux) - 72usize];
};
impl Default for _FridaHostSpawnOptions {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentSessionId {
    pub handle: *mut gchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentSessionId"][::std::mem::size_of::<_FridaAgentSessionId>() - 8usize];
    ["Alignment of _FridaAgentSessionId"][::std::mem::align_of::<_FridaAgentSessionId>() - 8usize];
    ["Offset of field: _FridaAgentSessionId::handle"]
        [::std::mem::offset_of!(_FridaAgentSessionId, handle) - 0usize];
};
impl Default for _FridaAgentSessionId {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaInjectorPayloadId {
    pub handle: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaInjectorPayloadId"][::std::mem::size_of::<_FridaInjectorPayloadId>() - 4usize];
    ["Alignment of _FridaInjectorPayloadId"]
        [::std::mem::align_of::<_FridaInjectorPayloadId>() - 4usize];
    ["Offset of field: _FridaInjectorPayloadId::handle"]
        [::std::mem::offset_of!(_FridaInjectorPayloadId, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaChannelId {
    pub handle: *mut gchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaChannelId"][::std::mem::size_of::<_FridaChannelId>() - 8usize];
    ["Alignment of _FridaChannelId"][::std::mem::align_of::<_FridaChannelId>() - 8usize];
    ["Offset of field: _FridaChannelId::handle"]
        [::std::mem::offset_of!(_FridaChannelId, handle) - 0usize];
};
impl Default for _FridaChannelId {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaServiceSessionId {
    pub handle: *mut gchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaServiceSessionId"][::std::mem::size_of::<_FridaServiceSessionId>() - 8usize];
    ["Alignment of _FridaServiceSessionId"]
        [::std::mem::align_of::<_FridaServiceSessionId>() - 8usize];
    ["Offset of field: _FridaServiceSessionId::handle"]
        [::std::mem::offset_of!(_FridaServiceSessionId, handle) - 0usize];
};
impl Default for _FridaServiceSessionId {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaHostSessionIface {
    pub parent_iface: GTypeInterface,
    pub ping: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            interval_seconds: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub ping_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub query_system_parameters: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub query_system_parameters_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> *mut GHashTable,
    >,
    pub get_frontmost_application: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub get_frontmost_application_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaHostApplicationInfo,
            error: *mut *mut GError,
        ),
    >,
    pub enumerate_applications: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enumerate_applications_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut FridaHostApplicationInfo,
    >,
    pub enumerate_processes: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enumerate_processes_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut FridaHostProcessInfo,
    >,
    pub enable_spawn_gating: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enable_spawn_gating_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub disable_spawn_gating: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub disable_spawn_gating_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub enumerate_pending_spawn: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enumerate_pending_spawn_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut FridaHostSpawnInfo,
    >,
    pub enumerate_pending_children: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enumerate_pending_children_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut FridaHostChildInfo,
    >,
    pub spawn: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            program: *const gchar,
            options: *mut FridaHostSpawnOptions,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub spawn_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> guint,
    >,
    pub input: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            data: *mut guint8,
            data_length1: gint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub input_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub resume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub resume_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub kill: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub kill_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub attach: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub attach_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaAgentSessionId,
            error: *mut *mut GError,
        ),
    >,
    pub reattach: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            id: *mut FridaAgentSessionId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub reattach_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub inject_library_file: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            path: *const gchar,
            entrypoint: *const gchar,
            data: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub inject_library_file_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaInjectorPayloadId,
            error: *mut *mut GError,
        ),
    >,
    pub inject_library_blob: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            pid: guint,
            blob: *mut guint8,
            blob_length1: gint,
            entrypoint: *const gchar,
            data: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub inject_library_blob_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaInjectorPayloadId,
            error: *mut *mut GError,
        ),
    >,
    pub open_channel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            address: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub open_channel_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaChannelId,
            error: *mut *mut GError,
        ),
    >,
    pub open_service: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            address: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub open_service_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaHostSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaServiceSessionId,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostSessionIface"][::std::mem::size_of::<_FridaHostSessionIface>() - 320usize];
    ["Alignment of _FridaHostSessionIface"]
        [::std::mem::align_of::<_FridaHostSessionIface>() - 8usize];
    ["Offset of field: _FridaHostSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaHostSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaHostSessionIface::ping"]
        [::std::mem::offset_of!(_FridaHostSessionIface, ping) - 16usize];
    ["Offset of field: _FridaHostSessionIface::ping_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, ping_finish) - 24usize];
    ["Offset of field: _FridaHostSessionIface::query_system_parameters"]
        [::std::mem::offset_of!(_FridaHostSessionIface, query_system_parameters) - 32usize];
    ["Offset of field: _FridaHostSessionIface::query_system_parameters_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, query_system_parameters_finish) - 40usize];
    ["Offset of field: _FridaHostSessionIface::get_frontmost_application"]
        [::std::mem::offset_of!(_FridaHostSessionIface, get_frontmost_application) - 48usize];
    ["Offset of field: _FridaHostSessionIface::get_frontmost_application_finish"][::std::mem::offset_of!(
        _FridaHostSessionIface,
        get_frontmost_application_finish
    ) - 56usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_applications"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_applications) - 64usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_applications_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_applications_finish) - 72usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_processes"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_processes) - 80usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_processes_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_processes_finish) - 88usize];
    ["Offset of field: _FridaHostSessionIface::enable_spawn_gating"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enable_spawn_gating) - 96usize];
    ["Offset of field: _FridaHostSessionIface::enable_spawn_gating_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enable_spawn_gating_finish) - 104usize];
    ["Offset of field: _FridaHostSessionIface::disable_spawn_gating"]
        [::std::mem::offset_of!(_FridaHostSessionIface, disable_spawn_gating) - 112usize];
    ["Offset of field: _FridaHostSessionIface::disable_spawn_gating_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, disable_spawn_gating_finish) - 120usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_pending_spawn"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_pending_spawn) - 128usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_pending_spawn_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_pending_spawn_finish) - 136usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_pending_children"]
        [::std::mem::offset_of!(_FridaHostSessionIface, enumerate_pending_children) - 144usize];
    ["Offset of field: _FridaHostSessionIface::enumerate_pending_children_finish"][::std::mem::offset_of!(
        _FridaHostSessionIface,
        enumerate_pending_children_finish
    ) - 152usize];
    ["Offset of field: _FridaHostSessionIface::spawn"]
        [::std::mem::offset_of!(_FridaHostSessionIface, spawn) - 160usize];
    ["Offset of field: _FridaHostSessionIface::spawn_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, spawn_finish) - 168usize];
    ["Offset of field: _FridaHostSessionIface::input"]
        [::std::mem::offset_of!(_FridaHostSessionIface, input) - 176usize];
    ["Offset of field: _FridaHostSessionIface::input_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, input_finish) - 184usize];
    ["Offset of field: _FridaHostSessionIface::resume"]
        [::std::mem::offset_of!(_FridaHostSessionIface, resume) - 192usize];
    ["Offset of field: _FridaHostSessionIface::resume_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, resume_finish) - 200usize];
    ["Offset of field: _FridaHostSessionIface::kill"]
        [::std::mem::offset_of!(_FridaHostSessionIface, kill) - 208usize];
    ["Offset of field: _FridaHostSessionIface::kill_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, kill_finish) - 216usize];
    ["Offset of field: _FridaHostSessionIface::attach"]
        [::std::mem::offset_of!(_FridaHostSessionIface, attach) - 224usize];
    ["Offset of field: _FridaHostSessionIface::attach_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, attach_finish) - 232usize];
    ["Offset of field: _FridaHostSessionIface::reattach"]
        [::std::mem::offset_of!(_FridaHostSessionIface, reattach) - 240usize];
    ["Offset of field: _FridaHostSessionIface::reattach_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, reattach_finish) - 248usize];
    ["Offset of field: _FridaHostSessionIface::inject_library_file"]
        [::std::mem::offset_of!(_FridaHostSessionIface, inject_library_file) - 256usize];
    ["Offset of field: _FridaHostSessionIface::inject_library_file_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, inject_library_file_finish) - 264usize];
    ["Offset of field: _FridaHostSessionIface::inject_library_blob"]
        [::std::mem::offset_of!(_FridaHostSessionIface, inject_library_blob) - 272usize];
    ["Offset of field: _FridaHostSessionIface::inject_library_blob_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, inject_library_blob_finish) - 280usize];
    ["Offset of field: _FridaHostSessionIface::open_channel"]
        [::std::mem::offset_of!(_FridaHostSessionIface, open_channel) - 288usize];
    ["Offset of field: _FridaHostSessionIface::open_channel_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, open_channel_finish) - 296usize];
    ["Offset of field: _FridaHostSessionIface::open_service"]
        [::std::mem::offset_of!(_FridaHostSessionIface, open_service) - 304usize];
    ["Offset of field: _FridaHostSessionIface::open_service_finish"]
        [::std::mem::offset_of!(_FridaHostSessionIface, open_service_finish) - 312usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAgentSessionProviderIface {
    pub parent_iface: GTypeInterface,
    pub open: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            id: *mut FridaAgentSessionId,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub open_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub migrate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            id: *mut FridaAgentSessionId,
            to_socket: *mut GSocket,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub migrate_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub unload: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub unload_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSessionProvider,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentSessionProviderIface"]
        [::std::mem::size_of::<_FridaAgentSessionProviderIface>() - 64usize];
    ["Alignment of _FridaAgentSessionProviderIface"]
        [::std::mem::align_of::<_FridaAgentSessionProviderIface>() - 8usize];
    ["Offset of field: _FridaAgentSessionProviderIface::parent_iface"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, parent_iface) - 0usize];
    ["Offset of field: _FridaAgentSessionProviderIface::open"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, open) - 16usize];
    ["Offset of field: _FridaAgentSessionProviderIface::open_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, open_finish) - 24usize];
    ["Offset of field: _FridaAgentSessionProviderIface::migrate"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, migrate) - 32usize];
    ["Offset of field: _FridaAgentSessionProviderIface::migrate_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, migrate_finish) - 40usize];
    ["Offset of field: _FridaAgentSessionProviderIface::unload"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, unload) - 48usize];
    ["Offset of field: _FridaAgentSessionProviderIface::unload_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionProviderIface, unload_finish) - 56usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAgentScriptId {
    pub handle: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentScriptId"][::std::mem::size_of::<_FridaAgentScriptId>() - 4usize];
    ["Alignment of _FridaAgentScriptId"][::std::mem::align_of::<_FridaAgentScriptId>() - 4usize];
    ["Offset of field: _FridaAgentScriptId::handle"]
        [::std::mem::offset_of!(_FridaAgentScriptId, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaAgentMessage {
    pub kind: FridaAgentMessageKind,
    pub script_id: FridaAgentScriptId,
    pub text: *mut gchar,
    pub has_data: gboolean,
    pub data: *mut guint8,
    pub data_length1: gint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentMessage"][::std::mem::size_of::<_FridaAgentMessage>() - 40usize];
    ["Alignment of _FridaAgentMessage"][::std::mem::align_of::<_FridaAgentMessage>() - 8usize];
    ["Offset of field: _FridaAgentMessage::kind"]
        [::std::mem::offset_of!(_FridaAgentMessage, kind) - 0usize];
    ["Offset of field: _FridaAgentMessage::script_id"]
        [::std::mem::offset_of!(_FridaAgentMessage, script_id) - 4usize];
    ["Offset of field: _FridaAgentMessage::text"]
        [::std::mem::offset_of!(_FridaAgentMessage, text) - 8usize];
    ["Offset of field: _FridaAgentMessage::has_data"]
        [::std::mem::offset_of!(_FridaAgentMessage, has_data) - 16usize];
    ["Offset of field: _FridaAgentMessage::data"]
        [::std::mem::offset_of!(_FridaAgentMessage, data) - 24usize];
    ["Offset of field: _FridaAgentMessage::data_length1"]
        [::std::mem::offset_of!(_FridaAgentMessage, data_length1) - 32usize];
};
impl Default for _FridaAgentMessage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaPortalMembershipId {
    pub handle: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaPortalMembershipId"]
        [::std::mem::size_of::<_FridaPortalMembershipId>() - 4usize];
    ["Alignment of _FridaPortalMembershipId"]
        [::std::mem::align_of::<_FridaPortalMembershipId>() - 4usize];
    ["Offset of field: _FridaPortalMembershipId::handle"]
        [::std::mem::offset_of!(_FridaPortalMembershipId, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAgentSessionIface {
    pub parent_iface: GTypeInterface,
    pub close: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub close_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub interrupt: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub interrupt_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub resume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            rx_batch_id: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub resume_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            tx_batch_id: *mut guint,
            error: *mut *mut GError,
        ),
    >,
    pub enable_child_gating: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enable_child_gating_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub disable_child_gating: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub disable_child_gating_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub create_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            source: *const gchar,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub create_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaAgentScriptId,
            error: *mut *mut GError,
        ),
    >,
    pub create_script_from_bytes: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            bytes: *mut guint8,
            bytes_length1: gint,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub create_script_from_bytes_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaAgentScriptId,
            error: *mut *mut GError,
        ),
    >,
    pub compile_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            source: *const gchar,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub compile_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut guint8,
    >,
    pub snapshot_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            embed_script: *const gchar,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub snapshot_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            result_length1: *mut gint,
            error: *mut *mut GError,
        ) -> *mut guint8,
    >,
    pub destroy_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            script_id: *mut FridaAgentScriptId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub destroy_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub load_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            script_id: *mut FridaAgentScriptId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub load_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub eternalize_script: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            script_id: *mut FridaAgentScriptId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub eternalize_script_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub enable_debugger: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            script_id: *mut FridaAgentScriptId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub enable_debugger_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub disable_debugger: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            script_id: *mut FridaAgentScriptId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub disable_debugger_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub post_messages: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            messages: *mut FridaAgentMessage,
            messages_length1: gint,
            batch_id: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub post_messages_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub join_portal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            address: *const gchar,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub join_portal_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            result: *mut FridaPortalMembershipId,
            error: *mut *mut GError,
        ),
    >,
    pub leave_portal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            membership_id: *mut FridaPortalMembershipId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub leave_portal_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub offer_peer_connection: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            offer_sdp: *const gchar,
            peer_options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub offer_peer_connection_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            answer_sdp: *mut *mut gchar,
            error: *mut *mut GError,
        ),
    >,
    pub add_candidates: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            candidate_sdps: *mut *mut gchar,
            candidate_sdps_length1: gint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub add_candidates_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub notify_candidate_gathering_done: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub notify_candidate_gathering_done_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub begin_migration: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub begin_migration_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub commit_migration: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub commit_migration_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentSessionIface"]
        [::std::mem::size_of::<_FridaAgentSessionIface>() - 368usize];
    ["Alignment of _FridaAgentSessionIface"]
        [::std::mem::align_of::<_FridaAgentSessionIface>() - 8usize];
    ["Offset of field: _FridaAgentSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaAgentSessionIface::close"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, close) - 16usize];
    ["Offset of field: _FridaAgentSessionIface::close_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, close_finish) - 24usize];
    ["Offset of field: _FridaAgentSessionIface::interrupt"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, interrupt) - 32usize];
    ["Offset of field: _FridaAgentSessionIface::interrupt_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, interrupt_finish) - 40usize];
    ["Offset of field: _FridaAgentSessionIface::resume"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, resume) - 48usize];
    ["Offset of field: _FridaAgentSessionIface::resume_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, resume_finish) - 56usize];
    ["Offset of field: _FridaAgentSessionIface::enable_child_gating"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, enable_child_gating) - 64usize];
    ["Offset of field: _FridaAgentSessionIface::enable_child_gating_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, enable_child_gating_finish) - 72usize];
    ["Offset of field: _FridaAgentSessionIface::disable_child_gating"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, disable_child_gating) - 80usize];
    ["Offset of field: _FridaAgentSessionIface::disable_child_gating_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, disable_child_gating_finish) - 88usize];
    ["Offset of field: _FridaAgentSessionIface::create_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, create_script) - 96usize];
    ["Offset of field: _FridaAgentSessionIface::create_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, create_script_finish) - 104usize];
    ["Offset of field: _FridaAgentSessionIface::create_script_from_bytes"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, create_script_from_bytes) - 112usize];
    ["Offset of field: _FridaAgentSessionIface::create_script_from_bytes_finish"][::std::mem::offset_of!(
        _FridaAgentSessionIface,
        create_script_from_bytes_finish
    ) - 120usize];
    ["Offset of field: _FridaAgentSessionIface::compile_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, compile_script) - 128usize];
    ["Offset of field: _FridaAgentSessionIface::compile_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, compile_script_finish) - 136usize];
    ["Offset of field: _FridaAgentSessionIface::snapshot_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, snapshot_script) - 144usize];
    ["Offset of field: _FridaAgentSessionIface::snapshot_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, snapshot_script_finish) - 152usize];
    ["Offset of field: _FridaAgentSessionIface::destroy_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, destroy_script) - 160usize];
    ["Offset of field: _FridaAgentSessionIface::destroy_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, destroy_script_finish) - 168usize];
    ["Offset of field: _FridaAgentSessionIface::load_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, load_script) - 176usize];
    ["Offset of field: _FridaAgentSessionIface::load_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, load_script_finish) - 184usize];
    ["Offset of field: _FridaAgentSessionIface::eternalize_script"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, eternalize_script) - 192usize];
    ["Offset of field: _FridaAgentSessionIface::eternalize_script_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, eternalize_script_finish) - 200usize];
    ["Offset of field: _FridaAgentSessionIface::enable_debugger"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, enable_debugger) - 208usize];
    ["Offset of field: _FridaAgentSessionIface::enable_debugger_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, enable_debugger_finish) - 216usize];
    ["Offset of field: _FridaAgentSessionIface::disable_debugger"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, disable_debugger) - 224usize];
    ["Offset of field: _FridaAgentSessionIface::disable_debugger_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, disable_debugger_finish) - 232usize];
    ["Offset of field: _FridaAgentSessionIface::post_messages"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, post_messages) - 240usize];
    ["Offset of field: _FridaAgentSessionIface::post_messages_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, post_messages_finish) - 248usize];
    ["Offset of field: _FridaAgentSessionIface::join_portal"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, join_portal) - 256usize];
    ["Offset of field: _FridaAgentSessionIface::join_portal_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, join_portal_finish) - 264usize];
    ["Offset of field: _FridaAgentSessionIface::leave_portal"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, leave_portal) - 272usize];
    ["Offset of field: _FridaAgentSessionIface::leave_portal_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, leave_portal_finish) - 280usize];
    ["Offset of field: _FridaAgentSessionIface::offer_peer_connection"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, offer_peer_connection) - 288usize];
    ["Offset of field: _FridaAgentSessionIface::offer_peer_connection_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, offer_peer_connection_finish) - 296usize];
    ["Offset of field: _FridaAgentSessionIface::add_candidates"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, add_candidates) - 304usize];
    ["Offset of field: _FridaAgentSessionIface::add_candidates_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, add_candidates_finish) - 312usize];
    ["Offset of field: _FridaAgentSessionIface::notify_candidate_gathering_done"][::std::mem::offset_of!(
        _FridaAgentSessionIface,
        notify_candidate_gathering_done
    ) - 320usize];
    ["Offset of field: _FridaAgentSessionIface::notify_candidate_gathering_done_finish"][::std::mem::offset_of!(
        _FridaAgentSessionIface,
        notify_candidate_gathering_done_finish
    )
        - 328usize];
    ["Offset of field: _FridaAgentSessionIface::begin_migration"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, begin_migration) - 336usize];
    ["Offset of field: _FridaAgentSessionIface::begin_migration_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, begin_migration_finish) - 344usize];
    ["Offset of field: _FridaAgentSessionIface::commit_migration"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, commit_migration) - 352usize];
    ["Offset of field: _FridaAgentSessionIface::commit_migration_finish"]
        [::std::mem::offset_of!(_FridaAgentSessionIface, commit_migration_finish) - 360usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaHostChildId {
    pub handle: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaHostChildId"][::std::mem::size_of::<_FridaHostChildId>() - 4usize];
    ["Alignment of _FridaHostChildId"][::std::mem::align_of::<_FridaHostChildId>() - 4usize];
    ["Offset of field: _FridaHostChildId::handle"]
        [::std::mem::offset_of!(_FridaHostChildId, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAgentControllerIface {
    pub parent_iface: GTypeInterface,
    pub prepare_to_fork: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            parent_pid: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub prepare_to_fork_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            parent_injectee_id: *mut guint,
            child_injectee_id: *mut guint,
            child_socket: *mut *mut GSocket,
            result: *mut FridaHostChildId,
            error: *mut *mut GError,
        ),
    >,
    pub prepare_to_specialize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            pid: guint,
            identifier: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub prepare_to_specialize_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            specialized_injectee_id: *mut guint,
            specialized_pipe_address: *mut *mut gchar,
            result: *mut FridaHostChildId,
            error: *mut *mut GError,
        ),
    >,
    pub recreate_agent_thread: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            pid: guint,
            injectee_id: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub recreate_agent_thread_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub wait_for_permission_to_resume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            id: *mut FridaHostChildId,
            info: *mut FridaHostChildInfo,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub wait_for_permission_to_resume_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub prepare_to_exec: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            info: *mut FridaHostChildInfo,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub prepare_to_exec_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub cancel_exec: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            pid: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub cancel_exec_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub acknowledge_spawn: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            info: *mut FridaHostChildInfo,
            start_state: FridaSpawnStartState,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub acknowledge_spawn_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentController,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentControllerIface"]
        [::std::mem::size_of::<_FridaAgentControllerIface>() - 128usize];
    ["Alignment of _FridaAgentControllerIface"]
        [::std::mem::align_of::<_FridaAgentControllerIface>() - 8usize];
    ["Offset of field: _FridaAgentControllerIface::parent_iface"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, parent_iface) - 0usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_fork"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, prepare_to_fork) - 16usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_fork_finish"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, prepare_to_fork_finish) - 24usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_specialize"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, prepare_to_specialize) - 32usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_specialize_finish"][::std::mem::offset_of!(
        _FridaAgentControllerIface,
        prepare_to_specialize_finish
    ) - 40usize];
    ["Offset of field: _FridaAgentControllerIface::recreate_agent_thread"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, recreate_agent_thread) - 48usize];
    ["Offset of field: _FridaAgentControllerIface::recreate_agent_thread_finish"][::std::mem::offset_of!(
        _FridaAgentControllerIface,
        recreate_agent_thread_finish
    ) - 56usize];
    ["Offset of field: _FridaAgentControllerIface::wait_for_permission_to_resume"][::std::mem::offset_of!(
        _FridaAgentControllerIface,
        wait_for_permission_to_resume
    ) - 64usize];
    ["Offset of field: _FridaAgentControllerIface::wait_for_permission_to_resume_finish"][::std::mem::offset_of!(
        _FridaAgentControllerIface,
        wait_for_permission_to_resume_finish
    )
        - 72usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_exec"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, prepare_to_exec) - 80usize];
    ["Offset of field: _FridaAgentControllerIface::prepare_to_exec_finish"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, prepare_to_exec_finish) - 88usize];
    ["Offset of field: _FridaAgentControllerIface::cancel_exec"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, cancel_exec) - 96usize];
    ["Offset of field: _FridaAgentControllerIface::cancel_exec_finish"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, cancel_exec_finish) - 104usize];
    ["Offset of field: _FridaAgentControllerIface::acknowledge_spawn"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, acknowledge_spawn) - 112usize];
    ["Offset of field: _FridaAgentControllerIface::acknowledge_spawn_finish"]
        [::std::mem::offset_of!(_FridaAgentControllerIface, acknowledge_spawn_finish) - 120usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAgentMessageSinkIface {
    pub parent_iface: GTypeInterface,
    pub post_messages: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentMessageSink,
            messages: *mut FridaAgentMessage,
            messages_length1: gint,
            batch_id: guint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub post_messages_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAgentMessageSink,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAgentMessageSinkIface"]
        [::std::mem::size_of::<_FridaAgentMessageSinkIface>() - 32usize];
    ["Alignment of _FridaAgentMessageSinkIface"]
        [::std::mem::align_of::<_FridaAgentMessageSinkIface>() - 8usize];
    ["Offset of field: _FridaAgentMessageSinkIface::parent_iface"]
        [::std::mem::offset_of!(_FridaAgentMessageSinkIface, parent_iface) - 0usize];
    ["Offset of field: _FridaAgentMessageSinkIface::post_messages"]
        [::std::mem::offset_of!(_FridaAgentMessageSinkIface, post_messages) - 16usize];
    ["Offset of field: _FridaAgentMessageSinkIface::post_messages_finish"]
        [::std::mem::offset_of!(_FridaAgentMessageSinkIface, post_messages_finish) - 24usize];
};
pub const FridaError_FRIDA_ERROR_SERVER_NOT_RUNNING: FridaError = 0;
pub const FridaError_FRIDA_ERROR_EXECUTABLE_NOT_FOUND: FridaError = 1;
pub const FridaError_FRIDA_ERROR_EXECUTABLE_NOT_SUPPORTED: FridaError = 2;
pub const FridaError_FRIDA_ERROR_PROCESS_NOT_FOUND: FridaError = 3;
pub const FridaError_FRIDA_ERROR_PROCESS_NOT_RESPONDING: FridaError = 4;
pub const FridaError_FRIDA_ERROR_INVALID_ARGUMENT: FridaError = 5;
pub const FridaError_FRIDA_ERROR_INVALID_OPERATION: FridaError = 6;
pub const FridaError_FRIDA_ERROR_PERMISSION_DENIED: FridaError = 7;
pub const FridaError_FRIDA_ERROR_ADDRESS_IN_USE: FridaError = 8;
pub const FridaError_FRIDA_ERROR_TIMED_OUT: FridaError = 9;
pub const FridaError_FRIDA_ERROR_NOT_SUPPORTED: FridaError = 10;
pub const FridaError_FRIDA_ERROR_PROTOCOL: FridaError = 11;
pub const FridaError_FRIDA_ERROR_TRANSPORT: FridaError = 12;
pub type FridaError = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaGadgetSessionIface {
    pub parent_iface: GTypeInterface,
    pub break_and_resume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaGadgetSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub break_and_resume_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaGadgetSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub break_and_detach: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaGadgetSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub break_and_detach_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaGadgetSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaGadgetSessionIface"]
        [::std::mem::size_of::<_FridaGadgetSessionIface>() - 48usize];
    ["Alignment of _FridaGadgetSessionIface"]
        [::std::mem::align_of::<_FridaGadgetSessionIface>() - 8usize];
    ["Offset of field: _FridaGadgetSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaGadgetSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaGadgetSessionIface::break_and_resume"]
        [::std::mem::offset_of!(_FridaGadgetSessionIface, break_and_resume) - 16usize];
    ["Offset of field: _FridaGadgetSessionIface::break_and_resume_finish"]
        [::std::mem::offset_of!(_FridaGadgetSessionIface, break_and_resume_finish) - 24usize];
    ["Offset of field: _FridaGadgetSessionIface::break_and_detach"]
        [::std::mem::offset_of!(_FridaGadgetSessionIface, break_and_detach) - 32usize];
    ["Offset of field: _FridaGadgetSessionIface::break_and_detach_finish"]
        [::std::mem::offset_of!(_FridaGadgetSessionIface, break_and_detach_finish) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaChannelIface {
    pub parent_iface: GTypeInterface,
    pub close: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaChannel,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub close_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaChannel,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub input: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaChannel,
            data: *mut guint8,
            data_length1: gint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub input_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaChannel,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaChannelIface"][::std::mem::size_of::<_FridaChannelIface>() - 48usize];
    ["Alignment of _FridaChannelIface"][::std::mem::align_of::<_FridaChannelIface>() - 8usize];
    ["Offset of field: _FridaChannelIface::parent_iface"]
        [::std::mem::offset_of!(_FridaChannelIface, parent_iface) - 0usize];
    ["Offset of field: _FridaChannelIface::close"]
        [::std::mem::offset_of!(_FridaChannelIface, close) - 16usize];
    ["Offset of field: _FridaChannelIface::close_finish"]
        [::std::mem::offset_of!(_FridaChannelIface, close_finish) - 24usize];
    ["Offset of field: _FridaChannelIface::input"]
        [::std::mem::offset_of!(_FridaChannelIface, input) - 32usize];
    ["Offset of field: _FridaChannelIface::input_finish"]
        [::std::mem::offset_of!(_FridaChannelIface, input_finish) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaServiceSessionIface {
    pub parent_iface: GTypeInterface,
    pub activate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub activate_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub cancel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub cancel_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub request: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            parameters: *mut GVariant,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub request_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaServiceSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> *mut GVariant,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaServiceSessionIface"]
        [::std::mem::size_of::<_FridaServiceSessionIface>() - 64usize];
    ["Alignment of _FridaServiceSessionIface"]
        [::std::mem::align_of::<_FridaServiceSessionIface>() - 8usize];
    ["Offset of field: _FridaServiceSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaServiceSessionIface::activate"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, activate) - 16usize];
    ["Offset of field: _FridaServiceSessionIface::activate_finish"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, activate_finish) - 24usize];
    ["Offset of field: _FridaServiceSessionIface::cancel"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, cancel) - 32usize];
    ["Offset of field: _FridaServiceSessionIface::cancel_finish"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, cancel_finish) - 40usize];
    ["Offset of field: _FridaServiceSessionIface::request"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, request) - 48usize];
    ["Offset of field: _FridaServiceSessionIface::request_finish"]
        [::std::mem::offset_of!(_FridaServiceSessionIface, request_finish) - 56usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaTransportBrokerIface {
    pub parent_iface: GTypeInterface,
    pub open_tcp_transport: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaTransportBroker,
            id: *mut FridaAgentSessionId,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub open_tcp_transport_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaTransportBroker,
            _res_: *mut GAsyncResult,
            port: *mut guint16,
            token: *mut *mut gchar,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaTransportBrokerIface"]
        [::std::mem::size_of::<_FridaTransportBrokerIface>() - 32usize];
    ["Alignment of _FridaTransportBrokerIface"]
        [::std::mem::align_of::<_FridaTransportBrokerIface>() - 8usize];
    ["Offset of field: _FridaTransportBrokerIface::parent_iface"]
        [::std::mem::offset_of!(_FridaTransportBrokerIface, parent_iface) - 0usize];
    ["Offset of field: _FridaTransportBrokerIface::open_tcp_transport"]
        [::std::mem::offset_of!(_FridaTransportBrokerIface, open_tcp_transport) - 16usize];
    ["Offset of field: _FridaTransportBrokerIface::open_tcp_transport_finish"]
        [::std::mem::offset_of!(_FridaTransportBrokerIface, open_tcp_transport_finish) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaPortalSessionIface {
    pub parent_iface: GTypeInterface,
    pub join: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaPortalSession,
            app: *mut FridaHostApplicationInfo,
            current_state: FridaSpawnStartState,
            interrupted_sessions: *mut FridaAgentSessionId,
            interrupted_sessions_length1: gint,
            options: *mut GHashTable,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub join_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaPortalSession,
            _res_: *mut GAsyncResult,
            next_state: *mut FridaSpawnStartState,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaPortalSessionIface"]
        [::std::mem::size_of::<_FridaPortalSessionIface>() - 32usize];
    ["Alignment of _FridaPortalSessionIface"]
        [::std::mem::align_of::<_FridaPortalSessionIface>() - 8usize];
    ["Offset of field: _FridaPortalSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaPortalSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaPortalSessionIface::join"]
        [::std::mem::offset_of!(_FridaPortalSessionIface, join) - 16usize];
    ["Offset of field: _FridaPortalSessionIface::join_finish"]
        [::std::mem::offset_of!(_FridaPortalSessionIface, join_finish) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaBusSessionIface {
    pub parent_iface: GTypeInterface,
    pub attach: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaBusSession,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub attach_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaBusSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
    pub post: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaBusSession,
            json: *const gchar,
            has_data: gboolean,
            data: *mut guint8,
            data_length1: gint,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub post_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaBusSession,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaBusSessionIface"][::std::mem::size_of::<_FridaBusSessionIface>() - 48usize];
    ["Alignment of _FridaBusSessionIface"]
        [::std::mem::align_of::<_FridaBusSessionIface>() - 8usize];
    ["Offset of field: _FridaBusSessionIface::parent_iface"]
        [::std::mem::offset_of!(_FridaBusSessionIface, parent_iface) - 0usize];
    ["Offset of field: _FridaBusSessionIface::attach"]
        [::std::mem::offset_of!(_FridaBusSessionIface, attach) - 16usize];
    ["Offset of field: _FridaBusSessionIface::attach_finish"]
        [::std::mem::offset_of!(_FridaBusSessionIface, attach_finish) - 24usize];
    ["Offset of field: _FridaBusSessionIface::post"]
        [::std::mem::offset_of!(_FridaBusSessionIface, post) - 32usize];
    ["Offset of field: _FridaBusSessionIface::post_finish"]
        [::std::mem::offset_of!(_FridaBusSessionIface, post_finish) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaAuthenticationServiceIface {
    pub parent_iface: GTypeInterface,
    pub authenticate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAuthenticationService,
            token: *const gchar,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub authenticate_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaAuthenticationService,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> *mut gchar,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaAuthenticationServiceIface"]
        [::std::mem::size_of::<_FridaAuthenticationServiceIface>() - 32usize];
    ["Alignment of _FridaAuthenticationServiceIface"]
        [::std::mem::align_of::<_FridaAuthenticationServiceIface>() - 8usize];
    ["Offset of field: _FridaAuthenticationServiceIface::parent_iface"]
        [::std::mem::offset_of!(_FridaAuthenticationServiceIface, parent_iface) - 0usize];
    ["Offset of field: _FridaAuthenticationServiceIface::authenticate"]
        [::std::mem::offset_of!(_FridaAuthenticationServiceIface, authenticate) - 16usize];
    ["Offset of field: _FridaAuthenticationServiceIface::authenticate_finish"]
        [::std::mem::offset_of!(_FridaAuthenticationServiceIface, authenticate_finish) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaMappedLibraryBlob {
    pub address: guint64,
    pub size: guint,
    pub allocated_size: guint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaMappedLibraryBlob"][::std::mem::size_of::<_FridaMappedLibraryBlob>() - 16usize];
    ["Alignment of _FridaMappedLibraryBlob"]
        [::std::mem::align_of::<_FridaMappedLibraryBlob>() - 8usize];
    ["Offset of field: _FridaMappedLibraryBlob::address"]
        [::std::mem::offset_of!(_FridaMappedLibraryBlob, address) - 0usize];
    ["Offset of field: _FridaMappedLibraryBlob::size"]
        [::std::mem::offset_of!(_FridaMappedLibraryBlob, size) - 8usize];
    ["Offset of field: _FridaMappedLibraryBlob::allocated_size"]
        [::std::mem::offset_of!(_FridaMappedLibraryBlob, allocated_size) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaLinuxInjectorState {
    pub frida_ctrlfd: gint,
    pub agent_ctrlfd: gint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaLinuxInjectorState"]
        [::std::mem::size_of::<_FridaLinuxInjectorState>() - 8usize];
    ["Alignment of _FridaLinuxInjectorState"]
        [::std::mem::align_of::<_FridaLinuxInjectorState>() - 4usize];
    ["Offset of field: _FridaLinuxInjectorState::frida_ctrlfd"]
        [::std::mem::offset_of!(_FridaLinuxInjectorState, frida_ctrlfd) - 0usize];
    ["Offset of field: _FridaLinuxInjectorState::agent_ctrlfd"]
        [::std::mem::offset_of!(_FridaLinuxInjectorState, agent_ctrlfd) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaPosixInjectorState {
    pub fifo_fd: gint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaPosixInjectorState"]
        [::std::mem::size_of::<_FridaPosixInjectorState>() - 4usize];
    ["Alignment of _FridaPosixInjectorState"]
        [::std::mem::align_of::<_FridaPosixInjectorState>() - 4usize];
    ["Offset of field: _FridaPosixInjectorState::fifo_fd"]
        [::std::mem::offset_of!(_FridaPosixInjectorState, fifo_fd) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaCrashInfo {
    pub pid: guint,
    pub process_name: *mut gchar,
    pub summary: *mut gchar,
    pub report: *mut gchar,
    pub parameters: *mut GHashTable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaCrashInfo"][::std::mem::size_of::<_FridaCrashInfo>() - 40usize];
    ["Alignment of _FridaCrashInfo"][::std::mem::align_of::<_FridaCrashInfo>() - 8usize];
    ["Offset of field: _FridaCrashInfo::pid"]
        [::std::mem::offset_of!(_FridaCrashInfo, pid) - 0usize];
    ["Offset of field: _FridaCrashInfo::process_name"]
        [::std::mem::offset_of!(_FridaCrashInfo, process_name) - 8usize];
    ["Offset of field: _FridaCrashInfo::summary"]
        [::std::mem::offset_of!(_FridaCrashInfo, summary) - 16usize];
    ["Offset of field: _FridaCrashInfo::report"]
        [::std::mem::offset_of!(_FridaCrashInfo, report) - 24usize];
    ["Offset of field: _FridaCrashInfo::parameters"]
        [::std::mem::offset_of!(_FridaCrashInfo, parameters) - 32usize];
};
impl Default for _FridaCrashInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualStream {
    pub parent_instance: GIOStream,
    pub priv_: *mut FridaVirtualStreamPrivate,
    pub state: FridaVirtualStreamState,
    pub io_cancellable: *mut GCancellable,
    pub main_context: *mut GMainContext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaVirtualStream"][::std::mem::size_of::<_FridaVirtualStream>() - 64usize];
    ["Alignment of _FridaVirtualStream"][::std::mem::align_of::<_FridaVirtualStream>() - 8usize];
    ["Offset of field: _FridaVirtualStream::parent_instance"]
        [::std::mem::offset_of!(_FridaVirtualStream, parent_instance) - 0usize];
    ["Offset of field: _FridaVirtualStream::priv_"]
        [::std::mem::offset_of!(_FridaVirtualStream, priv_) - 32usize];
    ["Offset of field: _FridaVirtualStream::state"]
        [::std::mem::offset_of!(_FridaVirtualStream, state) - 40usize];
    ["Offset of field: _FridaVirtualStream::io_cancellable"]
        [::std::mem::offset_of!(_FridaVirtualStream, io_cancellable) - 48usize];
    ["Offset of field: _FridaVirtualStream::main_context"]
        [::std::mem::offset_of!(_FridaVirtualStream, main_context) - 56usize];
};
impl Default for _FridaVirtualStream {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaVirtualStreamClass {
    pub parent_class: GIOStreamClass,
    pub query_initial_state: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaVirtualStream) -> FridaVirtualStreamState,
    >,
    pub query_events:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaVirtualStream) -> GIOCondition>,
    pub handle_close: ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaVirtualStream)>,
    pub shutdown_read: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaVirtualStream, error: *mut *mut GError),
    >,
    pub shutdown_write: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaVirtualStream, error: *mut *mut GError),
    >,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaVirtualStream,
            buffer: *mut guint8,
            buffer_length1: gint,
            error: *mut *mut GError,
        ) -> gssize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaVirtualStream,
            buffer: *mut guint8,
            buffer_length1: gint,
            error: *mut *mut GError,
        ) -> gssize,
    >,
    pub update_pending_io:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaVirtualStream)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaVirtualStreamClass"]
        [::std::mem::size_of::<_FridaVirtualStreamClass>() - 320usize];
    ["Alignment of _FridaVirtualStreamClass"]
        [::std::mem::align_of::<_FridaVirtualStreamClass>() - 8usize];
    ["Offset of field: _FridaVirtualStreamClass::parent_class"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, parent_class) - 0usize];
    ["Offset of field: _FridaVirtualStreamClass::query_initial_state"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, query_initial_state) - 256usize];
    ["Offset of field: _FridaVirtualStreamClass::query_events"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, query_events) - 264usize];
    ["Offset of field: _FridaVirtualStreamClass::handle_close"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, handle_close) - 272usize];
    ["Offset of field: _FridaVirtualStreamClass::shutdown_read"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, shutdown_read) - 280usize];
    ["Offset of field: _FridaVirtualStreamClass::shutdown_write"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, shutdown_write) - 288usize];
    ["Offset of field: _FridaVirtualStreamClass::read"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, read) - 296usize];
    ["Offset of field: _FridaVirtualStreamClass::write"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, write) - 304usize];
    ["Offset of field: _FridaVirtualStreamClass::update_pending_io"]
        [::std::mem::offset_of!(_FridaVirtualStreamClass, update_pending_io) - 312usize];
};
impl Default for _FridaVirtualStreamClass {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaRpcPeerIface {
    pub parent_iface: GTypeInterface,
    pub post_rpc_message: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaRpcPeer,
            json: *const gchar,
            data: *mut GBytes,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub post_rpc_message_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaRpcPeer,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaRpcPeerIface"][::std::mem::size_of::<_FridaRpcPeerIface>() - 32usize];
    ["Alignment of _FridaRpcPeerIface"][::std::mem::align_of::<_FridaRpcPeerIface>() - 8usize];
    ["Offset of field: _FridaRpcPeerIface::parent_iface"]
        [::std::mem::offset_of!(_FridaRpcPeerIface, parent_iface) - 0usize];
    ["Offset of field: _FridaRpcPeerIface::post_rpc_message"]
        [::std::mem::offset_of!(_FridaRpcPeerIface, post_rpc_message) - 16usize];
    ["Offset of field: _FridaRpcPeerIface::post_rpc_message_finish"]
        [::std::mem::offset_of!(_FridaRpcPeerIface, post_rpc_message_finish) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaPeerSessionDescription {
    pub parent_instance: GTypeInstance,
    pub ref_count: ::std::os::raw::c_int,
    pub priv_: *mut FridaPeerSessionDescriptionPrivate,
    pub session_id: guint64,
    pub ice_ufrag: *mut gchar,
    pub ice_pwd: *mut gchar,
    pub ice_trickle: gboolean,
    pub fingerprint: *mut gchar,
    pub setup: FridaPeerSetup,
    pub sctp_port: guint16,
    pub max_message_size: gsize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaPeerSessionDescription"]
        [::std::mem::size_of::<_FridaPeerSessionDescription>() - 80usize];
    ["Alignment of _FridaPeerSessionDescription"]
        [::std::mem::align_of::<_FridaPeerSessionDescription>() - 8usize];
    ["Offset of field: _FridaPeerSessionDescription::parent_instance"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, parent_instance) - 0usize];
    ["Offset of field: _FridaPeerSessionDescription::ref_count"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, ref_count) - 8usize];
    ["Offset of field: _FridaPeerSessionDescription::priv_"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, priv_) - 16usize];
    ["Offset of field: _FridaPeerSessionDescription::session_id"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, session_id) - 24usize];
    ["Offset of field: _FridaPeerSessionDescription::ice_ufrag"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, ice_ufrag) - 32usize];
    ["Offset of field: _FridaPeerSessionDescription::ice_pwd"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, ice_pwd) - 40usize];
    ["Offset of field: _FridaPeerSessionDescription::ice_trickle"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, ice_trickle) - 48usize];
    ["Offset of field: _FridaPeerSessionDescription::fingerprint"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, fingerprint) - 56usize];
    ["Offset of field: _FridaPeerSessionDescription::setup"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, setup) - 64usize];
    ["Offset of field: _FridaPeerSessionDescription::sctp_port"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, sctp_port) - 68usize];
    ["Offset of field: _FridaPeerSessionDescription::max_message_size"]
        [::std::mem::offset_of!(_FridaPeerSessionDescription, max_message_size) - 72usize];
};
impl Default for _FridaPeerSessionDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaPeerSessionDescriptionClass {
    pub parent_class: GTypeClass,
    pub finalize:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaPeerSessionDescription)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaPeerSessionDescriptionClass"]
        [::std::mem::size_of::<_FridaPeerSessionDescriptionClass>() - 16usize];
    ["Alignment of _FridaPeerSessionDescriptionClass"]
        [::std::mem::align_of::<_FridaPeerSessionDescriptionClass>() - 8usize];
    ["Offset of field: _FridaPeerSessionDescriptionClass::parent_class"]
        [::std::mem::offset_of!(_FridaPeerSessionDescriptionClass, parent_class) - 0usize];
    ["Offset of field: _FridaPeerSessionDescriptionClass::finalize"]
        [::std::mem::offset_of!(_FridaPeerSessionDescriptionClass, finalize) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaFutureIface {
    pub parent_iface: GTypeInterface,
    pub wait_async: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaFuture,
            cancellable: *mut GCancellable,
            _callback_: GAsyncReadyCallback,
            _user_data_: gpointer,
        ),
    >,
    pub wait_finish: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaFuture,
            _res_: *mut GAsyncResult,
            error: *mut *mut GError,
        ) -> gpointer,
    >,
    pub then: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaFuture,
            handler: FridaFutureCompletionHandler,
            handler_target: gpointer,
            handler_target_destroy_notify: GDestroyNotify,
        ),
    >,
    pub get_result: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaFuture, error: *mut *mut GError) -> gpointer,
    >,
    pub get_ready: ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaFuture) -> gboolean>,
    pub get_value:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaFuture) -> gconstpointer>,
    pub get_error:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaFuture) -> *mut GError>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaFutureIface"][::std::mem::size_of::<_FridaFutureIface>() - 72usize];
    ["Alignment of _FridaFutureIface"][::std::mem::align_of::<_FridaFutureIface>() - 8usize];
    ["Offset of field: _FridaFutureIface::parent_iface"]
        [::std::mem::offset_of!(_FridaFutureIface, parent_iface) - 0usize];
    ["Offset of field: _FridaFutureIface::wait_async"]
        [::std::mem::offset_of!(_FridaFutureIface, wait_async) - 16usize];
    ["Offset of field: _FridaFutureIface::wait_finish"]
        [::std::mem::offset_of!(_FridaFutureIface, wait_finish) - 24usize];
    ["Offset of field: _FridaFutureIface::then"]
        [::std::mem::offset_of!(_FridaFutureIface, then) - 32usize];
    ["Offset of field: _FridaFutureIface::get_result"]
        [::std::mem::offset_of!(_FridaFutureIface, get_result) - 40usize];
    ["Offset of field: _FridaFutureIface::get_ready"]
        [::std::mem::offset_of!(_FridaFutureIface, get_ready) - 48usize];
    ["Offset of field: _FridaFutureIface::get_value"]
        [::std::mem::offset_of!(_FridaFutureIface, get_value) - 56usize];
    ["Offset of field: _FridaFutureIface::get_error"]
        [::std::mem::offset_of!(_FridaFutureIface, get_error) - 64usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaDynamicInterfaceObserverIface {
    pub parent_iface: GTypeInterface,
    pub start:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaDynamicInterfaceObserver)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaDynamicInterfaceObserverIface"]
        [::std::mem::size_of::<_FridaDynamicInterfaceObserverIface>() - 24usize];
    ["Alignment of _FridaDynamicInterfaceObserverIface"]
        [::std::mem::align_of::<_FridaDynamicInterfaceObserverIface>() - 8usize];
    ["Offset of field: _FridaDynamicInterfaceObserverIface::parent_iface"]
        [::std::mem::offset_of!(_FridaDynamicInterfaceObserverIface, parent_iface) - 0usize];
    ["Offset of field: _FridaDynamicInterfaceObserverIface::start"]
        [::std::mem::offset_of!(_FridaDynamicInterfaceObserverIface, start) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaObjectBuilderIface {
    pub parent_iface: GTypeInterface,
    pub begin_dictionary: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut FridaObjectBuilder,
    >,
    pub set_member_name: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            name: *const gchar,
        ) -> *mut FridaObjectBuilder,
    >,
    pub end_dictionary: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut FridaObjectBuilder,
    >,
    pub begin_array: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut FridaObjectBuilder,
    >,
    pub end_array: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut FridaObjectBuilder,
    >,
    pub add_null_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut FridaObjectBuilder,
    >,
    pub add_bool_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: gboolean,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_int64_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: gint64,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_uint64_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: guint64,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_data_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: *mut GBytes,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: *const gchar,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_uuid_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: *mut guint8,
            val_length1: gint,
        ) -> *mut FridaObjectBuilder,
    >,
    pub add_raw_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectBuilder,
            val: *mut GBytes,
        ) -> *mut FridaObjectBuilder,
    >,
    pub build:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut FridaObjectBuilder) -> *mut GBytes>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaObjectBuilderIface"]
        [::std::mem::size_of::<_FridaObjectBuilderIface>() - 128usize];
    ["Alignment of _FridaObjectBuilderIface"]
        [::std::mem::align_of::<_FridaObjectBuilderIface>() - 8usize];
    ["Offset of field: _FridaObjectBuilderIface::parent_iface"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, parent_iface) - 0usize];
    ["Offset of field: _FridaObjectBuilderIface::begin_dictionary"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, begin_dictionary) - 16usize];
    ["Offset of field: _FridaObjectBuilderIface::set_member_name"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, set_member_name) - 24usize];
    ["Offset of field: _FridaObjectBuilderIface::end_dictionary"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, end_dictionary) - 32usize];
    ["Offset of field: _FridaObjectBuilderIface::begin_array"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, begin_array) - 40usize];
    ["Offset of field: _FridaObjectBuilderIface::end_array"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, end_array) - 48usize];
    ["Offset of field: _FridaObjectBuilderIface::add_null_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_null_value) - 56usize];
    ["Offset of field: _FridaObjectBuilderIface::add_bool_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_bool_value) - 64usize];
    ["Offset of field: _FridaObjectBuilderIface::add_int64_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_int64_value) - 72usize];
    ["Offset of field: _FridaObjectBuilderIface::add_uint64_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_uint64_value) - 80usize];
    ["Offset of field: _FridaObjectBuilderIface::add_data_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_data_value) - 88usize];
    ["Offset of field: _FridaObjectBuilderIface::add_string_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_string_value) - 96usize];
    ["Offset of field: _FridaObjectBuilderIface::add_uuid_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_uuid_value) - 104usize];
    ["Offset of field: _FridaObjectBuilderIface::add_raw_value"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, add_raw_value) - 112usize];
    ["Offset of field: _FridaObjectBuilderIface::build"]
        [::std::mem::offset_of!(_FridaObjectBuilderIface, build) - 120usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FridaObjectReaderIface {
    pub parent_iface: GTypeInterface,
    pub has_member: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            name: *const gchar,
            error: *mut *mut GError,
        ) -> gboolean,
    >,
    pub read_member: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            name: *const gchar,
            error: *mut *mut GError,
        ) -> *mut FridaObjectReader,
    >,
    pub end_member: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader) -> *mut FridaObjectReader,
    >,
    pub count_elements: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> guint,
    >,
    pub read_element: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            index: guint,
            error: *mut *mut GError,
        ) -> *mut FridaObjectReader,
    >,
    pub end_element: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            error: *mut *mut GError,
        ) -> *mut FridaObjectReader,
    >,
    pub get_bool_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> gboolean,
    >,
    pub get_uint8_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> guint8,
    >,
    pub get_uint16_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> guint16,
    >,
    pub get_int64_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> gint64,
    >,
    pub get_uint64_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> guint64,
    >,
    pub get_data_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut FridaObjectReader, error: *mut *mut GError) -> *mut GBytes,
    >,
    pub get_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            error: *mut *mut GError,
        ) -> *const gchar,
    >,
    pub get_uuid_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut FridaObjectReader,
            error: *mut *mut GError,
        ) -> *const gchar,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaObjectReaderIface"]
        [::std::mem::size_of::<_FridaObjectReaderIface>() - 128usize];
    ["Alignment of _FridaObjectReaderIface"]
        [::std::mem::align_of::<_FridaObjectReaderIface>() - 8usize];
    ["Offset of field: _FridaObjectReaderIface::parent_iface"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, parent_iface) - 0usize];
    ["Offset of field: _FridaObjectReaderIface::has_member"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, has_member) - 16usize];
    ["Offset of field: _FridaObjectReaderIface::read_member"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, read_member) - 24usize];
    ["Offset of field: _FridaObjectReaderIface::end_member"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, end_member) - 32usize];
    ["Offset of field: _FridaObjectReaderIface::count_elements"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, count_elements) - 40usize];
    ["Offset of field: _FridaObjectReaderIface::read_element"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, read_element) - 48usize];
    ["Offset of field: _FridaObjectReaderIface::end_element"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, end_element) - 56usize];
    ["Offset of field: _FridaObjectReaderIface::get_bool_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_bool_value) - 64usize];
    ["Offset of field: _FridaObjectReaderIface::get_uint8_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_uint8_value) - 72usize];
    ["Offset of field: _FridaObjectReaderIface::get_uint16_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_uint16_value) - 80usize];
    ["Offset of field: _FridaObjectReaderIface::get_int64_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_int64_value) - 88usize];
    ["Offset of field: _FridaObjectReaderIface::get_uint64_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_uint64_value) - 96usize];
    ["Offset of field: _FridaObjectReaderIface::get_data_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_data_value) - 104usize];
    ["Offset of field: _FridaObjectReaderIface::get_string_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_string_value) - 112usize];
    ["Offset of field: _FridaObjectReaderIface::get_uuid_value"]
        [::std::mem::offset_of!(_FridaObjectReaderIface, get_uuid_value) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFileDescriptor {
    pub parent_instance: GObject,
    pub priv_: *mut FridaFileDescriptorPrivate,
    pub handle: gint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaFileDescriptor"][::std::mem::size_of::<_FridaFileDescriptor>() - 40usize];
    ["Alignment of _FridaFileDescriptor"][::std::mem::align_of::<_FridaFileDescriptor>() - 8usize];
    ["Offset of field: _FridaFileDescriptor::parent_instance"]
        [::std::mem::offset_of!(_FridaFileDescriptor, parent_instance) - 0usize];
    ["Offset of field: _FridaFileDescriptor::priv_"]
        [::std::mem::offset_of!(_FridaFileDescriptor, priv_) - 24usize];
    ["Offset of field: _FridaFileDescriptor::handle"]
        [::std::mem::offset_of!(_FridaFileDescriptor, handle) - 32usize];
};
impl Default for _FridaFileDescriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FridaFileDescriptorClass {
    pub parent_class: GObjectClass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FridaFileDescriptorClass"]
        [::std::mem::size_of::<_FridaFileDescriptorClass>() - 136usize];
    ["Alignment of _FridaFileDescriptorClass"]
        [::std::mem::align_of::<_FridaFileDescriptorClass>() - 8usize];
    ["Offset of field: _FridaFileDescriptorClass::parent_class"]
        [::std::mem::offset_of!(_FridaFileDescriptorClass, parent_class) - 0usize];
};
impl Default for _FridaFileDescriptorClass {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn frida_host_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_host_application_info_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_application_info_dup(
        self_: *const FridaHostApplicationInfo,
    ) -> *mut FridaHostApplicationInfo;
}
unsafe extern "C" {
    pub fn frida_host_application_info_free(self_: *mut FridaHostApplicationInfo);
}
unsafe extern "C" {
    pub fn frida_host_application_info_copy(
        self_: *const FridaHostApplicationInfo,
        dest: *mut FridaHostApplicationInfo,
    );
}
unsafe extern "C" {
    pub fn frida_host_application_info_destroy(self_: *mut FridaHostApplicationInfo);
}
unsafe extern "C" {
    pub fn frida_host_process_info_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_process_info_dup(
        self_: *const FridaHostProcessInfo,
    ) -> *mut FridaHostProcessInfo;
}
unsafe extern "C" {
    pub fn frida_host_process_info_free(self_: *mut FridaHostProcessInfo);
}
unsafe extern "C" {
    pub fn frida_host_process_info_copy(
        self_: *const FridaHostProcessInfo,
        dest: *mut FridaHostProcessInfo,
    );
}
unsafe extern "C" {
    pub fn frida_host_process_info_destroy(self_: *mut FridaHostProcessInfo);
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_dup(self_: *const FridaHostSpawnInfo) -> *mut FridaHostSpawnInfo;
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_free(self_: *mut FridaHostSpawnInfo);
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_copy(
        self_: *const FridaHostSpawnInfo,
        dest: *mut FridaHostSpawnInfo,
    );
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_destroy(self_: *mut FridaHostSpawnInfo);
}
unsafe extern "C" {
    pub fn frida_host_child_info_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_child_origin_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_child_info_dup(self_: *const FridaHostChildInfo) -> *mut FridaHostChildInfo;
}
unsafe extern "C" {
    pub fn frida_host_child_info_free(self_: *mut FridaHostChildInfo);
}
unsafe extern "C" {
    pub fn frida_host_child_info_copy(
        self_: *const FridaHostChildInfo,
        dest: *mut FridaHostChildInfo,
    );
}
unsafe extern "C" {
    pub fn frida_host_child_info_destroy(self_: *mut FridaHostChildInfo);
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_stdio_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_dup(
        self_: *const FridaHostSpawnOptions,
    ) -> *mut FridaHostSpawnOptions;
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_free(self_: *mut FridaHostSpawnOptions);
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_copy(
        self_: *const FridaHostSpawnOptions,
        dest: *mut FridaHostSpawnOptions,
    );
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_destroy(self_: *mut FridaHostSpawnOptions);
}
unsafe extern "C" {
    pub fn frida_agent_session_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_session_id_dup(
        self_: *const FridaAgentSessionId,
    ) -> *mut FridaAgentSessionId;
}
unsafe extern "C" {
    pub fn frida_agent_session_id_free(self_: *mut FridaAgentSessionId);
}
unsafe extern "C" {
    pub fn frida_agent_session_id_copy(
        self_: *const FridaAgentSessionId,
        dest: *mut FridaAgentSessionId,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_id_destroy(self_: *mut FridaAgentSessionId);
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_dup(
        self_: *const FridaInjectorPayloadId,
    ) -> *mut FridaInjectorPayloadId;
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_free(self_: *mut FridaInjectorPayloadId);
}
unsafe extern "C" {
    pub fn frida_channel_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_channel_id_dup(self_: *const FridaChannelId) -> *mut FridaChannelId;
}
unsafe extern "C" {
    pub fn frida_channel_id_free(self_: *mut FridaChannelId);
}
unsafe extern "C" {
    pub fn frida_channel_id_copy(self_: *const FridaChannelId, dest: *mut FridaChannelId);
}
unsafe extern "C" {
    pub fn frida_channel_id_destroy(self_: *mut FridaChannelId);
}
unsafe extern "C" {
    pub fn frida_service_session_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_service_session_id_dup(
        self_: *const FridaServiceSessionId,
    ) -> *mut FridaServiceSessionId;
}
unsafe extern "C" {
    pub fn frida_service_session_id_free(self_: *mut FridaServiceSessionId);
}
unsafe extern "C" {
    pub fn frida_service_session_id_copy(
        self_: *const FridaServiceSessionId,
        dest: *mut FridaServiceSessionId,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_id_destroy(self_: *mut FridaServiceSessionId);
}
unsafe extern "C" {
    pub fn frida_host_session_get_type() -> GType;
}
pub type FridaHostSession_autoptr = *mut FridaHostSession;
pub type FridaHostSession_listautoptr = *mut GList;
pub type FridaHostSession_slistautoptr = *mut GSList;
pub type FridaHostSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_host_session_ping(
        self_: *mut FridaHostSession,
        interval_seconds: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_ping_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_query_system_parameters(
        self_: *mut FridaHostSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_query_system_parameters_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    ) -> *mut GHashTable;
}
unsafe extern "C" {
    pub fn frida_host_session_get_frontmost_application(
        self_: *mut FridaHostSession,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_get_frontmost_application_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaHostApplicationInfo,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_applications(
        self_: *mut FridaHostSession,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_applications_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut FridaHostApplicationInfo;
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_processes(
        self_: *mut FridaHostSession,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_processes_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut FridaHostProcessInfo;
}
unsafe extern "C" {
    pub fn frida_host_session_enable_spawn_gating(
        self_: *mut FridaHostSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enable_spawn_gating_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_disable_spawn_gating(
        self_: *mut FridaHostSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_disable_spawn_gating_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_pending_spawn(
        self_: *mut FridaHostSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_pending_spawn_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut FridaHostSpawnInfo;
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_pending_children(
        self_: *mut FridaHostSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_enumerate_pending_children_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut FridaHostChildInfo;
}
unsafe extern "C" {
    pub fn frida_host_session_spawn(
        self_: *mut FridaHostSession,
        program: *const gchar,
        options: *mut FridaHostSpawnOptions,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_spawn_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_host_session_input(
        self_: *mut FridaHostSession,
        pid: guint,
        data: *mut guint8,
        data_length1: gint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_input_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_resume(
        self_: *mut FridaHostSession,
        pid: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_resume_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_kill(
        self_: *mut FridaHostSession,
        pid: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_kill_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_attach(
        self_: *mut FridaHostSession,
        pid: guint,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_attach_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaAgentSessionId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_reattach(
        self_: *mut FridaHostSession,
        id: *mut FridaAgentSessionId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_reattach_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_inject_library_file(
        self_: *mut FridaHostSession,
        pid: guint,
        path: *const gchar,
        entrypoint: *const gchar,
        data: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_inject_library_file_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaInjectorPayloadId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_inject_library_blob(
        self_: *mut FridaHostSession,
        pid: guint,
        blob: *mut guint8,
        blob_length1: gint,
        entrypoint: *const gchar,
        data: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_inject_library_blob_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaInjectorPayloadId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_open_channel(
        self_: *mut FridaHostSession,
        address: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_open_channel_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaChannelId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_open_service(
        self_: *mut FridaHostSession,
        address: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_host_session_open_service_finish(
        self_: *mut FridaHostSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaServiceSessionId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_get_type() -> GType;
}
pub type FridaAgentSessionProvider_autoptr = *mut FridaAgentSessionProvider;
pub type FridaAgentSessionProvider_listautoptr = *mut GList;
pub type FridaAgentSessionProvider_slistautoptr = *mut GSList;
pub type FridaAgentSessionProvider_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_agent_session_provider_open(
        self_: *mut FridaAgentSessionProvider,
        id: *mut FridaAgentSessionId,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_open_finish(
        self_: *mut FridaAgentSessionProvider,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_migrate(
        self_: *mut FridaAgentSessionProvider,
        id: *mut FridaAgentSessionId,
        to_socket: *mut GSocket,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_migrate_finish(
        self_: *mut FridaAgentSessionProvider,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_unload(
        self_: *mut FridaAgentSessionProvider,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_provider_unload_finish(
        self_: *mut FridaAgentSessionProvider,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_script_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_script_id_dup(self_: *const FridaAgentScriptId) -> *mut FridaAgentScriptId;
}
unsafe extern "C" {
    pub fn frida_agent_script_id_free(self_: *mut FridaAgentScriptId);
}
unsafe extern "C" {
    pub fn frida_agent_message_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_message_kind_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_message_dup(self_: *const FridaAgentMessage) -> *mut FridaAgentMessage;
}
unsafe extern "C" {
    pub fn frida_agent_message_free(self_: *mut FridaAgentMessage);
}
unsafe extern "C" {
    pub fn frida_agent_message_copy(self_: *const FridaAgentMessage, dest: *mut FridaAgentMessage);
}
unsafe extern "C" {
    pub fn frida_agent_message_destroy(self_: *mut FridaAgentMessage);
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_dup(
        self_: *const FridaPortalMembershipId,
    ) -> *mut FridaPortalMembershipId;
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_free(self_: *mut FridaPortalMembershipId);
}
unsafe extern "C" {
    pub fn frida_agent_session_get_type() -> GType;
}
pub type FridaAgentSession_autoptr = *mut FridaAgentSession;
pub type FridaAgentSession_listautoptr = *mut GList;
pub type FridaAgentSession_slistautoptr = *mut GSList;
pub type FridaAgentSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_agent_session_close(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_close_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_interrupt(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_interrupt_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_resume(
        self_: *mut FridaAgentSession,
        rx_batch_id: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_resume_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        tx_batch_id: *mut guint,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_enable_child_gating(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_enable_child_gating_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_disable_child_gating(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_disable_child_gating_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_create_script(
        self_: *mut FridaAgentSession,
        source: *const gchar,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_create_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaAgentScriptId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_create_script_from_bytes(
        self_: *mut FridaAgentSession,
        bytes: *mut guint8,
        bytes_length1: gint,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_create_script_from_bytes_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaAgentScriptId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_compile_script(
        self_: *mut FridaAgentSession,
        source: *const gchar,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_compile_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut guint8;
}
unsafe extern "C" {
    pub fn frida_agent_session_snapshot_script(
        self_: *mut FridaAgentSession,
        embed_script: *const gchar,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_snapshot_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        result_length1: *mut gint,
        error: *mut *mut GError,
    ) -> *mut guint8;
}
unsafe extern "C" {
    pub fn frida_agent_session_destroy_script(
        self_: *mut FridaAgentSession,
        script_id: *mut FridaAgentScriptId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_destroy_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_load_script(
        self_: *mut FridaAgentSession,
        script_id: *mut FridaAgentScriptId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_load_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_eternalize_script(
        self_: *mut FridaAgentSession,
        script_id: *mut FridaAgentScriptId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_eternalize_script_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_enable_debugger(
        self_: *mut FridaAgentSession,
        script_id: *mut FridaAgentScriptId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_enable_debugger_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_disable_debugger(
        self_: *mut FridaAgentSession,
        script_id: *mut FridaAgentScriptId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_disable_debugger_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_post_messages(
        self_: *mut FridaAgentSession,
        messages: *mut FridaAgentMessage,
        messages_length1: gint,
        batch_id: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_post_messages_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_join_portal(
        self_: *mut FridaAgentSession,
        address: *const gchar,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_join_portal_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        result: *mut FridaPortalMembershipId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_leave_portal(
        self_: *mut FridaAgentSession,
        membership_id: *mut FridaPortalMembershipId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_leave_portal_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_offer_peer_connection(
        self_: *mut FridaAgentSession,
        offer_sdp: *const gchar,
        peer_options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_offer_peer_connection_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        answer_sdp: *mut *mut gchar,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_add_candidates(
        self_: *mut FridaAgentSession,
        candidate_sdps: *mut *mut gchar,
        candidate_sdps_length1: gint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_add_candidates_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_notify_candidate_gathering_done(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_notify_candidate_gathering_done_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_begin_migration(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_begin_migration_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_commit_migration(
        self_: *mut FridaAgentSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_session_commit_migration_finish(
        self_: *mut FridaAgentSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_controller_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_host_child_id_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_host_child_id_dup(self_: *const FridaHostChildId) -> *mut FridaHostChildId;
}
unsafe extern "C" {
    pub fn frida_host_child_id_free(self_: *mut FridaHostChildId);
}
unsafe extern "C" {
    pub fn frida_spawn_start_state_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_controller_get_type() -> GType;
}
pub type FridaAgentController_autoptr = *mut FridaAgentController;
pub type FridaAgentController_listautoptr = *mut GList;
pub type FridaAgentController_slistautoptr = *mut GSList;
pub type FridaAgentController_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_fork(
        self_: *mut FridaAgentController,
        parent_pid: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_fork_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        parent_injectee_id: *mut guint,
        child_injectee_id: *mut guint,
        child_socket: *mut *mut GSocket,
        result: *mut FridaHostChildId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_specialize(
        self_: *mut FridaAgentController,
        pid: guint,
        identifier: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_specialize_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        specialized_injectee_id: *mut guint,
        specialized_pipe_address: *mut *mut gchar,
        result: *mut FridaHostChildId,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_recreate_agent_thread(
        self_: *mut FridaAgentController,
        pid: guint,
        injectee_id: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_recreate_agent_thread_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_wait_for_permission_to_resume(
        self_: *mut FridaAgentController,
        id: *mut FridaHostChildId,
        info: *mut FridaHostChildInfo,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_wait_for_permission_to_resume_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_exec(
        self_: *mut FridaAgentController,
        info: *mut FridaHostChildInfo,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_prepare_to_exec_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_cancel_exec(
        self_: *mut FridaAgentController,
        pid: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_cancel_exec_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_acknowledge_spawn(
        self_: *mut FridaAgentController,
        info: *mut FridaHostChildInfo,
        start_state: FridaSpawnStartState,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_controller_acknowledge_spawn_finish(
        self_: *mut FridaAgentController,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_sink_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_message_sink_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_message_sink_get_type() -> GType;
}
pub type FridaAgentMessageSink_autoptr = *mut FridaAgentMessageSink;
pub type FridaAgentMessageSink_listautoptr = *mut GList;
pub type FridaAgentMessageSink_slistautoptr = *mut GSList;
pub type FridaAgentMessageSink_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_agent_message_sink_post_messages(
        self_: *mut FridaAgentMessageSink,
        messages: *mut FridaAgentMessage,
        messages_length1: gint,
        batch_id: guint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_sink_post_messages_finish(
        self_: *mut FridaAgentMessageSink,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_init(
        self_: *mut FridaAgentMessage,
        kind: FridaAgentMessageKind,
        script_id: *mut FridaAgentScriptId,
        text: *const gchar,
        has_data: gboolean,
        data: *mut guint8,
        data_length1: gint,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_type() -> GType;
}
pub type FridaAgentMessageTransmitter_autoptr = *mut FridaAgentMessageTransmitter;
pub type FridaAgentMessageTransmitter_listautoptr = *mut GList;
pub type FridaAgentMessageTransmitter_slistautoptr = *mut GSList;
pub type FridaAgentMessageTransmitter_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_new(
        agent_session: *mut FridaAgentSession,
        persist_timeout: guint,
        frida_context: *mut GMainContext,
        dbus_context: *mut GMainContext,
    ) -> *mut FridaAgentMessageTransmitter;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_construct(
        object_type: GType,
        agent_session: *mut FridaAgentSession,
        persist_timeout: guint,
        frida_context: *mut GMainContext,
        dbus_context: *mut GMainContext,
    ) -> *mut FridaAgentMessageTransmitter;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_close(
        self_: *mut FridaAgentMessageTransmitter,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_close_finish(
        self_: *mut FridaAgentMessageTransmitter,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_error_quark() -> GQuark;
}
unsafe extern "C" {
    pub fn frida_error_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_check_okay_to_receive(
        self_: *mut FridaAgentMessageTransmitter,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_interrupt(
        self_: *mut FridaAgentMessageTransmitter,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_resume(
        self_: *mut FridaAgentMessageTransmitter,
        rx_batch_id: guint,
        tx_batch_id: *mut guint,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_notify_rx_batch_id(
        self_: *mut FridaAgentMessageTransmitter,
        batch_id: guint,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_offer_peer_connection(
        self_: *mut FridaAgentMessageTransmitter,
        offer_sdp: *const gchar,
        peer_options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_offer_peer_connection_finish(
        self_: *mut FridaAgentMessageTransmitter,
        _res_: *mut GAsyncResult,
        answer_sdp: *mut *mut gchar,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_add_candidates(
        self_: *mut FridaAgentMessageTransmitter,
        candidate_sdps: *mut *mut gchar,
        candidate_sdps_length1: gint,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_notify_candidate_gathering_done(
        self_: *mut FridaAgentMessageTransmitter,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_begin_migration(
        self_: *mut FridaAgentMessageTransmitter,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_commit_migration(
        self_: *mut FridaAgentMessageTransmitter,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_post_message_from_script(
        self_: *mut FridaAgentMessageTransmitter,
        script_id: *mut FridaAgentScriptId,
        json: *const gchar,
        data: *mut GBytes,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_post_message_from_debugger(
        self_: *mut FridaAgentMessageTransmitter,
        script_id: *mut FridaAgentScriptId,
        message: *const gchar,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_schedule_on_frida_thread(
        self_: *mut FridaAgentMessageTransmitter,
        function: GSourceFunc,
        function_target: gpointer,
        function_target_destroy_notify: GDestroyNotify,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_schedule_on_dbus_thread(
        self_: *mut FridaAgentMessageTransmitter,
        function: GSourceFunc,
        function_target: gpointer,
        function_target_destroy_notify: GDestroyNotify,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_agent_session(
        self_: *mut FridaAgentMessageTransmitter,
    ) -> *mut FridaAgentSession;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_persist_timeout(
        self_: *mut FridaAgentMessageTransmitter,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_message_sink(
        self_: *mut FridaAgentMessageTransmitter,
    ) -> *mut FridaAgentMessageSink;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_set_message_sink(
        self_: *mut FridaAgentMessageTransmitter,
        value: *mut FridaAgentMessageSink,
    );
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_frida_context(
        self_: *mut FridaAgentMessageTransmitter,
    ) -> *mut GMainContext;
}
unsafe extern "C" {
    pub fn frida_agent_message_transmitter_get_dbus_context(
        self_: *mut FridaAgentMessageTransmitter,
    ) -> *mut GMainContext;
}
unsafe extern "C" {
    pub fn frida_gadget_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_gadget_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_gadget_session_get_type() -> GType;
}
pub type FridaGadgetSession_autoptr = *mut FridaGadgetSession;
pub type FridaGadgetSession_listautoptr = *mut GList;
pub type FridaGadgetSession_slistautoptr = *mut GSList;
pub type FridaGadgetSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_gadget_session_break_and_resume(
        self_: *mut FridaGadgetSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_gadget_session_break_and_resume_finish(
        self_: *mut FridaGadgetSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_gadget_session_break_and_detach(
        self_: *mut FridaGadgetSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_gadget_session_break_and_detach_finish(
        self_: *mut FridaGadgetSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_gadget_breakpoint_action_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_channel_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_channel_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_channel_get_type() -> GType;
}
pub type FridaChannel_autoptr = *mut FridaChannel;
pub type FridaChannel_listautoptr = *mut GList;
pub type FridaChannel_slistautoptr = *mut GSList;
pub type FridaChannel_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_channel_close(
        self_: *mut FridaChannel,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_channel_close_finish(
        self_: *mut FridaChannel,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_channel_input(
        self_: *mut FridaChannel,
        data: *mut guint8,
        data_length1: gint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_channel_input_finish(
        self_: *mut FridaChannel,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_service_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_service_session_get_type() -> GType;
}
pub type FridaServiceSession_autoptr = *mut FridaServiceSession;
pub type FridaServiceSession_listautoptr = *mut GList;
pub type FridaServiceSession_slistautoptr = *mut GSList;
pub type FridaServiceSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_service_session_activate(
        self_: *mut FridaServiceSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_activate_finish(
        self_: *mut FridaServiceSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_cancel(
        self_: *mut FridaServiceSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_cancel_finish(
        self_: *mut FridaServiceSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_request(
        self_: *mut FridaServiceSession,
        parameters: *mut GVariant,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_request_finish(
        self_: *mut FridaServiceSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    ) -> *mut GVariant;
}
unsafe extern "C" {
    pub fn frida_transport_broker_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_transport_broker_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_transport_broker_get_type() -> GType;
}
pub type FridaTransportBroker_autoptr = *mut FridaTransportBroker;
pub type FridaTransportBroker_listautoptr = *mut GList;
pub type FridaTransportBroker_slistautoptr = *mut GSList;
pub type FridaTransportBroker_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_transport_broker_open_tcp_transport(
        self_: *mut FridaTransportBroker,
        id: *mut FridaAgentSessionId,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_transport_broker_open_tcp_transport_finish(
        self_: *mut FridaTransportBroker,
        _res_: *mut GAsyncResult,
        port: *mut guint16,
        token: *mut *mut gchar,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_portal_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_portal_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_portal_session_get_type() -> GType;
}
pub type FridaPortalSession_autoptr = *mut FridaPortalSession;
pub type FridaPortalSession_listautoptr = *mut GList;
pub type FridaPortalSession_slistautoptr = *mut GSList;
pub type FridaPortalSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_portal_session_join(
        self_: *mut FridaPortalSession,
        app: *mut FridaHostApplicationInfo,
        current_state: FridaSpawnStartState,
        interrupted_sessions: *mut FridaAgentSessionId,
        interrupted_sessions_length1: gint,
        options: *mut GHashTable,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_portal_session_join_finish(
        self_: *mut FridaPortalSession,
        _res_: *mut GAsyncResult,
        next_state: *mut FridaSpawnStartState,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_bus_session_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_bus_session_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_bus_session_get_type() -> GType;
}
pub type FridaBusSession_autoptr = *mut FridaBusSession;
pub type FridaBusSession_listautoptr = *mut GList;
pub type FridaBusSession_slistautoptr = *mut GSList;
pub type FridaBusSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_bus_session_attach(
        self_: *mut FridaBusSession,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_bus_session_attach_finish(
        self_: *mut FridaBusSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_bus_session_post(
        self_: *mut FridaBusSession,
        json: *const gchar,
        has_data: gboolean,
        data: *mut guint8,
        data_length1: gint,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_bus_session_post_finish(
        self_: *mut FridaBusSession,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_authentication_service_proxy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_authentication_service_register_object(
        object: *mut ::std::os::raw::c_void,
        connection: *mut GDBusConnection,
        path: *const gchar,
        error: *mut *mut GError,
    ) -> guint;
}
unsafe extern "C" {
    pub fn frida_authentication_service_get_type() -> GType;
}
pub type FridaAuthenticationService_autoptr = *mut FridaAuthenticationService;
pub type FridaAuthenticationService_listautoptr = *mut GList;
pub type FridaAuthenticationService_slistautoptr = *mut GSList;
pub type FridaAuthenticationService_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_authentication_service_authenticate(
        self_: *mut FridaAuthenticationService,
        token: *const gchar,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_authentication_service_authenticate_finish(
        self_: *mut FridaAuthenticationService,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    ) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_static_authentication_service_get_type() -> GType;
}
pub type FridaStaticAuthenticationService_autoptr = *mut FridaStaticAuthenticationService;
pub type FridaStaticAuthenticationService_listautoptr = *mut GList;
pub type FridaStaticAuthenticationService_slistautoptr = *mut GSList;
pub type FridaStaticAuthenticationService_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_static_authentication_service_new(
        token: *const gchar,
    ) -> *mut FridaStaticAuthenticationService;
}
unsafe extern "C" {
    pub fn frida_static_authentication_service_construct(
        object_type: GType,
        token: *const gchar,
    ) -> *mut FridaStaticAuthenticationService;
}
unsafe extern "C" {
    pub fn frida_static_authentication_service_get_token_hash(
        self_: *mut FridaStaticAuthenticationService,
    ) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_null_authentication_service_get_type() -> GType;
}
pub type FridaNullAuthenticationService_autoptr = *mut FridaNullAuthenticationService;
pub type FridaNullAuthenticationService_listautoptr = *mut GList;
pub type FridaNullAuthenticationService_slistautoptr = *mut GSList;
pub type FridaNullAuthenticationService_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_null_authentication_service_new() -> *mut FridaNullAuthenticationService;
}
unsafe extern "C" {
    pub fn frida_null_authentication_service_construct(
        object_type: GType,
    ) -> *mut FridaNullAuthenticationService;
}
unsafe extern "C" {
    pub fn frida_unauthorized_host_session_get_type() -> GType;
}
pub type FridaUnauthorizedHostSession_autoptr = *mut FridaUnauthorizedHostSession;
pub type FridaUnauthorizedHostSession_listautoptr = *mut GList;
pub type FridaUnauthorizedHostSession_slistautoptr = *mut GSList;
pub type FridaUnauthorizedHostSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_unauthorized_host_session_new() -> *mut FridaUnauthorizedHostSession;
}
unsafe extern "C" {
    pub fn frida_unauthorized_host_session_construct(
        object_type: GType,
    ) -> *mut FridaUnauthorizedHostSession;
}
unsafe extern "C" {
    pub fn frida_unauthorized_portal_session_get_type() -> GType;
}
pub type FridaUnauthorizedPortalSession_autoptr = *mut FridaUnauthorizedPortalSession;
pub type FridaUnauthorizedPortalSession_listautoptr = *mut GList;
pub type FridaUnauthorizedPortalSession_slistautoptr = *mut GSList;
pub type FridaUnauthorizedPortalSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_unauthorized_portal_session_new() -> *mut FridaUnauthorizedPortalSession;
}
unsafe extern "C" {
    pub fn frida_unauthorized_portal_session_construct(
        object_type: GType,
    ) -> *mut FridaUnauthorizedPortalSession;
}
unsafe extern "C" {
    pub fn frida_unauthorized_bus_session_get_type() -> GType;
}
pub type FridaUnauthorizedBusSession_autoptr = *mut FridaUnauthorizedBusSession;
pub type FridaUnauthorizedBusSession_listautoptr = *mut GList;
pub type FridaUnauthorizedBusSession_slistautoptr = *mut GSList;
pub type FridaUnauthorizedBusSession_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_unauthorized_bus_session_new() -> *mut FridaUnauthorizedBusSession;
}
unsafe extern "C" {
    pub fn frida_unauthorized_bus_session_construct(
        object_type: GType,
    ) -> *mut FridaUnauthorizedBusSession;
}
unsafe extern "C" {
    pub fn frida_realm_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_realm_from_nick(nick: *const gchar, error: *mut *mut GError) -> FridaRealm;
}
unsafe extern "C" {
    pub fn frida_realm_to_nick(self_: FridaRealm) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_spawn_start_state_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaSpawnStartState;
}
unsafe extern "C" {
    pub fn frida_spawn_start_state_to_nick(self_: FridaSpawnStartState) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_unload_policy_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_unload_policy_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaUnloadPolicy;
}
unsafe extern "C" {
    pub fn frida_unload_policy_to_nick(self_: FridaUnloadPolicy) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_init(self_: *mut FridaInjectorPayloadId, handle: guint);
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_hash(id: *mut FridaInjectorPayloadId) -> guint;
}
unsafe extern "C" {
    pub fn frida_injector_payload_id_equal(
        a: *mut FridaInjectorPayloadId,
        b: *mut FridaInjectorPayloadId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_mapped_library_blob_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_mapped_library_blob_dup(
        self_: *const FridaMappedLibraryBlob,
    ) -> *mut FridaMappedLibraryBlob;
}
unsafe extern "C" {
    pub fn frida_mapped_library_blob_free(self_: *mut FridaMappedLibraryBlob);
}
unsafe extern "C" {
    pub fn frida_mapped_library_blob_init(
        self_: *mut FridaMappedLibraryBlob,
        address: guint64,
        size: guint,
        allocated_size: guint,
    );
}
unsafe extern "C" {
    pub fn frida_linux_injector_state_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_linux_injector_state_dup(
        self_: *const FridaLinuxInjectorState,
    ) -> *mut FridaLinuxInjectorState;
}
unsafe extern "C" {
    pub fn frida_linux_injector_state_free(self_: *mut FridaLinuxInjectorState);
}
unsafe extern "C" {
    pub fn frida_posix_injector_state_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_posix_injector_state_dup(
        self_: *const FridaPosixInjectorState,
    ) -> *mut FridaPosixInjectorState;
}
unsafe extern "C" {
    pub fn frida_posix_injector_state_free(self_: *mut FridaPosixInjectorState);
}
unsafe extern "C" {
    pub fn frida_session_detach_reason_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_session_detach_reason_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaSessionDetachReason;
}
unsafe extern "C" {
    pub fn frida_session_detach_reason_to_nick(self_: FridaSessionDetachReason) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_throw_api_error(e: *mut GError, error: *mut *mut GError);
}
unsafe extern "C" {
    pub fn frida_throw_dbus_error(e: *mut GError, error: *mut *mut GError);
}
unsafe extern "C" {
    pub fn frida_host_application_info_init(
        self_: *mut FridaHostApplicationInfo,
        identifier: *const gchar,
        name: *const gchar,
        pid: guint,
        parameters: *mut GHashTable,
    );
}
unsafe extern "C" {
    pub fn frida_host_application_info_init_empty(self_: *mut FridaHostApplicationInfo);
}
unsafe extern "C" {
    pub fn frida_host_process_info_init(
        self_: *mut FridaHostProcessInfo,
        pid: guint,
        name: *const gchar,
        parameters: *mut GHashTable,
    );
}
unsafe extern "C" {
    pub fn frida_frontmost_query_options_get_type() -> GType;
}
pub type FridaFrontmostQueryOptions_autoptr = *mut FridaFrontmostQueryOptions;
pub type FridaFrontmostQueryOptions_listautoptr = *mut GList;
pub type FridaFrontmostQueryOptions_slistautoptr = *mut GSList;
pub type FridaFrontmostQueryOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_frontmost_query_options_new() -> *mut FridaFrontmostQueryOptions;
}
unsafe extern "C" {
    pub fn frida_frontmost_query_options_construct(
        object_type: GType,
    ) -> *mut FridaFrontmostQueryOptions;
}
unsafe extern "C" {
    pub fn frida_scope_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_frontmost_query_options_get_scope(
        self_: *mut FridaFrontmostQueryOptions,
    ) -> FridaScope;
}
unsafe extern "C" {
    pub fn frida_frontmost_query_options_set_scope(
        self_: *mut FridaFrontmostQueryOptions,
        value: FridaScope,
    );
}
unsafe extern "C" {
    pub fn frida_application_query_options_get_type() -> GType;
}
pub type FridaApplicationQueryOptions_autoptr = *mut FridaApplicationQueryOptions;
pub type FridaApplicationQueryOptions_listautoptr = *mut GList;
pub type FridaApplicationQueryOptions_slistautoptr = *mut GSList;
pub type FridaApplicationQueryOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_application_query_options_select_identifier(
        self_: *mut FridaApplicationQueryOptions,
        identifier: *const gchar,
    );
}
unsafe extern "C" {
    pub fn frida_application_query_options_has_selected_identifiers(
        self_: *mut FridaApplicationQueryOptions,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_application_query_options_enumerate_selected_identifiers(
        self_: *mut FridaApplicationQueryOptions,
        func: GFunc,
        func_target: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_application_query_options_new() -> *mut FridaApplicationQueryOptions;
}
unsafe extern "C" {
    pub fn frida_application_query_options_construct(
        object_type: GType,
    ) -> *mut FridaApplicationQueryOptions;
}
unsafe extern "C" {
    pub fn frida_application_query_options_get_scope(
        self_: *mut FridaApplicationQueryOptions,
    ) -> FridaScope;
}
unsafe extern "C" {
    pub fn frida_application_query_options_set_scope(
        self_: *mut FridaApplicationQueryOptions,
        value: FridaScope,
    );
}
unsafe extern "C" {
    pub fn frida_process_query_options_get_type() -> GType;
}
pub type FridaProcessQueryOptions_autoptr = *mut FridaProcessQueryOptions;
pub type FridaProcessQueryOptions_listautoptr = *mut GList;
pub type FridaProcessQueryOptions_slistautoptr = *mut GSList;
pub type FridaProcessQueryOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_process_query_options_select_pid(self_: *mut FridaProcessQueryOptions, pid: guint);
}
unsafe extern "C" {
    pub fn frida_process_query_options_has_selected_pids(
        self_: *mut FridaProcessQueryOptions,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_process_query_options_enumerate_selected_pids(
        self_: *mut FridaProcessQueryOptions,
        func: GFunc,
        func_target: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_process_query_options_new() -> *mut FridaProcessQueryOptions;
}
unsafe extern "C" {
    pub fn frida_process_query_options_construct(
        object_type: GType,
    ) -> *mut FridaProcessQueryOptions;
}
unsafe extern "C" {
    pub fn frida_process_query_options_get_scope(
        self_: *mut FridaProcessQueryOptions,
    ) -> FridaScope;
}
unsafe extern "C" {
    pub fn frida_process_query_options_set_scope(
        self_: *mut FridaProcessQueryOptions,
        value: FridaScope,
    );
}
unsafe extern "C" {
    pub fn frida_scope_from_nick(nick: *const gchar, error: *mut *mut GError) -> FridaScope;
}
unsafe extern "C" {
    pub fn frida_scope_to_nick(self_: FridaScope) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_init(self_: *mut FridaHostSpawnOptions);
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_compute_argv(
        self_: *mut FridaHostSpawnOptions,
        path: *const gchar,
        result_length1: *mut gint,
    ) -> *mut *mut gchar;
}
unsafe extern "C" {
    pub fn frida_host_spawn_options_compute_envp(
        self_: *mut FridaHostSpawnOptions,
        result_length1: *mut gint,
    ) -> *mut *mut gchar;
}
unsafe extern "C" {
    pub fn frida_session_options_get_type() -> GType;
}
pub type FridaSessionOptions_autoptr = *mut FridaSessionOptions;
pub type FridaSessionOptions_listautoptr = *mut GList;
pub type FridaSessionOptions_slistautoptr = *mut GSList;
pub type FridaSessionOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_session_options_new() -> *mut FridaSessionOptions;
}
unsafe extern "C" {
    pub fn frida_session_options_construct(object_type: GType) -> *mut FridaSessionOptions;
}
unsafe extern "C" {
    pub fn frida_session_options_get_realm(self_: *mut FridaSessionOptions) -> FridaRealm;
}
unsafe extern "C" {
    pub fn frida_session_options_set_realm(self_: *mut FridaSessionOptions, value: FridaRealm);
}
unsafe extern "C" {
    pub fn frida_session_options_get_persist_timeout(self_: *mut FridaSessionOptions) -> guint;
}
unsafe extern "C" {
    pub fn frida_session_options_set_persist_timeout(self_: *mut FridaSessionOptions, value: guint);
}
unsafe extern "C" {
    pub fn frida_session_options_get_emulated_agent_path(
        self_: *mut FridaSessionOptions,
    ) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_session_options_set_emulated_agent_path(
        self_: *mut FridaSessionOptions,
        value: *const gchar,
    );
}
unsafe extern "C" {
    pub fn frida_stdio_from_nick(nick: *const gchar, error: *mut *mut GError) -> FridaStdio;
}
unsafe extern "C" {
    pub fn frida_stdio_to_nick(self_: FridaStdio) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_host_spawn_info_init(
        self_: *mut FridaHostSpawnInfo,
        pid: guint,
        identifier: *const gchar,
    );
}
unsafe extern "C" {
    pub fn frida_host_child_id_init(self_: *mut FridaHostChildId, handle: guint);
}
unsafe extern "C" {
    pub fn frida_host_child_id_hash(id: *mut FridaHostChildId) -> guint;
}
unsafe extern "C" {
    pub fn frida_host_child_id_equal(
        a: *mut FridaHostChildId,
        b: *mut FridaHostChildId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_host_child_info_init(
        self_: *mut FridaHostChildInfo,
        pid: guint,
        parent_pid: guint,
        origin: FridaChildOrigin,
    );
}
unsafe extern "C" {
    pub fn frida_child_origin_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaChildOrigin;
}
unsafe extern "C" {
    pub fn frida_child_origin_to_nick(self_: FridaChildOrigin) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_crash_info_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_crash_info_dup(self_: *const FridaCrashInfo) -> *mut FridaCrashInfo;
}
unsafe extern "C" {
    pub fn frida_crash_info_free(self_: *mut FridaCrashInfo);
}
unsafe extern "C" {
    pub fn frida_crash_info_copy(self_: *const FridaCrashInfo, dest: *mut FridaCrashInfo);
}
unsafe extern "C" {
    pub fn frida_crash_info_destroy(self_: *mut FridaCrashInfo);
}
unsafe extern "C" {
    pub fn frida_crash_info_init(
        self_: *mut FridaCrashInfo,
        pid: guint,
        process_name: *const gchar,
        summary: *const gchar,
        report: *const gchar,
        parameters: *mut GHashTable,
    );
}
unsafe extern "C" {
    pub fn frida_crash_info_init_empty(self_: *mut FridaCrashInfo);
}
unsafe extern "C" {
    pub fn frida_agent_session_id_init(self_: *mut FridaAgentSessionId, handle: *const gchar);
}
unsafe extern "C" {
    pub fn frida_agent_session_id_init_generate(self_: *mut FridaAgentSessionId);
}
unsafe extern "C" {
    pub fn frida_agent_session_id_hash(id: *mut FridaAgentSessionId) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_session_id_equal(
        a: *mut FridaAgentSessionId,
        b: *mut FridaAgentSessionId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_channel_id_init(self_: *mut FridaChannelId, handle: *const gchar);
}
unsafe extern "C" {
    pub fn frida_channel_id_init_generate(self_: *mut FridaChannelId);
}
unsafe extern "C" {
    pub fn frida_channel_id_hash(id: *mut FridaChannelId) -> guint;
}
unsafe extern "C" {
    pub fn frida_channel_id_equal(a: *mut FridaChannelId, b: *mut FridaChannelId) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_service_session_id_init(self_: *mut FridaServiceSessionId, handle: *const gchar);
}
unsafe extern "C" {
    pub fn frida_service_session_id_init_generate(self_: *mut FridaServiceSessionId);
}
unsafe extern "C" {
    pub fn frida_service_session_id_hash(id: *mut FridaServiceSessionId) -> guint;
}
unsafe extern "C" {
    pub fn frida_service_session_id_equal(
        a: *mut FridaServiceSessionId,
        b: *mut FridaServiceSessionId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_agent_script_id_init(self_: *mut FridaAgentScriptId, handle: guint);
}
unsafe extern "C" {
    pub fn frida_agent_script_id_hash(id: *mut FridaAgentScriptId) -> guint;
}
unsafe extern "C" {
    pub fn frida_agent_script_id_equal(
        a: *mut FridaAgentScriptId,
        b: *mut FridaAgentScriptId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_script_options_get_type() -> GType;
}
pub type FridaScriptOptions_autoptr = *mut FridaScriptOptions;
pub type FridaScriptOptions_listautoptr = *mut GList;
pub type FridaScriptOptions_slistautoptr = *mut GSList;
pub type FridaScriptOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_script_options_new() -> *mut FridaScriptOptions;
}
unsafe extern "C" {
    pub fn frida_script_options_construct(object_type: GType) -> *mut FridaScriptOptions;
}
unsafe extern "C" {
    pub fn frida_script_options_get_name(self_: *mut FridaScriptOptions) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_script_options_set_name(self_: *mut FridaScriptOptions, value: *const gchar);
}
unsafe extern "C" {
    pub fn frida_script_options_get_snapshot(self_: *mut FridaScriptOptions) -> *mut GBytes;
}
unsafe extern "C" {
    pub fn frida_script_options_set_snapshot(self_: *mut FridaScriptOptions, value: *mut GBytes);
}
unsafe extern "C" {
    pub fn frida_snapshot_transport_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_script_options_get_snapshot_transport(
        self_: *mut FridaScriptOptions,
    ) -> FridaSnapshotTransport;
}
unsafe extern "C" {
    pub fn frida_script_options_set_snapshot_transport(
        self_: *mut FridaScriptOptions,
        value: FridaSnapshotTransport,
    );
}
unsafe extern "C" {
    pub fn frida_script_runtime_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_script_options_get_runtime(self_: *mut FridaScriptOptions) -> FridaScriptRuntime;
}
unsafe extern "C" {
    pub fn frida_script_options_set_runtime(
        self_: *mut FridaScriptOptions,
        value: FridaScriptRuntime,
    );
}
unsafe extern "C" {
    pub fn frida_snapshot_options_get_type() -> GType;
}
pub type FridaSnapshotOptions_autoptr = *mut FridaSnapshotOptions;
pub type FridaSnapshotOptions_listautoptr = *mut GList;
pub type FridaSnapshotOptions_slistautoptr = *mut GSList;
pub type FridaSnapshotOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_snapshot_options_new() -> *mut FridaSnapshotOptions;
}
unsafe extern "C" {
    pub fn frida_snapshot_options_construct(object_type: GType) -> *mut FridaSnapshotOptions;
}
unsafe extern "C" {
    pub fn frida_snapshot_options_get_warmup_script(
        self_: *mut FridaSnapshotOptions,
    ) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_snapshot_options_set_warmup_script(
        self_: *mut FridaSnapshotOptions,
        value: *const gchar,
    );
}
unsafe extern "C" {
    pub fn frida_snapshot_options_get_runtime(
        self_: *mut FridaSnapshotOptions,
    ) -> FridaScriptRuntime;
}
unsafe extern "C" {
    pub fn frida_snapshot_options_set_runtime(
        self_: *mut FridaSnapshotOptions,
        value: FridaScriptRuntime,
    );
}
unsafe extern "C" {
    pub fn frida_script_runtime_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaScriptRuntime;
}
unsafe extern "C" {
    pub fn frida_script_runtime_to_nick(self_: FridaScriptRuntime) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_init(self_: *mut FridaPortalMembershipId, handle: guint);
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_hash(id: *mut FridaPortalMembershipId) -> guint;
}
unsafe extern "C" {
    pub fn frida_portal_membership_id_equal(
        a: *mut FridaPortalMembershipId,
        b: *mut FridaPortalMembershipId,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_portal_options_get_type() -> GType;
}
pub type FridaPortalOptions_autoptr = *mut FridaPortalOptions;
pub type FridaPortalOptions_listautoptr = *mut GList;
pub type FridaPortalOptions_slistautoptr = *mut GSList;
pub type FridaPortalOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_portal_options_new() -> *mut FridaPortalOptions;
}
unsafe extern "C" {
    pub fn frida_portal_options_construct(object_type: GType) -> *mut FridaPortalOptions;
}
unsafe extern "C" {
    pub fn frida_portal_options_get_certificate(
        self_: *mut FridaPortalOptions,
    ) -> *mut GTlsCertificate;
}
unsafe extern "C" {
    pub fn frida_portal_options_set_certificate(
        self_: *mut FridaPortalOptions,
        value: *mut GTlsCertificate,
    );
}
unsafe extern "C" {
    pub fn frida_portal_options_get_token(self_: *mut FridaPortalOptions) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_portal_options_set_token(self_: *mut FridaPortalOptions, value: *const gchar);
}
unsafe extern "C" {
    pub fn frida_portal_options_get_acl(
        self_: *mut FridaPortalOptions,
        result_length1: *mut gint,
    ) -> *mut *mut gchar;
}
unsafe extern "C" {
    pub fn frida_portal_options_set_acl(
        self_: *mut FridaPortalOptions,
        value: *mut *mut gchar,
        value_length1: gint,
    );
}
unsafe extern "C" {
    pub fn frida_peer_options_get_type() -> GType;
}
pub type FridaPeerOptions_autoptr = *mut FridaPeerOptions;
pub type FridaPeerOptions_listautoptr = *mut GList;
pub type FridaPeerOptions_slistautoptr = *mut GSList;
pub type FridaPeerOptions_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_peer_options_clear_relays(self_: *mut FridaPeerOptions);
}
unsafe extern "C" {
    pub fn frida_relay_get_type() -> GType;
}
pub type FridaRelay_autoptr = *mut FridaRelay;
pub type FridaRelay_listautoptr = *mut GList;
pub type FridaRelay_slistautoptr = *mut GSList;
pub type FridaRelay_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_peer_options_add_relay(self_: *mut FridaPeerOptions, relay: *mut FridaRelay);
}
unsafe extern "C" {
    pub fn frida_peer_options_enumerate_relays(
        self_: *mut FridaPeerOptions,
        func: GFunc,
        func_target: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_peer_options_new() -> *mut FridaPeerOptions;
}
unsafe extern "C" {
    pub fn frida_peer_options_construct(object_type: GType) -> *mut FridaPeerOptions;
}
unsafe extern "C" {
    pub fn frida_peer_options_get_stun_server(self_: *mut FridaPeerOptions) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_peer_options_set_stun_server(self_: *mut FridaPeerOptions, value: *const gchar);
}
unsafe extern "C" {
    pub fn frida_relay_kind_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_relay_new(
        address: *const gchar,
        username: *const gchar,
        password: *const gchar,
        kind: FridaRelayKind,
    ) -> *mut FridaRelay;
}
unsafe extern "C" {
    pub fn frida_relay_construct(
        object_type: GType,
        address: *const gchar,
        username: *const gchar,
        password: *const gchar,
        kind: FridaRelayKind,
    ) -> *mut FridaRelay;
}
unsafe extern "C" {
    pub fn frida_relay_get_address(self_: *mut FridaRelay) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_relay_get_username(self_: *mut FridaRelay) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_relay_get_password(self_: *mut FridaRelay) -> *const gchar;
}
unsafe extern "C" {
    pub fn frida_relay_get_kind(self_: *mut FridaRelay) -> FridaRelayKind;
}
unsafe extern "C" {
    pub fn frida_make_parameters_dict() -> *mut GHashTable;
}
unsafe extern "C" {
    pub fn frida_compute_system_parameters() -> *mut GHashTable;
}
unsafe extern "C" {
    pub fn frida_object_path_for_agent_session(id: *mut FridaAgentSessionId) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_object_path_for_agent_message_sink(id: *mut FridaAgentSessionId) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_object_path_for_channel(id: *mut FridaChannelId) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_object_path_for_service_session(id: *mut FridaServiceSessionId) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_marshal_enum_from_nick(
        t_type: GType,
        t_dup_func: GBoxedCopyFunc,
        t_destroy_func: GDestroyNotify,
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> gpointer;
}
unsafe extern "C" {
    pub fn frida_marshal_enum_to_nick(
        t_type: GType,
        t_dup_func: GBoxedCopyFunc,
        t_destroy_func: GDestroyNotify,
        val: gint,
    ) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_numeric_int64_hash(val: *mut gint64) -> guint;
}
unsafe extern "C" {
    pub fn frida_numeric_int64_equal(val_a: *mut gint64, val_b: *mut gint64) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_numeric_uint64_hash(val: *mut guint64) -> guint;
}
unsafe extern "C" {
    pub fn frida_numeric_uint64_equal(val_a: *mut guint64, val_b: *mut guint64) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_channel_registry_get_type() -> GType;
}
pub type FridaChannelRegistry_autoptr = *mut FridaChannelRegistry;
pub type FridaChannelRegistry_listautoptr = *mut GList;
pub type FridaChannelRegistry_slistautoptr = *mut GSList;
pub type FridaChannelRegistry_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_channel_registry_clear(self_: *mut FridaChannelRegistry);
}
unsafe extern "C" {
    pub fn frida_channel_registry_register(
        self_: *mut FridaChannelRegistry,
        id: *mut FridaChannelId,
        stream: *mut GIOStream,
    );
}
unsafe extern "C" {
    pub fn frida_channel_registry_link(
        self_: *mut FridaChannelRegistry,
        id: *mut FridaChannelId,
        error: *mut *mut GError,
    ) -> *mut GIOStream;
}
unsafe extern "C" {
    pub fn frida_channel_registry_unlink(self_: *mut FridaChannelRegistry, id: *mut FridaChannelId);
}
unsafe extern "C" {
    pub fn frida_channel_registry_new() -> *mut FridaChannelRegistry;
}
unsafe extern "C" {
    pub fn frida_channel_registry_construct(object_type: GType) -> *mut FridaChannelRegistry;
}
unsafe extern "C" {
    pub fn frida_channel_endpoint_get_type() -> GType;
}
pub type FridaChannelEndpoint_autoptr = *mut FridaChannelEndpoint;
pub type FridaChannelEndpoint_listautoptr = *mut GList;
pub type FridaChannelEndpoint_slistautoptr = *mut GSList;
pub type FridaChannelEndpoint_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_channel_endpoint_new(stream: *mut GIOStream) -> *mut FridaChannelEndpoint;
}
unsafe extern "C" {
    pub fn frida_channel_endpoint_construct(
        object_type: GType,
        stream: *mut GIOStream,
    ) -> *mut FridaChannelEndpoint;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_get_type() -> GType;
}
pub type FridaVirtualStream_autoptr = *mut FridaVirtualStream;
pub type FridaVirtualStream_listautoptr = *mut GList;
pub type FridaVirtualStream_slistautoptr = *mut GSList;
pub type FridaVirtualStream_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_channel_stream_get_type() -> GType;
}
pub type FridaChannelStream_autoptr = *mut FridaChannelStream;
pub type FridaChannelStream_listautoptr = *mut GList;
pub type FridaChannelStream_slistautoptr = *mut GSList;
pub type FridaChannelStream_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_channel_stream_new(channel: *mut FridaChannel) -> *mut FridaChannelStream;
}
unsafe extern "C" {
    pub fn frida_channel_stream_construct(
        object_type: GType,
        channel: *mut FridaChannel,
    ) -> *mut FridaChannelStream;
}
unsafe extern "C" {
    pub fn frida_channel_stream_abandon(self_: *mut FridaChannelStream);
}
unsafe extern "C" {
    pub fn frida_channel_stream_get_channel(self_: *mut FridaChannelStream) -> *mut FridaChannel;
}
unsafe extern "C" {
    pub fn frida_service_session_registry_get_type() -> GType;
}
pub type FridaServiceSessionRegistry_autoptr = *mut FridaServiceSessionRegistry;
pub type FridaServiceSessionRegistry_listautoptr = *mut GList;
pub type FridaServiceSessionRegistry_slistautoptr = *mut GSList;
pub type FridaServiceSessionRegistry_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_service_session_registry_clear(self_: *mut FridaServiceSessionRegistry);
}
unsafe extern "C" {
    pub fn frida_service_session_registry_register(
        self_: *mut FridaServiceSessionRegistry,
        id: *mut FridaServiceSessionId,
        session: *mut FridaServiceSession,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_registry_link(
        self_: *mut FridaServiceSessionRegistry,
        id: *mut FridaServiceSessionId,
        error: *mut *mut GError,
    ) -> *mut FridaServiceSession;
}
unsafe extern "C" {
    pub fn frida_service_session_registry_unlink(
        self_: *mut FridaServiceSessionRegistry,
        id: *mut FridaServiceSessionId,
    );
}
unsafe extern "C" {
    pub fn frida_service_session_registry_new() -> *mut FridaServiceSessionRegistry;
}
unsafe extern "C" {
    pub fn frida_service_session_registry_construct(
        object_type: GType,
    ) -> *mut FridaServiceSessionRegistry;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_state_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_query_initial_state(
        self_: *mut FridaVirtualStream,
    ) -> FridaVirtualStreamState;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_query_events(self_: *mut FridaVirtualStream) -> GIOCondition;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_handle_close(self_: *mut FridaVirtualStream);
}
unsafe extern "C" {
    pub fn frida_virtual_stream_shutdown_read(
        self_: *mut FridaVirtualStream,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_virtual_stream_shutdown_write(
        self_: *mut FridaVirtualStream,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_virtual_stream_read(
        self_: *mut FridaVirtualStream,
        buffer: *mut guint8,
        buffer_length1: gint,
        error: *mut *mut GError,
    ) -> gssize;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_write(
        self_: *mut FridaVirtualStream,
        buffer: *mut guint8,
        buffer_length1: gint,
        error: *mut *mut GError,
    ) -> gssize;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_with_state_lock(
        self_: *mut FridaVirtualStream,
        func: FridaVirtualStreamWorkFunc,
        func_target: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_virtual_stream_register_source(
        self_: *mut FridaVirtualStream,
        source: *mut GSource,
        condition: GIOCondition,
    );
}
unsafe extern "C" {
    pub fn frida_virtual_stream_unregister_source(
        self_: *mut FridaVirtualStream,
        source: *mut GSource,
    );
}
unsafe extern "C" {
    pub fn frida_virtual_stream_update_pending_io(self_: *mut FridaVirtualStream);
}
unsafe extern "C" {
    pub fn frida_virtual_stream_construct(object_type: GType) -> *mut FridaVirtualStream;
}
unsafe extern "C" {
    pub fn frida_virtual_stream_get_pending_io(self_: *mut FridaVirtualStream) -> GIOCondition;
}
unsafe extern "C" {
    pub fn frida_virtual_input_stream_get_type() -> GType;
}
pub type FridaVirtualInputStream_autoptr = *mut FridaVirtualInputStream;
pub type FridaVirtualInputStream_listautoptr = *mut GList;
pub type FridaVirtualInputStream_slistautoptr = *mut GSList;
pub type FridaVirtualInputStream_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_virtual_output_stream_get_type() -> GType;
}
pub type FridaVirtualOutputStream_autoptr = *mut FridaVirtualOutputStream;
pub type FridaVirtualOutputStream_listautoptr = *mut GList;
pub type FridaVirtualOutputStream_slistautoptr = *mut GSList;
pub type FridaVirtualOutputStream_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_rpc_client_get_type() -> GType;
}
pub type FridaRpcClient_autoptr = *mut FridaRpcClient;
pub type FridaRpcClient_listautoptr = *mut GList;
pub type FridaRpcClient_slistautoptr = *mut GSList;
pub type FridaRpcClient_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_rpc_peer_get_type() -> GType;
}
pub type FridaRpcPeer_autoptr = *mut FridaRpcPeer;
pub type FridaRpcPeer_listautoptr = *mut GList;
pub type FridaRpcPeer_slistautoptr = *mut GSList;
pub type FridaRpcPeer_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_rpc_client_new(peer: *mut FridaRpcPeer) -> *mut FridaRpcClient;
}
unsafe extern "C" {
    pub fn frida_rpc_client_construct(
        object_type: GType,
        peer: *mut FridaRpcPeer,
    ) -> *mut FridaRpcClient;
}
unsafe extern "C" {
    pub fn frida_rpc_client_call(
        self_: *mut FridaRpcClient,
        method: *const gchar,
        args: *mut *mut JsonNode,
        args_length1: gint,
        data: *mut GBytes,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_rpc_client_call_finish(
        self_: *mut FridaRpcClient,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    ) -> *mut JsonNode;
}
unsafe extern "C" {
    pub fn frida_rpc_client_try_handle_message(
        self_: *mut FridaRpcClient,
        json: *const gchar,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_rpc_client_get_peer(self_: *mut FridaRpcClient) -> *mut FridaRpcPeer;
}
unsafe extern "C" {
    pub fn frida_rpc_peer_post_rpc_message(
        self_: *mut FridaRpcPeer,
        json: *const gchar,
        data: *mut GBytes,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_rpc_peer_post_rpc_message_finish(
        self_: *mut FridaRpcPeer,
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_peer_connection_configure_agent(
        agent: *mut NiceAgent,
        stream_id: guint,
        component_id: guint,
        options: *mut FridaPeerOptions,
        cancellable: *mut GCancellable,
        _callback_: GAsyncReadyCallback,
        _user_data_: gpointer,
    );
}
unsafe extern "C" {
    pub fn frida_peer_connection_configure_agent_finish(
        _res_: *mut GAsyncResult,
        error: *mut *mut GError,
    );
}
unsafe extern "C" {
    pub fn frida_peer_connection_compute_certificate_fingerprint(
        cert_der: *mut guint8,
        cert_der_length1: gint,
    ) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_ref(instance: gpointer) -> gpointer;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_unref(instance: gpointer);
}
unsafe extern "C" {
    pub fn frida_param_spec_peer_session_description(
        name: *const gchar,
        nick: *const gchar,
        blurb: *const gchar,
        object_type: GType,
        flags: GParamFlags,
    ) -> *mut GParamSpec;
}
unsafe extern "C" {
    pub fn frida_value_set_peer_session_description(value: *mut GValue, v_object: gpointer);
}
unsafe extern "C" {
    pub fn frida_value_take_peer_session_description(value: *mut GValue, v_object: gpointer);
}
unsafe extern "C" {
    pub fn frida_value_get_peer_session_description(value: *const GValue) -> gpointer;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_get_type() -> GType;
}
pub type FridaPeerSessionDescription_autoptr = *mut FridaPeerSessionDescription;
pub type FridaPeerSessionDescription_listautoptr = *mut GList;
pub type FridaPeerSessionDescription_slistautoptr = *mut GSList;
pub type FridaPeerSessionDescription_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_peer_setup_get_type() -> GType;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_parse(
        sdp: *const gchar,
        error: *mut *mut GError,
    ) -> *mut FridaPeerSessionDescription;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_to_sdp(
        self_: *mut FridaPeerSessionDescription,
    ) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_new() -> *mut FridaPeerSessionDescription;
}
unsafe extern "C" {
    pub fn frida_peer_session_description_construct(
        object_type: GType,
    ) -> *mut FridaPeerSessionDescription;
}
unsafe extern "C" {
    pub fn frida_peer_session_id_generate() -> guint64;
}
unsafe extern "C" {
    pub fn frida_peer_setup_from_nick(
        nick: *const gchar,
        error: *mut *mut GError,
    ) -> FridaPeerSetup;
}
unsafe extern "C" {
    pub fn frida_peer_setup_to_nick(self_: FridaPeerSetup) -> *mut gchar;
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_type() -> GType;
}
pub type FridaPeerSocket_autoptr = *mut FridaPeerSocket;
pub type FridaPeerSocket_listautoptr = *mut GList;
pub type FridaPeerSocket_slistautoptr = *mut GSList;
pub type FridaPeerSocket_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_peer_socket_new(
        agent: *mut NiceAgent,
        stream_id: guint,
        component_id: guint,
    ) -> *mut FridaPeerSocket;
}
unsafe extern "C" {
    pub fn frida_peer_socket_construct(
        object_type: GType,
        agent: *mut NiceAgent,
        stream_id: guint,
        component_id: guint,
    ) -> *mut FridaPeerSocket;
}
unsafe extern "C" {
    pub fn frida_peer_socket_datagram_receive_messages(
        self_: *mut FridaPeerSocket,
        messages: *mut GInputMessage,
        messages_length1: guint,
        flags: gint,
        timeout: gint64,
        cancellable: *mut GCancellable,
        error: *mut *mut GError,
    ) -> gint;
}
unsafe extern "C" {
    pub fn frida_peer_socket_datagram_send_messages(
        self_: *mut FridaPeerSocket,
        messages: *mut GOutputMessage,
        messages_length1: guint,
        flags: gint,
        timeout: gint64,
        cancellable: *mut GCancellable,
        error: *mut *mut GError,
    ) -> gint;
}
unsafe extern "C" {
    pub fn frida_peer_socket_datagram_create_source(
        self_: *mut FridaPeerSocket,
        condition: GIOCondition,
        cancellable: *mut GCancellable,
    ) -> *mut GSource;
}
unsafe extern "C" {
    pub fn frida_peer_socket_datagram_condition_check(
        self_: *mut FridaPeerSocket,
        condition: GIOCondition,
    ) -> GIOCondition;
}
unsafe extern "C" {
    pub fn frida_peer_socket_datagram_condition_wait(
        self_: *mut FridaPeerSocket,
        condition: GIOCondition,
        timeout: gint64,
        cancellable: *mut GCancellable,
        error: *mut *mut GError,
    ) -> gboolean;
}
unsafe extern "C" {
    pub fn frida_peer_socket_register_source(
        self_: *mut FridaPeerSocket,
        source: *mut GSource,
        condition: GIOCondition,
    );
}
unsafe extern "C" {
    pub fn frida_peer_socket_unregister_source(self_: *mut FridaPeerSocket, source: *mut GSource);
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_agent(self_: *mut FridaPeerSocket) -> *mut NiceAgent;
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_stream_id(self_: *mut FridaPeerSocket) -> guint;
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_component_id(self_: *mut FridaPeerSocket) -> guint;
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_main_context(self_: *mut FridaPeerSocket) -> *mut GMainContext;
}
unsafe extern "C" {
    pub fn frida_peer_socket_get_pending_io(self_: *mut FridaPeerSocket) -> GIOCondition;
}
unsafe extern "C" {
    pub fn frida_sctp_connection_get_type() -> GType;
}
pub type FridaSctpConnection_autoptr = *mut FridaSctpConnection;
pub type FridaSctpConnection_listautoptr = *mut GList;
pub type FridaSctpConnection_slistautoptr = *mut GSList;
pub type FridaSctpConnection_queueautoptr = *mut GQueue;
unsafe extern "C" {
    pub fn frida_sctp_connection_new(
        transport_socket: *mut GDatagramBased,
        setup: FridaPeerSetup,
        port: guint16,
        max_message_size: gsize,
    ) -> *mut FridaSctpConnection;
}
unsafe extern "C" {
